-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/04a_eth_an_multivariable_eth16.log
  log type:  text
 opened on:   5 May 2021, 17:34:15

. 
. cap file close tablecontent

. file open tablecontent using ./output/table2_eth16.txt, write text replace
(note: file ./output/table2_eth16.txt not found)

. file write tablecontent ("Table 2: Association between ethnicity in 16 catego
> ries and COVID-19 outcomes - No care homes") _n

. file write tablecontent _tab ("Denominator") _tab ("Event") _tab ("Total pers
> on-weeks") _tab ("Rate per 1,000") _tab ("Crude") _tab _tab ("Age/Sex Adjuste
> d") _tab _tab ("Age/Sex/IMD Adjusted") _tab _tab      ("plus co-morbidities")
>  _tab _tab       ("plus hh siz")  _tab _tab  _n

. file write tablecontent _tab _tab _tab _tab _tab   ("HR") _tab ("95% CI") _ta
> b ("HR") _tab ("95% CI") _tab ("HR") _tab ("95% CI") _tab ("HR") _tab ("95% C
> I") _tab ("HR") _tab ("95% CI") _tab _tab _n

. 
. 
. 
. foreach i of global outcomes {
  2. use ./output/analysis_dataset_STSET_`i'.dta, clear
  3. drop if carehome==1
  4. safetab ethnicity_16 `i', missing row
  5. } //end outcomes
(11,780 observations deleted)

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                  |    outcome tested
Eth 16 categories |         0          1 |     Total
------------------+----------------------+----------
          British |     1,000      2,183 |     3,183 
                  |     31.42      68.58 |    100.00 
------------------+----------------------+----------
            Irish |     1,027      2,106 |     3,133 
                  |     32.78      67.22 |    100.00 
------------------+----------------------+----------
      Other White |     1,065      2,090 |     3,155 
                  |     33.76      66.24 |    100.00 
------------------+----------------------+----------
White + Caribbean |     1,015      2,094 |     3,109 
                  |     32.65      67.35 |    100.00 
------------------+----------------------+----------
  White + African |       966      2,183 |     3,149 
                  |     30.68      69.32 |    100.00 
------------------+----------------------+----------
    White + Asian |       953      2,144 |     3,097 
                  |     30.77      69.23 |    100.00 
------------------+----------------------+----------
      Other mixed |       948      2,172 |     3,120 
                  |     30.38      69.62 |    100.00 
------------------+----------------------+----------
           Indian |     1,008      2,115 |     3,123 
                  |     32.28      67.72 |    100.00 
------------------+----------------------+----------
        Pakistani |     1,074      2,110 |     3,184 
                  |     33.73      66.27 |    100.00 
------------------+----------------------+----------
      Bangladeshi |       987      2,159 |     3,146 
                  |     31.37      68.63 |    100.00 
------------------+----------------------+----------
      Other Asian |     1,010      2,138 |     3,148 
                  |     32.08      67.92 |    100.00 
------------------+----------------------+----------
        Caribbean |       951      2,177 |     3,128 
                  |     30.40      69.60 |    100.00 
------------------+----------------------+----------
          African |     1,030      2,169 |     3,199 
                  |     32.20      67.80 |    100.00 
------------------+----------------------+----------
      Other Black |       984      2,125 |     3,109 
                  |     31.65      68.35 |    100.00 
------------------+----------------------+----------
          Chinese |     1,030      2,070 |     3,100 
                  |     33.23      66.77 |    100.00 
------------------+----------------------+----------
            Other |     1,033      2,159 |     3,192 
                  |     32.36      67.64 |    100.00 
------------------+----------------------+----------
          Unknown |     5,521     11,175 |    16,696 
                  |     33.07      66.93 |    100.00 
------------------+----------------------+----------
            Total |    21,602     45,369 |    66,971 
                  |     32.26      67.74 |    100.00 
(11,780 observations deleted)

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                  | outcome positivetest
Eth 16 categories |         0          1 |     Total
------------------+----------------------+----------
          British |     1,002      2,181 |     3,183 
                  |     31.48      68.52 |    100.00 
------------------+----------------------+----------
            Irish |       997      2,136 |     3,133 
                  |     31.82      68.18 |    100.00 
------------------+----------------------+----------
      Other White |     1,055      2,100 |     3,155 
                  |     33.44      66.56 |    100.00 
------------------+----------------------+----------
White + Caribbean |       998      2,111 |     3,109 
                  |     32.10      67.90 |    100.00 
------------------+----------------------+----------
  White + African |     1,012      2,137 |     3,149 
                  |     32.14      67.86 |    100.00 
------------------+----------------------+----------
    White + Asian |     1,023      2,074 |     3,097 
                  |     33.03      66.97 |    100.00 
------------------+----------------------+----------
      Other mixed |       987      2,133 |     3,120 
                  |     31.63      68.37 |    100.00 
------------------+----------------------+----------
           Indian |     1,007      2,116 |     3,123 
                  |     32.24      67.76 |    100.00 
------------------+----------------------+----------
        Pakistani |     1,026      2,158 |     3,184 
                  |     32.22      67.78 |    100.00 
------------------+----------------------+----------
      Bangladeshi |     1,028      2,118 |     3,146 
                  |     32.68      67.32 |    100.00 
------------------+----------------------+----------
      Other Asian |     1,022      2,126 |     3,148 
                  |     32.47      67.53 |    100.00 
------------------+----------------------+----------
        Caribbean |       971      2,157 |     3,128 
                  |     31.04      68.96 |    100.00 
------------------+----------------------+----------
          African |     1,028      2,171 |     3,199 
                  |     32.14      67.86 |    100.00 
------------------+----------------------+----------
      Other Black |       990      2,119 |     3,109 
                  |     31.84      68.16 |    100.00 
------------------+----------------------+----------
          Chinese |     1,019      2,081 |     3,100 
                  |     32.87      67.13 |    100.00 
------------------+----------------------+----------
            Other |     1,079      2,113 |     3,192 
                  |     33.80      66.20 |    100.00 
------------------+----------------------+----------
          Unknown |     5,407     11,289 |    16,696 
                  |     32.39      67.61 |    100.00 
------------------+----------------------+----------
            Total |    21,651     45,320 |    66,971 
                  |     32.33      67.67 |    100.00 
(11,780 observations deleted)

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                  |      outcome hes
Eth 16 categories |         0          1 |     Total
------------------+----------------------+----------
          British |     2,463        720 |     3,183 
                  |     77.38      22.62 |    100.00 
------------------+----------------------+----------
            Irish |     2,460        673 |     3,133 
                  |     78.52      21.48 |    100.00 
------------------+----------------------+----------
      Other White |     2,511        644 |     3,155 
                  |     79.59      20.41 |    100.00 
------------------+----------------------+----------
White + Caribbean |     2,442        667 |     3,109 
                  |     78.55      21.45 |    100.00 
------------------+----------------------+----------
  White + African |     2,458        691 |     3,149 
                  |     78.06      21.94 |    100.00 
------------------+----------------------+----------
    White + Asian |     2,472        625 |     3,097 
                  |     79.82      20.18 |    100.00 
------------------+----------------------+----------
      Other mixed |     2,462        658 |     3,120 
                  |     78.91      21.09 |    100.00 
------------------+----------------------+----------
           Indian |     2,472        651 |     3,123 
                  |     79.15      20.85 |    100.00 
------------------+----------------------+----------
        Pakistani |     2,554        630 |     3,184 
                  |     80.21      19.79 |    100.00 
------------------+----------------------+----------
      Bangladeshi |     2,447        699 |     3,146 
                  |     77.78      22.22 |    100.00 
------------------+----------------------+----------
      Other Asian |     2,478        670 |     3,148 
                  |     78.72      21.28 |    100.00 
------------------+----------------------+----------
        Caribbean |     2,470        658 |     3,128 
                  |     78.96      21.04 |    100.00 
------------------+----------------------+----------
          African |     2,531        668 |     3,199 
                  |     79.12      20.88 |    100.00 
------------------+----------------------+----------
      Other Black |     2,442        667 |     3,109 
                  |     78.55      21.45 |    100.00 
------------------+----------------------+----------
          Chinese |     2,445        655 |     3,100 
                  |     78.87      21.13 |    100.00 
------------------+----------------------+----------
            Other |     2,506        686 |     3,192 
                  |     78.51      21.49 |    100.00 
------------------+----------------------+----------
          Unknown |    13,182      3,514 |    16,696 
                  |     78.95      21.05 |    100.00 
------------------+----------------------+----------
            Total |    52,795     14,176 |    66,971 
                  |     78.83      21.17 |    100.00 
(11,780 observations deleted)

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                  |      outcome icu
Eth 16 categories |         0          1 |     Total
------------------+----------------------+----------
          British |     2,848        335 |     3,183 
                  |     89.48      10.52 |    100.00 
------------------+----------------------+----------
            Irish |     2,762        371 |     3,133 
                  |     88.16      11.84 |    100.00 
------------------+----------------------+----------
      Other White |     2,846        309 |     3,155 
                  |     90.21       9.79 |    100.00 
------------------+----------------------+----------
White + Caribbean |     2,778        331 |     3,109 
                  |     89.35      10.65 |    100.00 
------------------+----------------------+----------
  White + African |     2,820        329 |     3,149 
                  |     89.55      10.45 |    100.00 
------------------+----------------------+----------
    White + Asian |     2,765        332 |     3,097 
                  |     89.28      10.72 |    100.00 
------------------+----------------------+----------
      Other mixed |     2,779        341 |     3,120 
                  |     89.07      10.93 |    100.00 
------------------+----------------------+----------
           Indian |     2,796        327 |     3,123 
                  |     89.53      10.47 |    100.00 
------------------+----------------------+----------
        Pakistani |     2,867        317 |     3,184 
                  |     90.04       9.96 |    100.00 
------------------+----------------------+----------
      Bangladeshi |     2,830        316 |     3,146 
                  |     89.96      10.04 |    100.00 
------------------+----------------------+----------
      Other Asian |     2,832        316 |     3,148 
                  |     89.96      10.04 |    100.00 
------------------+----------------------+----------
        Caribbean |     2,796        332 |     3,128 
                  |     89.39      10.61 |    100.00 
------------------+----------------------+----------
          African |     2,864        335 |     3,199 
                  |     89.53      10.47 |    100.00 
------------------+----------------------+----------
      Other Black |     2,777        332 |     3,109 
                  |     89.32      10.68 |    100.00 
------------------+----------------------+----------
          Chinese |     2,757        343 |     3,100 
                  |     88.94      11.06 |    100.00 
------------------+----------------------+----------
            Other |     2,860        332 |     3,192 
                  |     89.60      10.40 |    100.00 
------------------+----------------------+----------
          Unknown |    14,911      1,785 |    16,696 
                  |     89.31      10.69 |    100.00 
------------------+----------------------+----------
            Total |    59,888      7,083 |    66,971 
                  |     89.42      10.58 |    100.00 
(11,780 observations deleted)

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                  | outcome onscoviddeath
Eth 16 categories |         0          1 |     Total
------------------+----------------------+----------
          British |     3,010        173 |     3,183 
                  |     94.56       5.44 |    100.00 
------------------+----------------------+----------
            Irish |     2,932        201 |     3,133 
                  |     93.58       6.42 |    100.00 
------------------+----------------------+----------
      Other White |     2,962        193 |     3,155 
                  |     93.88       6.12 |    100.00 
------------------+----------------------+----------
White + Caribbean |     2,915        194 |     3,109 
                  |     93.76       6.24 |    100.00 
------------------+----------------------+----------
  White + African |     2,978        171 |     3,149 
                  |     94.57       5.43 |    100.00 
------------------+----------------------+----------
    White + Asian |     2,907        190 |     3,097 
                  |     93.87       6.13 |    100.00 
------------------+----------------------+----------
      Other mixed |     2,935        185 |     3,120 
                  |     94.07       5.93 |    100.00 
------------------+----------------------+----------
           Indian |     2,933        190 |     3,123 
                  |     93.92       6.08 |    100.00 
------------------+----------------------+----------
        Pakistani |     2,988        196 |     3,184 
                  |     93.84       6.16 |    100.00 
------------------+----------------------+----------
      Bangladeshi |     2,939        207 |     3,146 
                  |     93.42       6.58 |    100.00 
------------------+----------------------+----------
      Other Asian |     2,961        187 |     3,148 
                  |     94.06       5.94 |    100.00 
------------------+----------------------+----------
        Caribbean |     2,961        167 |     3,128 
                  |     94.66       5.34 |    100.00 
------------------+----------------------+----------
          African |     3,004        195 |     3,199 
                  |     93.90       6.10 |    100.00 
------------------+----------------------+----------
      Other Black |     2,924        185 |     3,109 
                  |     94.05       5.95 |    100.00 
------------------+----------------------+----------
          Chinese |     2,898        202 |     3,100 
                  |     93.48       6.52 |    100.00 
------------------+----------------------+----------
            Other |     2,999        193 |     3,192 
                  |     93.95       6.05 |    100.00 
------------------+----------------------+----------
          Unknown |    15,698        998 |    16,696 
                  |     94.02       5.98 |    100.00 
------------------+----------------------+----------
            Total |    62,944      4,027 |    66,971 
                  |     93.99       6.01 |    100.00 
(11,780 observations deleted)

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                  |        outcome
                  |   ons_noncoviddeath
Eth 16 categories |         0          1 |     Total
------------------+----------------------+----------
          British |     2,627        556 |     3,183 
                  |     82.53      17.47 |    100.00 
------------------+----------------------+----------
            Irish |     2,584        549 |     3,133 
                  |     82.48      17.52 |    100.00 
------------------+----------------------+----------
      Other White |     2,560        595 |     3,155 
                  |     81.14      18.86 |    100.00 
------------------+----------------------+----------
White + Caribbean |     2,549        560 |     3,109 
                  |     81.99      18.01 |    100.00 
------------------+----------------------+----------
  White + African |     2,621        528 |     3,149 
                  |     83.23      16.77 |    100.00 
------------------+----------------------+----------
    White + Asian |     2,503        594 |     3,097 
                  |     80.82      19.18 |    100.00 
------------------+----------------------+----------
      Other mixed |     2,579        541 |     3,120 
                  |     82.66      17.34 |    100.00 
------------------+----------------------+----------
           Indian |     2,550        573 |     3,123 
                  |     81.65      18.35 |    100.00 
------------------+----------------------+----------
        Pakistani |     2,584        600 |     3,184 
                  |     81.16      18.84 |    100.00 
------------------+----------------------+----------
      Bangladeshi |     2,592        554 |     3,146 
                  |     82.39      17.61 |    100.00 
------------------+----------------------+----------
      Other Asian |     2,589        559 |     3,148 
                  |     82.24      17.76 |    100.00 
------------------+----------------------+----------
        Caribbean |     2,565        563 |     3,128 
                  |     82.00      18.00 |    100.00 
------------------+----------------------+----------
          African |     2,580        619 |     3,199 
                  |     80.65      19.35 |    100.00 
------------------+----------------------+----------
      Other Black |     2,563        546 |     3,109 
                  |     82.44      17.56 |    100.00 
------------------+----------------------+----------
          Chinese |     2,549        551 |     3,100 
                  |     82.23      17.77 |    100.00 
------------------+----------------------+----------
            Other |     2,568        624 |     3,192 
                  |     80.45      19.55 |    100.00 
------------------+----------------------+----------
          Unknown |    13,735      2,961 |    16,696 
                  |     82.27      17.73 |    100.00 
------------------+----------------------+----------
            Total |    54,898     12,073 |    66,971 
                  |     81.97      18.03 |    100.00 
(11,780 observations deleted)

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

                  |   outcome onsdeath
Eth 16 categories |         0          1 |     Total
------------------+----------------------+----------
          British |     2,454        729 |     3,183 
                  |     77.10      22.90 |    100.00 
------------------+----------------------+----------
            Irish |     2,383        750 |     3,133 
                  |     76.06      23.94 |    100.00 
------------------+----------------------+----------
      Other White |     2,367        788 |     3,155 
                  |     75.02      24.98 |    100.00 
------------------+----------------------+----------
White + Caribbean |     2,355        754 |     3,109 
                  |     75.75      24.25 |    100.00 
------------------+----------------------+----------
  White + African |     2,450        699 |     3,149 
                  |     77.80      22.20 |    100.00 
------------------+----------------------+----------
    White + Asian |     2,313        784 |     3,097 
                  |     74.69      25.31 |    100.00 
------------------+----------------------+----------
      Other mixed |     2,394        726 |     3,120 
                  |     76.73      23.27 |    100.00 
------------------+----------------------+----------
           Indian |     2,360        763 |     3,123 
                  |     75.57      24.43 |    100.00 
------------------+----------------------+----------
        Pakistani |     2,388        796 |     3,184 
                  |     75.00      25.00 |    100.00 
------------------+----------------------+----------
      Bangladeshi |     2,385        761 |     3,146 
                  |     75.81      24.19 |    100.00 
------------------+----------------------+----------
      Other Asian |     2,402        746 |     3,148 
                  |     76.30      23.70 |    100.00 
------------------+----------------------+----------
        Caribbean |     2,398        730 |     3,128 
                  |     76.66      23.34 |    100.00 
------------------+----------------------+----------
          African |     2,385        814 |     3,199 
                  |     74.55      25.45 |    100.00 
------------------+----------------------+----------
      Other Black |     2,378        731 |     3,109 
                  |     76.49      23.51 |    100.00 
------------------+----------------------+----------
          Chinese |     2,347        753 |     3,100 
                  |     75.71      24.29 |    100.00 
------------------+----------------------+----------
            Other |     2,375        817 |     3,192 
                  |     74.40      25.60 |    100.00 
------------------+----------------------+----------
          Unknown |    12,737      3,959 |    16,696 
                  |     76.29      23.71 |    100.00 
------------------+----------------------+----------
            Total |    50,871     16,100 |    66,971 
                  |     75.96      24.04 |    100.00 

. 
. foreach i of global outcomes {
  2.         di "`i'"
  3.         
. * Open Stata dataset
. use ./output/analysis_dataset_STSET_`i'.dta, clear
  4. drop if carehome==1
  5. 
. 
. /* Main Model================================================================
> =*/
. 
. /* Univariable model */ 
. 
. stcox i.ethnicity_16, strata(stp) nolog
  6. estimates save ./output/crude_`i'_eth16, replace 
  7. eststo model1
  8. parmest, label eform format(estimate p lb ub) saving(./output/crude_`i'_et
> h16, replace) idstr(crude_`i'_eth16) 
  9. local hr "`hr' ./output/crude_`i'_eth16 "
 10. 
. 
. /* Multivariable models */ 
. *Age and gender
. stcox i.ethnicity_16 i.male age1 age2 age3, strata(stp) nolog
 11. estimates save ./output/model0_`i'_eth16, replace 
 12. eststo model2
 13. 
. parmest, label eform format(estimate p lb ub) saving(./output/model0_`i'_eth1
> 6, replace) idstr(model0_`i'_eth16)
 14. local hr "`hr' ./output/model0_`i'_eth16 "
 15.  
. 
. * Age, Gender, IMD
. 
. stcox i.ethnicity_16 i.male age1 age2 age3 i.imd, strata(stp) nolog
 16. if _rc==0{
 17. estimates
 18. estimates save ./output/model1_`i'_eth16, replace 
 19. eststo model3
 20. 
. parmest, label eform format(estimate p lb ub) saving(./output/model1_`i'_eth1
> 6, replace) idstr(model1_`i'_eth16) 
 21. local hr "`hr' ./output/model1_`i'_eth16 "
 22. }
 23. else di "WARNING MODEL1 DID NOT FIT (OUTCOME `i')"
 24. 
. * Age, Gender, IMD and Comorbidities 
. stcox i.ethnicity_16 i.male age1 age2 age3      i.imd                        
>                    ///
>                                                                              
>    i.bmicat_sa     i.hba1ccat                      ///
>                                                                              
>    gp_consult_count                        ///
>                                                                              
>    i.smoke_nomiss                          ///
>                                                                              
>    i.hypertension i.bp_cat         ///     
>                                                                              
>    i.asthma                                        ///
>                                                                              
>    i.chronic_respiratory_disease ///
>                                                                              
>    i.chronic_cardiac_disease       ///
>                                                                              
>    i.dm_type                                       ///     
>                                                                              
>    i.cancer                    ///
>                                                                              
>    i.chronic_liver_disease         ///
>                                                                              
>    i.stroke                                        ///
>                                                                              
>    i.dementia                                      ///
>                                                                              
>    i.other_neuro                           ///
>                                                                              
>    i.egfr60                                        ///
>                                                                              
>    i.esrf                                          ///
>                                                                              
>    i.immunosuppressed                      ///
>                                                                              
>    i.ra_sle_psoriasis, strata(stp) nolog           
 25. if _rc==0{
 26. estimates
 27. estimates save ./output/model2_`i'_eth16, replace 
 28. eststo model4
 29. 
. parmest, label eform format(estimate p lb ub) saving(./output/model2_`i'_eth1
> 6, replace) idstr(model2_`i'_eth16) 
 30. local hr "`hr' ./output/model2_`i'_eth16 "
 31. }
 32. else di "WARNING MODEL2 DID NOT FIT (OUTCOME `i')"
 33. 
.                                                                              
>    
. * Age, Gender, IMD and Comorbidities  and household size 
. stcox i.ethnicity_16 i.male age1 age2 age3      i.imd                        
>                    ///
>                                                                              
>    i.bmicat_sa     i.hba1ccat                      ///
>                                                                              
>    gp_consult_count                        ///
>                                                                              
>    i.smoke_nomiss                          ///
>                                                                              
>    i.hypertension i.bp_cat         ///     
>                                                                              
>    i.asthma                                        ///
>                                                                              
>    i.chronic_respiratory_disease ///
>                                                                              
>    i.chronic_cardiac_disease       ///
>                                                                              
>    i.dm_type                                       ///     
>                                                                              
>    i.cancer                    ///
>                                                                              
>    i.chronic_liver_disease         ///
>                                                                              
>    i.stroke                                        ///
>                                                                              
>    i.dementia                                      ///
>                                                                              
>    i.other_neuro                           ///
>                                                                              
>    i.egfr60                                        ///
>                                                                              
>    i.esrf                                          ///
>                                                                              
>    i.immunosuppressed                      ///
>                                                                              
>    i.ra_sle_psoriasis                      ///
>                                                                              
>    i.hh_total_cat, strata(stp) nolog               
 34. estimates save ./output/model3_`i'_eth16, replace
 35. eststo model5
 36. 
. parmest, label eform format(estimate p lb ub) saving(./output/model3_`i'_eth1
> 6, replace) idstr(model3_`i'_eth16) 
 37. local hr "`hr' ./output/model3_`i'_eth16 "
 38. 
. 
. 
. /* Estout================================================================*/ 
. esttab model1 model2 model3 model4 model5 using ./output/estout_table2_eth16.
> txt, b(a2) ci(2) label wide compress eform ///
>         title ("`i'") ///
>         varlabels(`e(labels)') ///
>         stats(N_sub) ///
>         append 
 39. eststo clear
 40. 
.                                                                              
>    
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. 
. * Column headings 
. file write tablecontent ("`i'") _n
 41. 
. * eth16 labelled columns
. 
. local lab1: label ethnicity_16 1
 42. local lab2: label ethnicity_16 2
 43. local lab3: label ethnicity_16 3
 44. local lab4: label ethnicity_16 4
 45. local lab5: label ethnicity_16 5
 46. local lab6: label ethnicity_16 6
 47. local lab7: label ethnicity_16 7
 48. local lab8: label ethnicity_16 8
 49. local lab9: label ethnicity_16 9
 50. local lab10: label ethnicity_16 10
 51. local lab11: label ethnicity_16 11
 52. local lab12: label ethnicity_16 12
 53. local lab13: label ethnicity_16 13
 54. local lab14: label ethnicity_16 14
 55. local lab15: label ethnicity_16 15
 56. local lab16: label ethnicity_16 16
 57. local lab17: label ethnicity_16 17
 58. 
. /* counts */
.  
. * First row, eth16 = 1 (White British) reference cat
.         qui safecount if ethnicity_16==1
 59.         local denominator = r(N)
 60.         qui safecount if ethnicity_16 == 1 & `i' == 1
 61.         local event = r(N)
 62.     bysort eth16: egen total_follow_up = total(_t)
 63.         qui su total_follow_up if ethnicity_16 == 1
 64.         local person_week = r(mean)/7
 65.         local rate = 1000*(`event'/`person_week')
 66.         
.         file write tablecontent  ("`lab1'") _tab (`denominator') _tab (`event
> ') _tab %10.0f (`person_week') _tab %3.2f (`rate') _tab
 67.         file write tablecontent ("1.00") _tab _tab ("1.00") _tab _tab ("1.
> 00")  _tab _tab ("1.00") _tab _tab ("1.00") _n
 68.         
. * Subsequent ethnic groups
. forvalues eth=2/17 {
 69.         qui safecount if ethnicity_16==`eth'
 70.         local denominator = r(N)
 71.         qui safecount if ethnicity_16 == `eth' & `i' == 1
 72.         local event = r(N)
 73.         qui su total_follow_up if ethnicity_16 == `eth'
 74.         local person_week = r(mean)/7
 75.         local rate = 1000*(`event'/`person_week')
 76.         file write tablecontent  ("`lab`eth''") _tab (`denominator') _tab 
> (`event') _tab %10.0f (`person_week') _tab %3.2f (`rate') _tab  
 77.         cap estimates use ./output/crude_`i'_eth16 
 78.          cap lincom `eth'.ethnicity_16, eform
 79.         file write tablecontent  %4.2f (r(estimate)) _tab ("(") %4.2f (r(l
> b)) (" - ") %4.2f (r(ub)) (")") _tab 
 80.         cap estimates clear
 81.         cap estimates use ./output/model0_`i'_eth16 
 82.          cap lincom `eth'.ethnicity_16, eform
 83.         file write tablecontent  %4.2f (r(estimate)) _tab ("(") %4.2f (r(l
> b)) (" - ") %4.2f (r(ub)) (")") _tab 
 84.         cap estimates clear
 85.         cap estimates use ./output/model1_`i'_eth16 
 86.          cap lincom `eth'.ethnicity_16, eform
 87.         file write tablecontent  %4.2f (r(estimate)) _tab ("(") %4.2f (r(l
> b)) (" - ") %4.2f (r(ub)) (")") _tab 
 88.         cap estimates clear
 89.         cap estimates use ./output/model2_`i'_eth16 
 90.          cap lincom `eth'.ethnicity_16, eform
 91.         file write tablecontent  %4.2f (r(estimate)) _tab ("(") %4.2f (r(l
> b)) (" - ") %4.2f (r(ub)) (")") _tab 
 92.         cap estimates clear
 93.         cap estimates use ./output/model3_`i'_eth16 
 94.          cap lincom `eth'.ethnicity_16, eform
 95.         file write tablecontent  %4.2f (r(estimate)) _tab ("(") %4.2f (r(l
> b)) (" - ") %4.2f (r(ub)) (")") _n
 96. }  //end ethnic group
 97. 
. 
. } //end outcomes
tested
(11,780 observations deleted)

         failure _d:  tested
   analysis time _t:  (stime_tested-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,971                  Number of obs    =      66,971
No. of failures =       45,369
Time at risk    =      4479565
                                                LR chi2(16)      =       33.99
Log likelihood  =   -370380.16                  Prob > chi2      =      0.0054

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   .9716909   .0296823    -0.94   0.347     .9152219    1.031644
Other White  |    .932591   .0285467    -2.28   0.023     .8782858    .9902539
White + C..  |   .9574614   .0292905    -1.42   0.155     .9017403    1.016626
White + A..  |   .9920393   .0300316    -0.26   0.792     .9348907    1.052681
White + A..  |   1.054449    .032066     1.74   0.081     .9934368    1.119208
Other mixed  |   1.022467   .0309914     0.73   0.464     .9634945     1.08505
     Indian  |   .9837514   .0300192    -0.54   0.591     .9266397    1.044383
  Pakistani  |   .9555164   .0291741    -1.49   0.136     .9000135    1.014442
Bangladeshi  |   .9986593   .0303163    -0.04   0.965     .9409736    1.059881
Other Asian  |   1.000734    .030454     0.02   0.981     .9427908    1.062239
  Caribbean  |    1.02305   .0309914     0.75   0.452     .9640763    1.085632
    African  |   1.002299   .0303893     0.08   0.940     .9444721    1.063666
Other Black  |   .9942674   .0303034    -0.19   0.850     .9366129    1.055471
    Chinese  |   .9576324   .0293846    -1.41   0.158     .9017374    1.016992
      Other  |    .996738   .0302577    -0.11   0.914     .9391639    1.057842
    Unknown  |    .967884   .0226527    -1.39   0.163     .9244884    1.013317
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/crude_tested_eth16.ster not found)
file ./output/crude_tested_eth16.ster saved
(note: file ./output/crude_tested_eth16.dta not found)
file ./output/crude_tested_eth16.dta saved

         failure _d:  tested
   analysis time _t:  (stime_tested-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,971                  Number of obs    =      66,971
No. of failures =       45,369
Time at risk    =      4479565
                                                LR chi2(20)      =       44.65
Log likelihood  =   -370374.83                  Prob > chi2      =      0.0012

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   .9717211   .0296843    -0.94   0.348     .9152485    1.031678
Other White  |   .9329133   .0285579    -2.27   0.023     .8785867     .990599
White + C..  |   .9573929   .0292893    -1.42   0.155      .901674    1.016555
White + A..  |   .9916707    .030021    -0.28   0.782     .9345423    1.052291
White + A..  |   1.055107   .0320877     1.76   0.078      .994054     1.11991
Other mixed  |   1.022751   .0310018     0.74   0.458     .9637583    1.085355
     Indian  |    .984773   .0300539    -0.50   0.615     .9275955    1.045475
  Pakistani  |   .9555205   .0291785    -1.49   0.136     .9000094    1.014455
Bangladeshi  |   .9990132   .0303276    -0.03   0.974     .9413059    1.060258
Other Asian  |   1.001536   .0304816     0.05   0.960     .9435397    1.063096
  Caribbean  |    1.02278   .0309838     0.74   0.457     .9638201    1.085346
    African  |   1.003202   .0304186     0.11   0.916     .9453194    1.064628
Other Black  |   .9945496   .0303125    -0.18   0.858     .9368778    1.055771
    Chinese  |   .9580348   .0293975    -1.40   0.162     .9021152    1.017421
      Other  |   .9970259   .0302677    -0.10   0.922     .9394328     1.05815
    Unknown  |   .9681854   .0226609    -1.38   0.167     .9247742    1.013635
             |
        male |
       Male  |   1.006141   .0094513     0.65   0.515     .9877858    1.024836
        age1 |   1.002671   .0012905     2.07   0.038     1.000144    1.005203
        age2 |   .9870168   .0046227    -2.79   0.005     .9779979     .996119
        age3 |   1.037745   .0129011     2.98   0.003     1.012764    1.063341
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model0_tested_eth16.ster not found)
file ./output/model0_tested_eth16.ster saved
(note: file ./output/model0_tested_eth16.dta not found)
file ./output/model0_tested_eth16.dta saved

         failure _d:  tested
   analysis time _t:  (stime_tested-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,971                  Number of obs    =      66,971
No. of failures =       45,369
Time at risk    =      4479565
                                                LR chi2(22)      =       47.49
Log likelihood  =   -370373.41                  Prob > chi2      =      0.0013

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   .9719353   .0296912    -0.93   0.351     .9154495    1.031906
Other White  |   .9329954   .0285607    -2.27   0.023     .8786636    .9906867
White + C..  |   .9576941   .0292991    -1.41   0.158     .9019567    1.016876
White + A..  |   .9917336   .0300233    -0.27   0.784     .9346008    1.052359
White + A..  |   1.055715   .0321083     1.78   0.075     .9946227     1.12056
Other mixed  |   1.022964   .0310085     0.75   0.454     .9639582    1.085581
     Indian  |   .9847613   .0300536    -0.50   0.615     .9275843    1.045463
  Pakistani  |   .9557567   .0291861    -1.48   0.138     .9002311    1.014707
Bangladeshi  |   .9990742     .03033    -0.03   0.976     .9413625    1.060324
Other Asian  |   1.001467   .0304796     0.05   0.962     .9434745    1.063023
  Caribbean  |   1.023148   .0309959     0.76   0.450     .9641652    1.085738
    African  |    1.00342   .0304255     0.11   0.910     .9455244     1.06486
Other Black  |   .9947203   .0303182    -0.17   0.862     .9370377    1.055954
    Chinese  |   .9579253   .0293945    -1.40   0.161     .9020114    1.017305
      Other  |   .9971725   .0302723    -0.09   0.926     .9395707    1.058306
    Unknown  |   .9683577   .0226656    -1.37   0.170     .9249376    1.013816
             |
        male |
       Male  |   1.006177   .0094517     0.66   0.512     .9878218    1.024874
        age1 |   1.002693   .0012906     2.09   0.037     1.000167    1.005226
        age2 |   .9869315   .0046226    -2.81   0.005     .9779129    .9960333
        age3 |   1.037973   .0129045     3.00   0.003     1.012986    1.063576
             |
         imd |
          4  |   .9963215   .0118377    -0.31   0.756     .9733881    1.019795
5 most de..  |   .9736522   .0154742    -1.68   0.093     .9437909    1.004458
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,971                  Number of obs    =      66,971
No. of failures =       45,369
Time at risk    =      4479565
                                                LR chi2(22)      =       47.49
Log likelihood  =   -370373.41                  Prob > chi2      =      0.0013

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   .9719353   .0296912    -0.93   0.351     .9154495    1.031906
Other White  |   .9329954   .0285607    -2.27   0.023     .8786636    .9906867
White + C..  |   .9576941   .0292991    -1.41   0.158     .9019567    1.016876
White + A..  |   .9917336   .0300233    -0.27   0.784     .9346008    1.052359
White + A..  |   1.055715   .0321083     1.78   0.075     .9946227     1.12056
Other mixed  |   1.022964   .0310085     0.75   0.454     .9639582    1.085581
     Indian  |   .9847613   .0300536    -0.50   0.615     .9275843    1.045463
  Pakistani  |   .9557567   .0291861    -1.48   0.138     .9002311    1.014707
Bangladeshi  |   .9990742     .03033    -0.03   0.976     .9413625    1.060324
Other Asian  |   1.001467   .0304796     0.05   0.962     .9434745    1.063023
  Caribbean  |   1.023148   .0309959     0.76   0.450     .9641652    1.085738
    African  |    1.00342   .0304255     0.11   0.910     .9455244     1.06486
Other Black  |   .9947203   .0303182    -0.17   0.862     .9370377    1.055954
    Chinese  |   .9579253   .0293945    -1.40   0.161     .9020114    1.017305
      Other  |   .9971725   .0302723    -0.09   0.926     .9395707    1.058306
    Unknown  |   .9683577   .0226656    -1.37   0.170     .9249376    1.013816
             |
        male |
       Male  |   1.006177   .0094517     0.66   0.512     .9878218    1.024874
        age1 |   1.002693   .0012906     2.09   0.037     1.000167    1.005226
        age2 |   .9869315   .0046226    -2.81   0.005     .9779129    .9960333
        age3 |   1.037973   .0129045     3.00   0.003     1.012986    1.063576
             |
         imd |
          4  |   .9963215   .0118377    -0.31   0.756     .9733881    1.019795
5 most de..  |   .9736522   .0154742    -1.68   0.093     .9437909    1.004458
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model1_tested_eth16.ster not found)
file ./output/model1_tested_eth16.ster saved
(note: file ./output/model1_tested_eth16.dta not found)
file ./output/model1_tested_eth16.dta saved

         failure _d:  tested
   analysis time _t:  (stime_tested-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,971                  Number of obs    =      66,971
No. of failures =       45,369
Time at risk    =      4479565
                                                LR chi2(55)      =       72.71
Log likelihood  =    -370360.8                  Prob > chi2      =      0.0551

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |    .972462   .0297198    -0.91   0.361     .9159226    1.032492
Other White  |   .9336538   .0285911    -2.24   0.025     .8792649    .9914071
White + C..  |   .9574321   .0293009    -1.42   0.155     .9016918    1.016618
White + A..  |   .9918487   .0300399    -0.27   0.787     .9346851    1.052508
White + A..  |   1.054936   .0320999     1.76   0.079     .9938606    1.119765
Other mixed  |   1.023112   .0310304     0.75   0.451     .9640656    1.085774
     Indian  |   .9853673   .0300847    -0.48   0.629     .9281319    1.046132
  Pakistani  |   .9561588   .0292087    -1.47   0.142      .900591    1.015155
Bangladeshi  |   .9993663   .0303538    -0.02   0.983       .94161    1.060665
Other Asian  |   1.001663   .0304971     0.05   0.956     .9436386    1.063256
  Caribbean  |   1.023527   .0310176     0.77   0.443     .9645033    1.086162
    African  |   1.003887   .0304525     0.13   0.898      .945941    1.065383
Other Black  |   .9940764   .0303168    -0.19   0.846     .9363976    1.055308
    Chinese  |   .9581494   .0294123    -1.39   0.164     .9022022    1.017566
      Other  |    .997358   .0302915    -0.09   0.931     .9397202    1.058531
    Unknown  |   .9684648   .0226767    -1.37   0.171     .9250237    1.013946
             |
        male |
       Male  |   1.007682   .0095186     0.81   0.418     .9891971    1.026512
        age1 |   1.002622   .0013333     1.97   0.049     1.000012    1.005239
        age2 |   .9871223   .0047144    -2.71   0.007     .9779254    .9964056
        age3 |   1.037226   .0130959     2.89   0.004     1.011873    1.063214
             |
         imd |
          4  |   .9963326   .0118414    -0.31   0.757      .973392    1.019814
5 most de..  |   .9729928   .0154704    -1.72   0.085      .943139    1.003792
             |
   bmicat_sa |
Normal (..)  |     1.0172   .0357041     0.49   0.627     .9495746    1.089642
Overweig..)  |   1.041478   .0353687     1.20   0.231     .9744135    1.113159
Obese I ..)  |   1.032234   .0344686     0.95   0.342     .9668404    1.102051
Obese II..)  |   1.033694   .0344451     0.99   0.320     .9683402    1.103458
Obese II..)  |   1.031172   .0338524     0.94   0.350     .9669118    1.099702
    Unknown  |   1.028851   .0340624     0.86   0.390       .96421    1.097826
             |
    hba1ccat |
  >=6.5-7.4  |   1.000498   .0125486     0.04   0.968     .9762034    1.025398
  >=7.5-7.9  |   .9789541   .0194637    -1.07   0.285     .9415398    1.017855
    >=8-8.9  |   1.018673   .0182237     1.03   0.301     .9835738    1.055024
        >=9  |   .9879278   .0237345    -0.51   0.613     .9424873    1.035559
    Unknown  |   1.015587   .0764032     0.21   0.837      .876356    1.176937
             |
gp_consult~t |   .9998772   .0020393    -0.06   0.952     .9958881    1.003882
             |
smoke_nomiss |
     Former  |   .9926326   .0336747    -0.22   0.827     .9287778    1.060878
    Current  |   .9871608   .0142564    -0.89   0.371     .9596105    1.015502
             |
1.hyperten~n |   .9946626   .0116891    -0.46   0.649     .9720142    1.017839
             |
      bp_cat |
High, sta..  |   .8259507   .4937712    -0.32   0.749     .2559101    2.665759
High, sta..  |   .8624773   .4985381    -0.26   0.798     .2777968    2.677738
    Unknown  |   .8453533   .4887861    -0.29   0.771     .2721891    2.625462
             |
    1.asthma |   1.068416   .0252563     2.80   0.005     1.020044    1.119082
1.~y_disease |   1.002197   .0117788     0.19   0.852      .979375    1.025551
1.~c_disease |   .9882957   .0116049    -1.00   0.316     .9658101    1.011305
             |
     dm_type |
       T1DM  |   .9673153   .0273699    -1.17   0.240     .9151316    1.022475
       T2DM  |   .9972695   .0117646    -0.23   0.817     .9744757    1.020596
 UNKNOWN_DM  |   .9905411   .0332157    -0.28   0.777     .9275328     1.05783
             |
    1.cancer |   1.005832   .0118125     0.50   0.620     .9829446    1.029253
1.~r_disease |   1.000637   .0117973     0.05   0.957     .9777795    1.024028
    1.stroke |   .9914909    .011658    -0.73   0.467     .9689029    1.014605
  1.dementia |   1.003758    .011815     0.32   0.750     .9808662    1.027184
1.other_ne~o |   .9921645   .0116736    -0.67   0.504     .9695466     1.01531
             |
      egfr60 |
   eGFR <60  |   1.082126   .0499786     1.71   0.087     .9884728    1.184653
      1.esrf |   .9869573   .0116118    -1.12   0.264      .964459     1.00998
1.immunosu~d |   .9933048   .0097372    -0.69   0.493     .9744023    1.012574
1.ra_sle_p~s |   1.013984   .0119219     1.18   0.238     .9908848    1.037622
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,971                  Number of obs    =      66,971
No. of failures =       45,369
Time at risk    =      4479565
                                                LR chi2(55)      =       72.71
Log likelihood  =    -370360.8                  Prob > chi2      =      0.0551

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |    .972462   .0297198    -0.91   0.361     .9159226    1.032492
Other White  |   .9336538   .0285911    -2.24   0.025     .8792649    .9914071
White + C..  |   .9574321   .0293009    -1.42   0.155     .9016918    1.016618
White + A..  |   .9918487   .0300399    -0.27   0.787     .9346851    1.052508
White + A..  |   1.054936   .0320999     1.76   0.079     .9938606    1.119765
Other mixed  |   1.023112   .0310304     0.75   0.451     .9640656    1.085774
     Indian  |   .9853673   .0300847    -0.48   0.629     .9281319    1.046132
  Pakistani  |   .9561588   .0292087    -1.47   0.142      .900591    1.015155
Bangladeshi  |   .9993663   .0303538    -0.02   0.983       .94161    1.060665
Other Asian  |   1.001663   .0304971     0.05   0.956     .9436386    1.063256
  Caribbean  |   1.023527   .0310176     0.77   0.443     .9645033    1.086162
    African  |   1.003887   .0304525     0.13   0.898      .945941    1.065383
Other Black  |   .9940764   .0303168    -0.19   0.846     .9363976    1.055308
    Chinese  |   .9581494   .0294123    -1.39   0.164     .9022022    1.017566
      Other  |    .997358   .0302915    -0.09   0.931     .9397202    1.058531
    Unknown  |   .9684648   .0226767    -1.37   0.171     .9250237    1.013946
             |
        male |
       Male  |   1.007682   .0095186     0.81   0.418     .9891971    1.026512
        age1 |   1.002622   .0013333     1.97   0.049     1.000012    1.005239
        age2 |   .9871223   .0047144    -2.71   0.007     .9779254    .9964056
        age3 |   1.037226   .0130959     2.89   0.004     1.011873    1.063214
             |
         imd |
          4  |   .9963326   .0118414    -0.31   0.757      .973392    1.019814
5 most de..  |   .9729928   .0154704    -1.72   0.085      .943139    1.003792
             |
   bmicat_sa |
Normal (..)  |     1.0172   .0357041     0.49   0.627     .9495746    1.089642
Overweig..)  |   1.041478   .0353687     1.20   0.231     .9744135    1.113159
Obese I ..)  |   1.032234   .0344686     0.95   0.342     .9668404    1.102051
Obese II..)  |   1.033694   .0344451     0.99   0.320     .9683402    1.103458
Obese II..)  |   1.031172   .0338524     0.94   0.350     .9669118    1.099702
    Unknown  |   1.028851   .0340624     0.86   0.390       .96421    1.097826
             |
    hba1ccat |
  >=6.5-7.4  |   1.000498   .0125486     0.04   0.968     .9762034    1.025398
  >=7.5-7.9  |   .9789541   .0194637    -1.07   0.285     .9415398    1.017855
    >=8-8.9  |   1.018673   .0182237     1.03   0.301     .9835738    1.055024
        >=9  |   .9879278   .0237345    -0.51   0.613     .9424873    1.035559
    Unknown  |   1.015587   .0764032     0.21   0.837      .876356    1.176937
             |
gp_consult~t |   .9998772   .0020393    -0.06   0.952     .9958881    1.003882
             |
smoke_nomiss |
     Former  |   .9926326   .0336747    -0.22   0.827     .9287778    1.060878
    Current  |   .9871608   .0142564    -0.89   0.371     .9596105    1.015502
             |
1.hyperten~n |   .9946626   .0116891    -0.46   0.649     .9720142    1.017839
             |
      bp_cat |
High, sta..  |   .8259507   .4937712    -0.32   0.749     .2559101    2.665759
High, sta..  |   .8624773   .4985381    -0.26   0.798     .2777968    2.677738
    Unknown  |   .8453533   .4887861    -0.29   0.771     .2721891    2.625462
             |
    1.asthma |   1.068416   .0252563     2.80   0.005     1.020044    1.119082
1.~y_disease |   1.002197   .0117788     0.19   0.852      .979375    1.025551
1.~c_disease |   .9882957   .0116049    -1.00   0.316     .9658101    1.011305
             |
     dm_type |
       T1DM  |   .9673153   .0273699    -1.17   0.240     .9151316    1.022475
       T2DM  |   .9972695   .0117646    -0.23   0.817     .9744757    1.020596
 UNKNOWN_DM  |   .9905411   .0332157    -0.28   0.777     .9275328     1.05783
             |
    1.cancer |   1.005832   .0118125     0.50   0.620     .9829446    1.029253
1.~r_disease |   1.000637   .0117973     0.05   0.957     .9777795    1.024028
    1.stroke |   .9914909    .011658    -0.73   0.467     .9689029    1.014605
  1.dementia |   1.003758    .011815     0.32   0.750     .9808662    1.027184
1.other_ne~o |   .9921645   .0116736    -0.67   0.504     .9695466     1.01531
             |
      egfr60 |
   eGFR <60  |   1.082126   .0499786     1.71   0.087     .9884728    1.184653
      1.esrf |   .9869573   .0116118    -1.12   0.264      .964459     1.00998
1.immunosu~d |   .9933048   .0097372    -0.69   0.493     .9744023    1.012574
1.ra_sle_p~s |   1.013984   .0119219     1.18   0.238     .9908848    1.037622
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model2_tested_eth16.ster not found)
file ./output/model2_tested_eth16.ster saved
(note: file ./output/model2_tested_eth16.dta not found)
file ./output/model2_tested_eth16.dta saved

         failure _d:  tested
   analysis time _t:  (stime_tested-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,971                  Number of obs    =      66,971
No. of failures =       45,369
Time at risk    =      4479565
                                                LR chi2(57)      =       73.64
Log likelihood  =   -370360.33                  Prob > chi2      =      0.0681

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |    .972579   .0297236    -0.91   0.363     .9160322    1.032616
Other White  |    .933708   .0285928    -2.24   0.025     .8793158    .9914647
White + C..  |   .9574505   .0293014    -1.42   0.155     .9017092    1.016638
White + A..  |   .9918468   .0300398    -0.27   0.787     .9346833    1.052506
White + A..  |   1.054939   .0321001     1.76   0.079     .9938631    1.119768
Other mixed  |    1.02313    .031031     0.75   0.451     .9640824    1.085793
     Indian  |   .9855282   .0300902    -0.48   0.633     .9282823    1.046304
  Pakistani  |   .9560959    .029207    -1.47   0.142     .9005314    1.015089
Bangladeshi  |   .9992857   .0303517    -0.02   0.981     .9415336     1.06058
Other Asian  |   1.001681   .0304977     0.06   0.956      .943655    1.063275
  Caribbean  |   1.023529   .0310178     0.77   0.443     .9645056    1.086165
    African  |   1.004061   .0304584     0.13   0.894      .946104    1.065569
Other Black  |   .9941799   .0303206    -0.19   0.848     .9364939    1.055419
    Chinese  |   .9581514   .0294126    -1.39   0.164     .9022037    1.017569
      Other  |   .9974976   .0302962    -0.08   0.934      .939851     1.05868
    Unknown  |   .9684812   .0226773    -1.37   0.171     .9250391    1.013963
             |
        male |
       Male  |   1.007698   .0095188     0.81   0.417     .9892134    1.026529
        age1 |    1.00262   .0013333     1.97   0.049      1.00001    1.005237
        age2 |   .9871337   .0047144    -2.71   0.007     .9779368    .9964171
        age3 |   1.037198   .0130954     2.89   0.004     1.011847    1.063185
             |
         imd |
          4  |   .9963118   .0118413    -0.31   0.756     .9733716    1.019793
5 most de..  |   .9730121   .0154707    -1.72   0.085     .9431577    1.003812
             |
   bmicat_sa |
Normal (..)  |   1.017098   .0357027     0.48   0.629     .9494745    1.089537
Overweig..)  |   1.041272   .0353642     1.19   0.234     .9742161    1.112944
Obese I ..)  |   1.032092   .0344655     0.95   0.344     .9667038    1.101903
Obese II..)  |   1.033548   .0344421     0.99   0.322     .9682004    1.103307
Obese II..)  |   1.031008   .0338493     0.93   0.352     .9667538    1.099532
    Unknown  |   1.028708   .0340592     0.85   0.393     .9640735    1.097677
             |
    hba1ccat |
  >=6.5-7.4  |   1.000528   .0125492     0.04   0.966     .9762324    1.025429
  >=7.5-7.9  |   .9790525    .019466    -1.06   0.287     .9416337    1.017958
    >=8-8.9  |   1.018621   .0182231     1.03   0.302     .9835232    1.054971
        >=9  |   .9878814   .0237337    -0.51   0.612     .9424425    1.035511
    Unknown  |   1.015664   .0764095     0.21   0.836     .8764222    1.177029
             |
gp_consult~t |   .9998697   .0020393    -0.06   0.949     .9958807    1.003875
             |
smoke_nomiss |
     Former  |   .9925492   .0336723    -0.22   0.826     .9286989    1.060789
    Current  |   .9871162   .0142558    -0.90   0.369      .959567    1.015456
             |
1.hyperten~n |   .9947209     .01169    -0.45   0.652     .9720708    1.017899
             |
      bp_cat |
High, sta..  |   .8251512   .4932944    -0.32   0.748     .2556617    2.663186
High, sta..  |   .8620206   .4982747    -0.26   0.797     .2776494    2.676323
    Unknown  |   .8448702   .4885073    -0.29   0.771     .2720332    2.623965
             |
    1.asthma |   1.068678   .0252645     2.81   0.005      1.02029     1.11936
1.~y_disease |   1.002222   .0117791     0.19   0.850     .9793996    1.025577
1.~c_disease |   .9883802   .0116066    -1.00   0.320     .9658916    1.011392
             |
     dm_type |
       T1DM  |   .9673247   .0273724    -1.17   0.240     .9151363    1.022489
       T2DM  |     .99722   .0117642    -0.24   0.813     .9744271    1.020546
 UNKNOWN_DM  |    .990555   .0332162    -0.28   0.777     .9275457    1.057845
             |
    1.cancer |   1.005826   .0118125     0.49   0.621     .9829385    1.029247
1.~r_disease |   1.000629   .0117972     0.05   0.957     .9777717     1.02402
    1.stroke |   .9914849   .0116581    -0.73   0.467     .9688968      1.0146
  1.dementia |   1.003768   .0118153     0.32   0.749     .9808758    1.027195
1.other_ne~o |   .9921415   .0116733    -0.67   0.503      .969524    1.015287
             |
      egfr60 |
   eGFR <60  |   1.082235   .0499845     1.71   0.087     .9885703    1.184773
      1.esrf |   .9869458   .0116117    -1.12   0.264     .9644477    1.009969
1.immunosu~d |   .9933929   .0097385    -0.68   0.499     .9744879    1.012665
1.ra_sle_p~s |   1.014088   .0119236     1.19   0.234      .990985    1.037729
             |
hh_total_cat |
       6-10  |   .9747399   .0305787    -0.82   0.415      .916612    1.036554
        11+  |   .9112968   .1230232    -0.69   0.491     .6994382    1.187327
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model3_tested_eth16.ster not found)
file ./output/model3_tested_eth16.ster saved
(note: file ./output/model3_tested_eth16.dta not found)
file ./output/model3_tested_eth16.dta saved
(note: file ./output/estout_table2_eth16.txt not found)
(output written to ./output/estout_table2_eth16.txt)
positivetest
(11,780 observations deleted)

         failure _d:  positivetest
   analysis time _t:  (stime_positivetest-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,971                  Number of obs    =      66,971
No. of failures =       45,320
Time at risk    =      4474285
                                                LR chi2(16)      =       13.09
Log likelihood  =   -369950.86                  Prob > chi2      =      0.6662

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   .9904633   .0301555    -0.31   0.753     .9330886    1.051366
Other White  |   .9559576   .0292326    -1.47   0.141     .9003459    1.015004
White + C..  |   .9987538   .0304983    -0.04   0.967     .9407318    1.060355
White + A..  |   .9664643   .0294243    -1.12   0.263     .9104807     1.02589
White + A..  |   .9937019   .0304815    -0.21   0.837     .9357197    1.055277
Other mixed  |   1.019259   .0310431     0.63   0.531     .9601961    1.081955
     Indian  |   .9896029   .0302024    -0.34   0.732     .9321429    1.050605
  Pakistani  |   .9969856   .0302758    -0.10   0.921     .9393775    1.058126
Bangladeshi  |   .9752078   .0297566    -0.82   0.411     .9185956    1.035309
Other Asian  |   .9822071   .0299396    -0.59   0.556     .9252451    1.042676
  Caribbean  |   1.007945   .0306108     0.26   0.794     .9496996    1.069763
    African  |   1.021919   .0309853     0.72   0.475     .9629577    1.084489
Other Black  |   .9993191   .0304882    -0.02   0.982     .9413148    1.060898
    Chinese  |   .9747213    .029876    -0.84   0.404     .9178896    1.035072
      Other  |   .9557678   .0291813    -1.48   0.138     .9002512    1.014708
    Unknown  |   .9847149   .0230364    -0.66   0.510     .9405838    1.030917
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/crude_positivetest_eth16.ster not found)
file ./output/crude_positivetest_eth16.ster saved
(note: file ./output/crude_positivetest_eth16.dta not found)
file ./output/crude_positivetest_eth16.dta saved

         failure _d:  positivetest
   analysis time _t:  (stime_positivetest-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,971                  Number of obs    =      66,971
No. of failures =       45,320
Time at risk    =      4474285
                                                LR chi2(20)      =       17.48
Log likelihood  =   -369948.67                  Prob > chi2      =      0.6219

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   .9904335   .0301551    -0.32   0.752     .9330595    1.051336
Other White  |   .9560564    .029236    -1.47   0.142     .9004382     1.01511
White + C..  |   .9984796   .0304924    -0.05   0.960      .940469    1.060068
White + A..  |   .9660443   .0294134    -1.13   0.257     .9100815    1.025448
White + A..  |   .9936228   .0304807    -0.21   0.835     .9356422    1.055196
Other mixed  |   1.019337   .0310464     0.63   0.529     .9602675     1.08204
     Indian  |   .9894845   .0302019    -0.35   0.729     .9320257    1.050485
  Pakistani  |   .9969195   .0302779    -0.10   0.919     .9393077    1.058065
Bangladeshi  |   .9749884    .029751    -0.83   0.406     .9183869    1.035078
Other Asian  |   .9821093   .0299383    -0.59   0.554     .9251497    1.042576
  Caribbean  |   1.007669   .0306028     0.25   0.801      .949439    1.069471
    African  |   1.022028   .0309908     0.72   0.472     .9630568     1.08461
Other Black  |   .9994482   .0304926    -0.02   0.986     .9414357    1.061036
    Chinese  |   .9746116   .0298733    -0.84   0.401     .9177849    1.034957
      Other  |   .9555642   .0291762    -1.49   0.137     .9000574    1.014494
    Unknown  |   .9847188   .0230372    -0.66   0.510     .9405863    1.030922
             |
        male |
       Male  |   .9934622   .0093373    -0.70   0.485     .9753289    1.011933
        age1 |   .9996606   .0012798    -0.27   0.791     .9971553    1.002172
        age2 |    .998023   .0046575    -0.42   0.672     .9889362    1.007193
        age3 |   1.007583   .0124812     0.61   0.542     .9834144    1.032345
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model0_positivetest_eth16.ster not found)
file ./output/model0_positivetest_eth16.ster saved
(note: file ./output/model0_positivetest_eth16.dta not found)
file ./output/model0_positivetest_eth16.dta saved

         failure _d:  positivetest
   analysis time _t:  (stime_positivetest-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,971                  Number of obs    =      66,971
No. of failures =       45,320
Time at risk    =      4474285
                                                LR chi2(22)      =       22.94
Log likelihood  =   -369945.94                  Prob > chi2      =      0.4053

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   .9899137   .0301403    -0.33   0.739     .9325679    1.050786
Other White  |   .9556627   .0292245    -1.48   0.138     .9000665    1.014693
White + C..  |    .998171   .0304834    -0.06   0.952     .9401777    1.059742
White + A..  |   .9661822   .0294176    -1.13   0.259     .9102114    1.025595
White + A..  |   .9928606   .0304591    -0.23   0.815     .9349211    1.054391
Other mixed  |    1.01893   .0310351     0.62   0.538     .9598827     1.08161
     Indian  |   .9893824   .0301988    -0.35   0.727     .9319296    1.050377
  Pakistani  |   .9963003   .0302603    -0.12   0.903      .938722     1.05741
Bangladeshi  |    .974889   .0297481    -0.83   0.405     .9182931    1.034973
Other Asian  |   .9820799   .0299375    -0.59   0.553     .9251219    1.042545
  Caribbean  |   1.007331    .030593     0.24   0.810     .9491192    1.069112
    African  |   1.021561   .0309777     0.70   0.482     .9626151    1.084117
Other Black  |   .9991803   .0304847    -0.03   0.979     .9411827    1.060752
    Chinese  |   .9746011    .029873    -0.84   0.401     .9177751    1.034946
      Other  |   .9552666   .0291675    -1.50   0.134     .8997763    1.014179
    Unknown  |   .9844869   .0230321    -0.67   0.504     .9403641     1.03068
             |
        male |
       Male  |   .9934138   .0093369    -0.70   0.482     .9752813    1.011883
        age1 |   .9996205   .0012799    -0.30   0.767      .997115    1.002132
        age2 |   .9981784   .0046589    -0.39   0.696     .9890888    1.007352
        age3 |   1.007175   .0124779     0.58   0.564     .9830132    1.031931
             |
         imd |
          4  |   1.019665   .0120971     1.64   0.101     .9962288    1.043653
5 most de..  |   1.030863   .0162919     1.92   0.054     .9994208    1.063294
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,971                  Number of obs    =      66,971
No. of failures =       45,320
Time at risk    =      4474285
                                                LR chi2(22)      =       22.94
Log likelihood  =   -369945.94                  Prob > chi2      =      0.4053

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   .9899137   .0301403    -0.33   0.739     .9325679    1.050786
Other White  |   .9556627   .0292245    -1.48   0.138     .9000665    1.014693
White + C..  |    .998171   .0304834    -0.06   0.952     .9401777    1.059742
White + A..  |   .9661822   .0294176    -1.13   0.259     .9102114    1.025595
White + A..  |   .9928606   .0304591    -0.23   0.815     .9349211    1.054391
Other mixed  |    1.01893   .0310351     0.62   0.538     .9598827     1.08161
     Indian  |   .9893824   .0301988    -0.35   0.727     .9319296    1.050377
  Pakistani  |   .9963003   .0302603    -0.12   0.903      .938722     1.05741
Bangladeshi  |    .974889   .0297481    -0.83   0.405     .9182931    1.034973
Other Asian  |   .9820799   .0299375    -0.59   0.553     .9251219    1.042545
  Caribbean  |   1.007331    .030593     0.24   0.810     .9491192    1.069112
    African  |   1.021561   .0309777     0.70   0.482     .9626151    1.084117
Other Black  |   .9991803   .0304847    -0.03   0.979     .9411827    1.060752
    Chinese  |   .9746011    .029873    -0.84   0.401     .9177751    1.034946
      Other  |   .9552666   .0291675    -1.50   0.134     .8997763    1.014179
    Unknown  |   .9844869   .0230321    -0.67   0.504     .9403641     1.03068
             |
        male |
       Male  |   .9934138   .0093369    -0.70   0.482     .9752813    1.011883
        age1 |   .9996205   .0012799    -0.30   0.767      .997115    1.002132
        age2 |   .9981784   .0046589    -0.39   0.696     .9890888    1.007352
        age3 |   1.007175   .0124779     0.58   0.564     .9830132    1.031931
             |
         imd |
          4  |   1.019665   .0120971     1.64   0.101     .9962288    1.043653
5 most de..  |   1.030863   .0162919     1.92   0.054     .9994208    1.063294
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model1_positivetest_eth16.ster not found)
file ./output/model1_positivetest_eth16.ster saved
(note: file ./output/model1_positivetest_eth16.dta not found)
file ./output/model1_positivetest_eth16.dta saved

         failure _d:  positivetest
   analysis time _t:  (stime_positivetest-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,971                  Number of obs    =      66,971
No. of failures =       45,320
Time at risk    =      4474285
                                                LR chi2(55)      =       60.70
Log likelihood  =   -369927.06                  Prob > chi2      =      0.2779

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   .9900719   .0301536    -0.33   0.743     .9327013    1.050971
Other White  |   .9564122   .0292595    -1.46   0.145     .9007501    1.015514
White + C..  |   .9986362   .0305042    -0.04   0.964     .9406035    1.060249
White + A..  |   .9662105   .0294312    -1.13   0.259     .9102147    1.025651
White + A..  |   .9922804     .03045    -0.25   0.801     .9343588    1.053793
Other mixed  |   1.019569    .031065     0.64   0.525     .9604653     1.08231
     Indian  |   .9896578   .0302196    -0.34   0.734      .932166    1.050695
  Pakistani  |   .9967823   .0302825    -0.11   0.916     .9391622    1.057938
Bangladeshi  |   .9746421   .0297486    -0.84   0.400     .9180457    1.034728
Other Asian  |   .9833925   .0299851    -0.55   0.583     .9263445    1.043954
  Caribbean  |   1.007354   .0306048     0.24   0.809     .9491206     1.06916
    African  |   1.021968    .031003     0.72   0.474     .9629748    1.084576
Other Black  |   .9995862   .0305153    -0.01   0.989     .9415314    1.061221
    Chinese  |   .9760759   .0299269    -0.79   0.430     .9191479     1.03653
      Other  |   .9564546   .0292159    -1.46   0.145      .900873    1.015466
    Unknown  |   .9842906   .0230334    -0.68   0.499     .9401656    1.030487
             |
        male |
       Male  |   .9946524   .0093976    -0.57   0.570     .9764029    1.013243
        age1 |   .9994859   .0013241    -0.39   0.698     .9968941    1.002085
        age2 |   .9985174   .0047565    -0.31   0.755     .9892382    1.007884
        age3 |   1.006193   .0126693     0.49   0.624     .9816654    1.031333
             |
         imd |
          4  |   1.019866   .0121051     1.66   0.097     .9964148     1.04387
5 most de..  |   1.031121    .016301     1.94   0.053     .9996611     1.06357
             |
   bmicat_sa |
Normal (..)  |   .9657407   .0335244    -1.00   0.315     .9022196    1.033734
Overweig..)  |   .9630154   .0323593    -1.12   0.262     .9016357    1.028574
Obese I ..)  |   .9732593   .0321169    -0.82   0.411     .9123037    1.038288
Obese II..)  |   .9627581   .0317299    -1.15   0.249     .9025346       1.027
Obese II..)  |   .9722496   .0315306    -0.87   0.386      .912374    1.036055
    Unknown  |   .9637273   .0315274    -1.13   0.259     .9038741    1.027544
             |
    hba1ccat |
  >=6.5-7.4  |   1.015776   .0127298     1.25   0.212     .9911305    1.041035
  >=7.5-7.9  |   1.040191   .0204868     2.00   0.045     1.000803    1.081129
    >=8-8.9  |   .9768615   .0176406    -1.30   0.195     .9428913    1.012056
        >=9  |   .9688125   .0233871    -1.31   0.189     .9240421    1.015752
    Unknown  |    .872382   .0671404    -1.77   0.076     .7502334    1.014418
             |
gp_consult~t |   .9984175   .0020366    -0.78   0.438     .9944339    1.002417
             |
smoke_nomiss |
     Former  |   .9934841   .0337944    -0.19   0.848      .929408    1.061978
    Current  |   1.023386   .0147234     1.61   0.108     .9949313    1.052654
             |
1.hyperten~n |   .9764294   .0115144    -2.02   0.043     .9541204    .9992601
             |
      bp_cat |
High, sta..  |   .3375923   .1772043    -2.07   0.039     .1206678    .9444814
High, sta..  |   .3498968   .1751328    -2.10   0.036     .1311869    .9332316
    Unknown  |   .3547036   .1776092    -2.07   0.038     .1329374    .9464203
             |
    1.asthma |   .9791411   .0235304    -0.88   0.380     .9340916    1.026363
1.~y_disease |   1.017185   .0119334     1.45   0.146     .9940629    1.040845
1.~c_disease |   .9976045    .011708    -0.20   0.838     .9749191    1.020818
             |
     dm_type |
       T1DM  |   1.029192   .0288983     1.02   0.305     .9740823    1.087419
       T2DM  |   .9920855   .0117184    -0.67   0.501     .9693816    1.015321
 UNKNOWN_DM  |   .9947325   .0333964    -0.16   0.875     .9313839     1.06239
             |
    1.cancer |   .9949907   .0117353    -0.43   0.670     .9722538    1.018259
1.~r_disease |   .9999891    .011786    -0.00   0.999     .9771537    1.023358
    1.stroke |    1.01315   .0118638     1.12   0.265     .9901617    1.036671
  1.dementia |   .9916979   .0116854    -0.71   0.479     .9690574    1.014867
1.other_ne~o |   1.005862   .0118234     0.50   0.619     .9829538    1.029305
             |
      egfr60 |
   eGFR <60  |   1.066132   .0496914     1.37   0.169     .9730544    1.168112
      1.esrf |   .9831229   .0116085    -1.44   0.149      .960632     1.00614
1.immunosu~d |   1.005629   .0098562     0.57   0.567      .986496    1.025134
1.ra_sle_p~s |   1.001798   .0117925     0.15   0.879       .97895     1.02518
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,971                  Number of obs    =      66,971
No. of failures =       45,320
Time at risk    =      4474285
                                                LR chi2(55)      =       60.70
Log likelihood  =   -369927.06                  Prob > chi2      =      0.2779

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   .9900719   .0301536    -0.33   0.743     .9327013    1.050971
Other White  |   .9564122   .0292595    -1.46   0.145     .9007501    1.015514
White + C..  |   .9986362   .0305042    -0.04   0.964     .9406035    1.060249
White + A..  |   .9662105   .0294312    -1.13   0.259     .9102147    1.025651
White + A..  |   .9922804     .03045    -0.25   0.801     .9343588    1.053793
Other mixed  |   1.019569    .031065     0.64   0.525     .9604653     1.08231
     Indian  |   .9896578   .0302196    -0.34   0.734      .932166    1.050695
  Pakistani  |   .9967823   .0302825    -0.11   0.916     .9391622    1.057938
Bangladeshi  |   .9746421   .0297486    -0.84   0.400     .9180457    1.034728
Other Asian  |   .9833925   .0299851    -0.55   0.583     .9263445    1.043954
  Caribbean  |   1.007354   .0306048     0.24   0.809     .9491206     1.06916
    African  |   1.021968    .031003     0.72   0.474     .9629748    1.084576
Other Black  |   .9995862   .0305153    -0.01   0.989     .9415314    1.061221
    Chinese  |   .9760759   .0299269    -0.79   0.430     .9191479     1.03653
      Other  |   .9564546   .0292159    -1.46   0.145      .900873    1.015466
    Unknown  |   .9842906   .0230334    -0.68   0.499     .9401656    1.030487
             |
        male |
       Male  |   .9946524   .0093976    -0.57   0.570     .9764029    1.013243
        age1 |   .9994859   .0013241    -0.39   0.698     .9968941    1.002085
        age2 |   .9985174   .0047565    -0.31   0.755     .9892382    1.007884
        age3 |   1.006193   .0126693     0.49   0.624     .9816654    1.031333
             |
         imd |
          4  |   1.019866   .0121051     1.66   0.097     .9964148     1.04387
5 most de..  |   1.031121    .016301     1.94   0.053     .9996611     1.06357
             |
   bmicat_sa |
Normal (..)  |   .9657407   .0335244    -1.00   0.315     .9022196    1.033734
Overweig..)  |   .9630154   .0323593    -1.12   0.262     .9016357    1.028574
Obese I ..)  |   .9732593   .0321169    -0.82   0.411     .9123037    1.038288
Obese II..)  |   .9627581   .0317299    -1.15   0.249     .9025346       1.027
Obese II..)  |   .9722496   .0315306    -0.87   0.386      .912374    1.036055
    Unknown  |   .9637273   .0315274    -1.13   0.259     .9038741    1.027544
             |
    hba1ccat |
  >=6.5-7.4  |   1.015776   .0127298     1.25   0.212     .9911305    1.041035
  >=7.5-7.9  |   1.040191   .0204868     2.00   0.045     1.000803    1.081129
    >=8-8.9  |   .9768615   .0176406    -1.30   0.195     .9428913    1.012056
        >=9  |   .9688125   .0233871    -1.31   0.189     .9240421    1.015752
    Unknown  |    .872382   .0671404    -1.77   0.076     .7502334    1.014418
             |
gp_consult~t |   .9984175   .0020366    -0.78   0.438     .9944339    1.002417
             |
smoke_nomiss |
     Former  |   .9934841   .0337944    -0.19   0.848      .929408    1.061978
    Current  |   1.023386   .0147234     1.61   0.108     .9949313    1.052654
             |
1.hyperten~n |   .9764294   .0115144    -2.02   0.043     .9541204    .9992601
             |
      bp_cat |
High, sta..  |   .3375923   .1772043    -2.07   0.039     .1206678    .9444814
High, sta..  |   .3498968   .1751328    -2.10   0.036     .1311869    .9332316
    Unknown  |   .3547036   .1776092    -2.07   0.038     .1329374    .9464203
             |
    1.asthma |   .9791411   .0235304    -0.88   0.380     .9340916    1.026363
1.~y_disease |   1.017185   .0119334     1.45   0.146     .9940629    1.040845
1.~c_disease |   .9976045    .011708    -0.20   0.838     .9749191    1.020818
             |
     dm_type |
       T1DM  |   1.029192   .0288983     1.02   0.305     .9740823    1.087419
       T2DM  |   .9920855   .0117184    -0.67   0.501     .9693816    1.015321
 UNKNOWN_DM  |   .9947325   .0333964    -0.16   0.875     .9313839     1.06239
             |
    1.cancer |   .9949907   .0117353    -0.43   0.670     .9722538    1.018259
1.~r_disease |   .9999891    .011786    -0.00   0.999     .9771537    1.023358
    1.stroke |    1.01315   .0118638     1.12   0.265     .9901617    1.036671
  1.dementia |   .9916979   .0116854    -0.71   0.479     .9690574    1.014867
1.other_ne~o |   1.005862   .0118234     0.50   0.619     .9829538    1.029305
             |
      egfr60 |
   eGFR <60  |   1.066132   .0496914     1.37   0.169     .9730544    1.168112
      1.esrf |   .9831229   .0116085    -1.44   0.149      .960632     1.00614
1.immunosu~d |   1.005629   .0098562     0.57   0.567      .986496    1.025134
1.ra_sle_p~s |   1.001798   .0117925     0.15   0.879       .97895     1.02518
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model2_positivetest_eth16.ster not found)
file ./output/model2_positivetest_eth16.ster saved
(note: file ./output/model2_positivetest_eth16.dta not found)
file ./output/model2_positivetest_eth16.dta saved

         failure _d:  positivetest
   analysis time _t:  (stime_positivetest-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,971                  Number of obs    =      66,971
No. of failures =       45,320
Time at risk    =      4474285
                                                LR chi2(57)      =       62.16
Log likelihood  =   -369926.33                  Prob > chi2      =      0.2975

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   .9901206   .0301552    -0.33   0.744     .9327469    1.051023
Other White  |   .9564671   .0292613    -1.45   0.146     .9008016    1.015573
White + C..  |   .9987145    .030507    -0.04   0.966     .9406766    1.060333
White + A..  |   .9663071   .0294353    -1.13   0.261     .9103035    1.025756
White + A..  |   .9924495   .0304556    -0.25   0.805     .9345174    1.053973
Other mixed  |    1.01961   .0310664     0.64   0.524     .9605031    1.082354
     Indian  |   .9898946   .0302284    -0.33   0.739     .9323861     1.05095
  Pakistani  |    .996848   .0302846    -0.10   0.917     .9392239    1.058007
Bangladeshi  |   .9748441   .0297553    -0.83   0.404     .9182349    1.034943
Other Asian  |   .9835178   .0299892    -0.55   0.586     .9264619    1.044087
  Caribbean  |    1.00739   .0306059     0.24   0.808      .949155    1.069199
    African  |   1.022157   .0310091     0.72   0.470     .9631514    1.084777
Other Black  |   .9995279   .0305145    -0.02   0.988     .9414747    1.061161
    Chinese  |   .9758569   .0299208    -0.80   0.425     .9189405    1.036298
      Other  |   .9565408   .0292196    -1.45   0.146     .9009521    1.015559
    Unknown  |   .9842894   .0230338    -0.68   0.499     .9401636    1.030486
             |
        male |
       Male  |   .9946657   .0093977    -0.57   0.571     .9764159    1.013256
        age1 |   .9994841   .0013241    -0.39   0.697     .9968923    1.002083
        age2 |   .9985177   .0047565    -0.31   0.755     .9892385    1.007884
        age3 |   1.006192   .0126696     0.49   0.624     .9816642    1.031333
             |
         imd |
          4  |   1.019828   .0121048     1.65   0.098     .9963764    1.043831
5 most de..  |   1.031027   .0162998     1.93   0.053     .9995699    1.063474
             |
   bmicat_sa |
Normal (..)  |   .9659821   .0335336    -1.00   0.319     .9024435    1.033994
Overweig..)  |   .9634066   .0323754    -1.11   0.267     .9019965    1.028998
Obese I ..)  |     .97356   .0321286    -0.81   0.417     .9125824    1.038612
Obese II..)  |   .9631115   .0317435    -1.14   0.254     .9028623    1.027381
Obese II..)  |   .9725994    .031544    -0.86   0.392     .9126982    1.036432
    Unknown  |   .9640039   .0315377    -1.12   0.262     .9041312    1.027841
             |
    hba1ccat |
  >=6.5-7.4  |   1.015862   .0127311     1.26   0.209     .9912137    1.041124
  >=7.5-7.9  |   1.040365   .0204911     2.01   0.045     1.000969    1.081312
    >=8-8.9  |   .9767398   .0176389    -1.30   0.192      .942773     1.01193
        >=9  |   .9688508   .0233881    -1.31   0.190     .9240786    1.015792
    Unknown  |   .8725891   .0671566    -1.77   0.077      .750411     1.01466
             |
gp_consult~t |   .9984266   .0020366    -0.77   0.440      .994443    1.002426
             |
smoke_nomiss |
     Former  |   .9936588   .0338009    -0.19   0.852     .9295704    1.062166
    Current  |   1.023443   .0147246     1.61   0.107     .9949868    1.052714
             |
1.hyperten~n |    .976444   .0115147    -2.02   0.043     .9541344    .9992753
             |
      bp_cat |
High, sta..  |   .3373066   .1770551    -2.07   0.038     .1205652    .9436866
High, sta..  |   .3496647   .1750169    -2.10   0.036     .1310997    .9326139
    Unknown  |   .3544471   .1774811    -2.07   0.038      .132841    .9457375
             |
    1.asthma |    .979001   .0235278    -0.88   0.377     .9339565    1.026218
1.~y_disease |   1.017184   .0119337     1.45   0.146      .994061    1.040845
1.~c_disease |   .9974468   .0117079    -0.22   0.828     .9747617     1.02066
             |
     dm_type |
       T1DM  |   1.028877   .0288907     1.01   0.311     .9737823    1.087089
       T2DM  |    .992087   .0117188    -0.67   0.501     .9693825    1.015323
 UNKNOWN_DM  |   .9942815   .0333835    -0.17   0.864     .9309574    1.061913
             |
    1.cancer |   .9949683   .0117351    -0.43   0.669     .9722318    1.018236
1.~r_disease |    .999945   .0117859    -0.00   0.996     .9771098    1.023314
    1.stroke |    1.01315   .0118639     1.12   0.265     .9901618    1.036671
  1.dementia |   .9917342   .0116859    -0.70   0.481     .9690928    1.014905
1.other_ne~o |   1.005846   .0118233     0.50   0.620     .9829377    1.029288
             |
      egfr60 |
   eGFR <60  |   1.066296   .0496992     1.38   0.168     .9732045    1.168293
      1.esrf |   .9831404   .0116088    -1.44   0.150     .9606489    1.006159
1.immunosu~d |   1.005617   .0098563     0.57   0.568     .9864832    1.025122
1.ra_sle_p~s |    1.00181   .0117933     0.15   0.878     .9789602    1.025193
             |
hh_total_cat |
       6-10  |   .9855455   .0308794    -0.46   0.642     .9268438    1.047965
        11+  |   1.134813   .1441819     1.00   0.320     .8846593    1.455701
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model3_positivetest_eth16.ster not found)
file ./output/model3_positivetest_eth16.ster saved
(note: file ./output/model3_positivetest_eth16.dta not found)
file ./output/model3_positivetest_eth16.dta saved
(output written to ./output/estout_table2_eth16.txt)
hes
(11,780 observations deleted)

         failure _d:  hes
   analysis time _t:  (stime_hes-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,971                  Number of obs    =      66,971
No. of failures =       14,176
Time at risk    =      6224449
                                                LR chi2(16)      =       13.26
Log likelihood  =   -121374.56                  Prob > chi2      =      0.6540

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   .9504661   .0509653    -0.95   0.343     .8556458    1.055794
Other White  |   .8996185   .0488014    -1.95   0.051     .8088788    1.000537
White + C..  |   .9454702   .0508149    -1.04   0.297      .850941      1.0505
White + A..  |   .9634926   .0513155    -0.70   0.485     .8679875    1.069506
White + A..  |   .8980765   .0491034    -1.97   0.049     .8068129    .9996634
Other mixed  |   .9294038    .050129    -1.36   0.175     .8361677    1.033036
     Indian  |   .9231149   .0499332    -1.48   0.139      .830257    1.026358
  Pakistani  |    .869365   .0474317    -2.57   0.010     .7811986     .967482
Bangladeshi  |   .9938708   .0527787    -0.12   0.908     .8956278     1.10289
Other Asian  |   .9440116   .0506789    -1.07   0.283     .8497299    1.048754
  Caribbean  |   .9228601    .049775    -1.49   0.137     .8302824     1.02576
    African  |   .9387537   .0504345    -1.18   0.239     .8449302    1.042996
Other Black  |   .9484729   .0509764    -0.98   0.325     .8536433    1.053837
    Chinese  |   .9346944   .0504768    -1.25   0.211     .8408176    1.039053
      Other  |   .9667216   .0515848    -0.63   0.526     .8707247    1.073302
    Unknown  |   .9304024   .0380657    -1.76   0.078      .858708    1.008083
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/crude_hes_eth16.ster not found)
file ./output/crude_hes_eth16.ster saved
(note: file ./output/crude_hes_eth16.dta not found)
file ./output/crude_hes_eth16.dta saved

         failure _d:  hes
   analysis time _t:  (stime_hes-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,971                  Number of obs    =      66,971
No. of failures =       14,176
Time at risk    =      6224449
                                                LR chi2(20)      =       16.47
Log likelihood  =   -121372.96                  Prob > chi2      =      0.6870

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   .9506252   .0509747    -0.94   0.345     .8557875    1.055973
Other White  |   .8999062   .0488176    -1.94   0.052     .8091365    1.000859
White + C..  |   .9449129   .0507875    -1.05   0.292     .8504349    1.049887
White + A..  |   .9634324   .0513132    -0.70   0.484     .8679317    1.069441
White + A..  |   .8981629   .0491104    -1.96   0.049     .8068866    .9997646
Other mixed  |    .929585     .05014    -1.35   0.176     .8363286     1.03324
     Indian  |   .9238378   .0499764    -1.46   0.143     .8308999    1.027171
  Pakistani  |   .8692126    .047426    -2.57   0.010      .781057     .967318
Bangladeshi  |    .993733   .0527723    -0.12   0.906      .895502    1.102739
Other Asian  |   .9443089   .0506973    -1.07   0.286     .8499932     1.04909
  Caribbean  |   .9232155   .0497949    -1.48   0.139     .8306009    1.026157
    African  |   .9392017    .050461    -1.17   0.243     .8453293    1.043498
Other Black  |   .9487551   .0509925    -0.98   0.328     .8538957    1.054153
    Chinese  |   .9346768   .0504767    -1.25   0.211     .8408001    1.039035
      Other  |   .9664703   .0515721    -0.64   0.523      .870497    1.073025
    Unknown  |   .9306427   .0380766    -1.76   0.079     .8589279    1.008345
             |
        male |
       Male  |   .9806545   .0164808    -1.16   0.245     .9488789    1.013494
        age1 |   1.002893   .0023078     1.26   0.209       .99838    1.007427
        age2 |   .9890413   .0082707    -1.32   0.188     .9729632    1.005385
        age3 |   1.029816    .022848     1.32   0.185     .9859942    1.075585
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model0_hes_eth16.ster not found)
file ./output/model0_hes_eth16.ster saved
(note: file ./output/model0_hes_eth16.dta not found)
file ./output/model0_hes_eth16.dta saved

         failure _d:  hes
   analysis time _t:  (stime_hes-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,971                  Number of obs    =      66,971
No. of failures =       14,176
Time at risk    =      6224449
                                                LR chi2(22)      =       16.63
Log likelihood  =   -121372.88                  Prob > chi2      =      0.7836

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   .9504963   .0509689    -0.95   0.344     .8556696    1.055832
Other White  |   .8998535    .048815    -1.95   0.052     .8090886    1.000801
White + C..  |   .9448683   .0507853    -1.06   0.291     .8503945    1.049838
White + A..  |   .9634641   .0513151    -0.70   0.485       .86796    1.069477
White + A..  |   .8979894   .0491029    -1.97   0.049     .8067271    .9995758
Other mixed  |   .9294956   .0501358    -1.36   0.175      .836247    1.033142
     Indian  |   .9237902   .0499739    -1.47   0.143     .8308569    1.027118
  Pakistani  |      .8691   .0474208    -2.57   0.010     .7809542    .9671947
Bangladeshi  |   .9937033   .0527709    -0.12   0.905     .8954748    1.102707
Other Asian  |   .9443428   .0506992    -1.07   0.286     .8500236    1.049128
  Caribbean  |   .9231021   .0497896    -1.48   0.138     .8304974    1.026033
    African  |    .939122   .0504572    -1.17   0.242     .8452566    1.043411
Other Black  |   .9486711   .0509889    -0.98   0.327     .8538184    1.054061
    Chinese  |   .9347543   .0504813    -1.25   0.212     .8408692    1.039122
      Other  |   .9664331   .0515702    -0.64   0.522     .8704633    1.072984
    Unknown  |   .9305814   .0380745    -1.76   0.079     .8588704     1.00828
             |
        male |
       Male  |   .9806313   .0164806    -1.16   0.245     .9488561    1.013471
        age1 |   1.002883    .002308     1.25   0.211     .9983701    1.007417
        age2 |   .9890767   .0082715    -1.31   0.189     .9729971    1.005422
        age3 |   1.029722   .0228473     1.32   0.187     .9859023     1.07549
             |
         imd |
          4  |   1.002204   .0212748     0.10   0.917     .9613617    1.044781
5 most de..  |   1.011184   .0285242     0.39   0.693      .956795    1.068665
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,971                  Number of obs    =      66,971
No. of failures =       14,176
Time at risk    =      6224449
                                                LR chi2(22)      =       16.63
Log likelihood  =   -121372.88                  Prob > chi2      =      0.7836

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   .9504963   .0509689    -0.95   0.344     .8556696    1.055832
Other White  |   .8998535    .048815    -1.95   0.052     .8090886    1.000801
White + C..  |   .9448683   .0507853    -1.06   0.291     .8503945    1.049838
White + A..  |   .9634641   .0513151    -0.70   0.485       .86796    1.069477
White + A..  |   .8979894   .0491029    -1.97   0.049     .8067271    .9995758
Other mixed  |   .9294956   .0501358    -1.36   0.175      .836247    1.033142
     Indian  |   .9237902   .0499739    -1.47   0.143     .8308569    1.027118
  Pakistani  |      .8691   .0474208    -2.57   0.010     .7809542    .9671947
Bangladeshi  |   .9937033   .0527709    -0.12   0.905     .8954748    1.102707
Other Asian  |   .9443428   .0506992    -1.07   0.286     .8500236    1.049128
  Caribbean  |   .9231021   .0497896    -1.48   0.138     .8304974    1.026033
    African  |    .939122   .0504572    -1.17   0.242     .8452566    1.043411
Other Black  |   .9486711   .0509889    -0.98   0.327     .8538184    1.054061
    Chinese  |   .9347543   .0504813    -1.25   0.212     .8408692    1.039122
      Other  |   .9664331   .0515702    -0.64   0.522     .8704633    1.072984
    Unknown  |   .9305814   .0380745    -1.76   0.079     .8588704     1.00828
             |
        male |
       Male  |   .9806313   .0164806    -1.16   0.245     .9488561    1.013471
        age1 |   1.002883    .002308     1.25   0.211     .9983701    1.007417
        age2 |   .9890767   .0082715    -1.31   0.189     .9729971    1.005422
        age3 |   1.029722   .0228473     1.32   0.187     .9859023     1.07549
             |
         imd |
          4  |   1.002204   .0212748     0.10   0.917     .9613617    1.044781
5 most de..  |   1.011184   .0285242     0.39   0.693      .956795    1.068665
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model1_hes_eth16.ster not found)
file ./output/model1_hes_eth16.ster saved
(note: file ./output/model1_hes_eth16.dta not found)
file ./output/model1_hes_eth16.dta saved

         failure _d:  hes
   analysis time _t:  (stime_hes-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,971                  Number of obs    =      66,971
No. of failures =       14,176
Time at risk    =      6224449
                                                LR chi2(55)      =       44.85
Log likelihood  =   -121358.77                  Prob > chi2      =      0.8341

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   .9504212   .0509768    -0.95   0.343     .8555808    1.055775
Other White  |   .8994669   .0488081    -1.95   0.051     .8087162    1.000401
White + C..  |   .9459097   .0508513    -1.03   0.301     .8513141    1.051016
White + A..  |   .9629564   .0513034    -0.71   0.479     .8674754    1.068947
White + A..  |   .8979717   .0491178    -1.97   0.049     .8066835    .9995907
Other mixed  |   .9296617    .050162    -1.35   0.176     .8363661    1.033364
     Indian  |   .9244171   .0500217    -1.45   0.146     .8313963    1.027846
  Pakistani  |   .8687095   .0474126    -2.58   0.010     .7805801    .9667888
Bangladeshi  |   .9936116   .0527848    -0.12   0.904     .8953592    1.102646
Other Asian  |   .9452178    .050756    -1.05   0.294     .8507938    1.050121
  Caribbean  |   .9229745   .0497949    -1.49   0.137      .830361    1.025917
    African  |   .9374385   .0503845    -1.20   0.229     .8437101    1.041579
Other Black  |   .9492375   .0510402    -0.97   0.333     .8542914    1.054736
    Chinese  |   .9340935   .0504566    -1.26   0.207     .8402553    1.038411
      Other  |    .965766   .0515503    -0.65   0.514     .8698348    1.072277
    Unknown  |   .9301267   .0380647    -1.77   0.077     .8584349    1.007806
             |
        male |
       Male  |   .9798438   .0165463    -1.21   0.228     .9479445    1.012817
        age1 |   1.002614   .0023846     1.10   0.272     .9979515    1.007299
        age2 |   .9898212   .0084413    -1.20   0.230     .9734141    1.006505
        age3 |   1.028028   .0231673     1.23   0.220     .9836094    1.074453
             |
         imd |
          4  |   1.002098   .0212795     0.10   0.921     .9612468    1.044685
5 most de..  |   1.010188   .0285057     0.36   0.719     .9558351    1.067632
             |
   bmicat_sa |
Normal (..)  |   1.057239   .0659428     0.89   0.372     .9355815    1.194717
Overweig..)  |   1.001893   .0608137     0.03   0.975     .8895176    1.128466
Obese I ..)  |    1.00721   .0600615     0.12   0.904     .8961101    1.132083
Obese II..)  |   1.037163    .061628     0.61   0.539     .9231421    1.165266
Obese II..)  |    .999437   .0585911    -0.01   0.992     .8909523    1.121131
    Unknown  |   1.006073   .0594532     0.10   0.918     .8960421    1.129616
             |
    hba1ccat |
  >=6.5-7.4  |   .9837093   .0220839    -0.73   0.464      .941364    1.027959
  >=7.5-7.9  |   .9552529   .0341958    -1.28   0.201     .8905275    1.024683
    >=8-8.9  |   .9207135   .0303134    -2.51   0.012     .8631766    .9820856
        >=9  |   .9613056   .0415904    -0.91   0.362     .8831504    1.046377
    Unknown  |   .9888722   .1338055    -0.08   0.934      .758513    1.289191
             |
gp_consult~t |   1.000868   .0036434     0.24   0.812     .9937524    1.008035
             |
smoke_nomiss |
     Former  |   1.039396   .0617901     0.65   0.516     .9250785     1.16784
    Current  |   .9980566   .0258026    -0.08   0.940     .9487443    1.049932
             |
1.hyperten~n |   .9816743   .0207028    -0.88   0.380     .9419247    1.023101
             |
      bp_cat |
High, sta..  |   .5884493   .4418923    -0.71   0.480     .1350531    2.563973
High, sta..  |   .4497479   .3184815    -1.13   0.259     .1122548    1.801911
    Unknown  |   .4415212    .312858    -1.15   0.249     .1101026    1.770539
             |
    1.asthma |   1.001061   .0428579     0.02   0.980     .9204889    1.088686
1.~y_disease |   1.017986   .0212927     0.85   0.394     .9770972    1.060586
1.~c_disease |   1.042214   .0216032     1.99   0.046     1.000721    1.085427
             |
     dm_type |
       T1DM  |   .9361663   .0481577    -1.28   0.200     .8463812    1.035476
       T2DM  |    .967675   .0205749    -1.55   0.122     .9281775    1.008853
 UNKNOWN_DM  |   .9482554   .0575249    -0.88   0.381     .8419535    1.067979
             |
    1.cancer |    .983664   .0207936    -0.78   0.436      .943742    1.025275
1.~r_disease |   1.025516   .0214691     1.20   0.229     .9842888     1.06847
    1.stroke |   1.012175   .0211976     0.58   0.563      .971469    1.054586
  1.dementia |   .9930926   .0209587    -0.33   0.743     .9528522    1.035032
1.other_ne~o |   1.000586   .0210398     0.03   0.978     .9601872    1.042685
             |
      egfr60 |
   eGFR <60  |   .9566741   .0814289    -0.52   0.603     .8096785    1.130356
      1.esrf |   1.007358   .0211383     0.35   0.727     .9667681    1.049652
1.immunosu~d |   1.000449   .0175423     0.03   0.980     .9666513    1.035429
1.ra_sle_p~s |   1.009245   .0212065     0.44   0.661     .9685249    1.051676
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,971                  Number of obs    =      66,971
No. of failures =       14,176
Time at risk    =      6224449
                                                LR chi2(55)      =       44.85
Log likelihood  =   -121358.77                  Prob > chi2      =      0.8341

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   .9504212   .0509768    -0.95   0.343     .8555808    1.055775
Other White  |   .8994669   .0488081    -1.95   0.051     .8087162    1.000401
White + C..  |   .9459097   .0508513    -1.03   0.301     .8513141    1.051016
White + A..  |   .9629564   .0513034    -0.71   0.479     .8674754    1.068947
White + A..  |   .8979717   .0491178    -1.97   0.049     .8066835    .9995907
Other mixed  |   .9296617    .050162    -1.35   0.176     .8363661    1.033364
     Indian  |   .9244171   .0500217    -1.45   0.146     .8313963    1.027846
  Pakistani  |   .8687095   .0474126    -2.58   0.010     .7805801    .9667888
Bangladeshi  |   .9936116   .0527848    -0.12   0.904     .8953592    1.102646
Other Asian  |   .9452178    .050756    -1.05   0.294     .8507938    1.050121
  Caribbean  |   .9229745   .0497949    -1.49   0.137      .830361    1.025917
    African  |   .9374385   .0503845    -1.20   0.229     .8437101    1.041579
Other Black  |   .9492375   .0510402    -0.97   0.333     .8542914    1.054736
    Chinese  |   .9340935   .0504566    -1.26   0.207     .8402553    1.038411
      Other  |    .965766   .0515503    -0.65   0.514     .8698348    1.072277
    Unknown  |   .9301267   .0380647    -1.77   0.077     .8584349    1.007806
             |
        male |
       Male  |   .9798438   .0165463    -1.21   0.228     .9479445    1.012817
        age1 |   1.002614   .0023846     1.10   0.272     .9979515    1.007299
        age2 |   .9898212   .0084413    -1.20   0.230     .9734141    1.006505
        age3 |   1.028028   .0231673     1.23   0.220     .9836094    1.074453
             |
         imd |
          4  |   1.002098   .0212795     0.10   0.921     .9612468    1.044685
5 most de..  |   1.010188   .0285057     0.36   0.719     .9558351    1.067632
             |
   bmicat_sa |
Normal (..)  |   1.057239   .0659428     0.89   0.372     .9355815    1.194717
Overweig..)  |   1.001893   .0608137     0.03   0.975     .8895176    1.128466
Obese I ..)  |    1.00721   .0600615     0.12   0.904     .8961101    1.132083
Obese II..)  |   1.037163    .061628     0.61   0.539     .9231421    1.165266
Obese II..)  |    .999437   .0585911    -0.01   0.992     .8909523    1.121131
    Unknown  |   1.006073   .0594532     0.10   0.918     .8960421    1.129616
             |
    hba1ccat |
  >=6.5-7.4  |   .9837093   .0220839    -0.73   0.464      .941364    1.027959
  >=7.5-7.9  |   .9552529   .0341958    -1.28   0.201     .8905275    1.024683
    >=8-8.9  |   .9207135   .0303134    -2.51   0.012     .8631766    .9820856
        >=9  |   .9613056   .0415904    -0.91   0.362     .8831504    1.046377
    Unknown  |   .9888722   .1338055    -0.08   0.934      .758513    1.289191
             |
gp_consult~t |   1.000868   .0036434     0.24   0.812     .9937524    1.008035
             |
smoke_nomiss |
     Former  |   1.039396   .0617901     0.65   0.516     .9250785     1.16784
    Current  |   .9980566   .0258026    -0.08   0.940     .9487443    1.049932
             |
1.hyperten~n |   .9816743   .0207028    -0.88   0.380     .9419247    1.023101
             |
      bp_cat |
High, sta..  |   .5884493   .4418923    -0.71   0.480     .1350531    2.563973
High, sta..  |   .4497479   .3184815    -1.13   0.259     .1122548    1.801911
    Unknown  |   .4415212    .312858    -1.15   0.249     .1101026    1.770539
             |
    1.asthma |   1.001061   .0428579     0.02   0.980     .9204889    1.088686
1.~y_disease |   1.017986   .0212927     0.85   0.394     .9770972    1.060586
1.~c_disease |   1.042214   .0216032     1.99   0.046     1.000721    1.085427
             |
     dm_type |
       T1DM  |   .9361663   .0481577    -1.28   0.200     .8463812    1.035476
       T2DM  |    .967675   .0205749    -1.55   0.122     .9281775    1.008853
 UNKNOWN_DM  |   .9482554   .0575249    -0.88   0.381     .8419535    1.067979
             |
    1.cancer |    .983664   .0207936    -0.78   0.436      .943742    1.025275
1.~r_disease |   1.025516   .0214691     1.20   0.229     .9842888     1.06847
    1.stroke |   1.012175   .0211976     0.58   0.563      .971469    1.054586
  1.dementia |   .9930926   .0209587    -0.33   0.743     .9528522    1.035032
1.other_ne~o |   1.000586   .0210398     0.03   0.978     .9601872    1.042685
             |
      egfr60 |
   eGFR <60  |   .9566741   .0814289    -0.52   0.603     .8096785    1.130356
      1.esrf |   1.007358   .0211383     0.35   0.727     .9667681    1.049652
1.immunosu~d |   1.000449   .0175423     0.03   0.980     .9666513    1.035429
1.ra_sle_p~s |   1.009245   .0212065     0.44   0.661     .9685249    1.051676
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model2_hes_eth16.ster not found)
file ./output/model2_hes_eth16.ster saved
(note: file ./output/model2_hes_eth16.dta not found)
file ./output/model2_hes_eth16.dta saved

         failure _d:  hes
   analysis time _t:  (stime_hes-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,971                  Number of obs    =      66,971
No. of failures =       14,176
Time at risk    =      6224449
                                                LR chi2(57)      =       45.16
Log likelihood  =   -121358.61                  Prob > chi2      =      0.8714

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   .9503884   .0509751    -0.95   0.343     .8555513    1.055738
Other White  |   .8993985   .0488045    -1.95   0.051     .8086544    1.000326
White + C..  |   .9458376   .0508476    -1.04   0.300     .8512489    1.050937
White + A..  |    .962793   .0512955    -0.71   0.477     .8673268    1.068767
White + A..  |     .89793   .0491161    -1.97   0.049     .8066449    .9995456
Other mixed  |    .929682   .0501633    -1.35   0.177     .8363841    1.033387
     Indian  |   .9242743   .0500146    -1.46   0.146     .8312668    1.027688
  Pakistani  |   .8686572   .0474099    -2.58   0.010     .7805329    .9667309
Bangladeshi  |   .9935497   .0527828    -0.12   0.903      .895301     1.10258
Other Asian  |   .9451303   .0507515    -1.05   0.293     .8507147    1.050025
  Caribbean  |   .9229628   .0497947    -1.49   0.137     .8303498    1.025905
    African  |   .9373311    .050379    -1.20   0.229      .843613    1.041461
Other Black  |   .9490689    .051032    -0.97   0.331     .8541382     1.05455
    Chinese  |   .9341937   .0504624    -1.26   0.208     .8403449    1.038523
      Other  |   .9655812   .0515415    -0.66   0.512     .8696665    1.072074
    Unknown  |   .9301057   .0380638    -1.77   0.077     .8584155    1.007783
             |
        male |
       Male  |   .9797887   .0165457    -1.21   0.227     .9478905     1.01276
        age1 |    1.00262   .0023847     1.10   0.271     .9979568    1.007304
        age2 |    .989804   .0084413    -1.20   0.229     .9733969    1.006488
        age3 |   1.028071   .0231685     1.23   0.219     .9836502    1.074499
             |
         imd |
          4  |   1.002149   .0212808     0.10   0.919     .9612951    1.044738
5 most de..  |   1.010192    .028506     0.36   0.719     .9558385    1.067637
             |
   bmicat_sa |
Normal (..)  |    1.05721   .0659414     0.89   0.372     .9355545    1.194684
Overweig..)  |   1.001828   .0608121     0.03   0.976     .8894556    1.128397
Obese I ..)  |   1.007179   .0600606     0.12   0.905     .8960811    1.132051
Obese II..)  |   1.037084   .0616249     0.61   0.540     .9230697    1.165181
Obese II..)  |   .9993897   .0585901    -0.01   0.992     .8909071    1.121082
    Unknown  |   1.005994   .0594494     0.10   0.919     .8959701    1.129529
             |
    hba1ccat |
  >=6.5-7.4  |   .9836369   .0220827    -0.73   0.462      .941294    1.027885
  >=7.5-7.9  |   .9551076   .0341916    -1.28   0.199     .8903903    1.024529
    >=8-8.9  |   .9207276   .0303142    -2.51   0.012     .8631892    .9821013
        >=9  |   .9612867   .0415897    -0.91   0.361     .8831329    1.046357
    Unknown  |   .9885805   .1337672    -0.08   0.932     .7582876    1.288814
             |
gp_consult~t |   1.000871   .0036436     0.24   0.811     .9937547    1.008037
             |
smoke_nomiss |
     Former  |   1.039367   .0617893     0.65   0.516     .9250511    1.167809
    Current  |   .9980416   .0258022    -0.08   0.940       .94873    1.049916
             |
1.hyperten~n |   .9816293   .0207021    -0.88   0.379      .941881    1.023055
             |
      bp_cat |
High, sta..  |   .5892984   .4425324    -0.70   0.481     .1352469    2.567694
High, sta..  |   .4501161   .3187428    -1.13   0.260     .1123464    1.803391
    Unknown  |   .4418943   .3131231    -1.15   0.249     .1101953     1.77204
             |
    1.asthma |   1.000988   .0428565     0.02   0.982     .9204186     1.08861
1.~y_disease |   1.017947   .0212921     0.85   0.395     .9770587    1.060546
1.~c_disease |   1.042146   .0216035     1.99   0.046     1.000653     1.08536
             |
     dm_type |
       T1DM  |   .9362307   .0481647    -1.28   0.200     .8464329    1.035555
       T2DM  |      .9677   .0205756    -1.54   0.123     .9282014    1.008879
 UNKNOWN_DM  |   .9483049   .0575281    -0.87   0.382     .8419971    1.068035
             |
    1.cancer |   .9836496   .0207934    -0.78   0.435      .943728     1.02526
1.~r_disease |    1.02548   .0214685     1.20   0.229     .9842538    1.068432
    1.stroke |   1.012164   .0211974     0.58   0.564     .9714588    1.054575
  1.dementia |   .9931161   .0209593    -0.33   0.743     .9528746    1.035057
1.other_ne~o |   1.000579   .0210398     0.03   0.978     .9601804    1.042678
             |
      egfr60 |
   eGFR <60  |   .9566651   .0814284    -0.52   0.603     .8096704    1.130347
      1.esrf |    1.00735   .0211385     0.35   0.727     .9667598    1.049645
1.immunosu~d |   1.000399    .017542     0.02   0.982     .9666013    1.035378
1.ra_sle_p~s |   1.009196   .0212063     0.44   0.663     .9684764    1.051627
             |
hh_total_cat |
       6-10  |   1.031138   .0587771     0.54   0.591     .9221389    1.153021
        11+  |   .9971007   .2356939    -0.01   0.990     .6273828    1.584694
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model3_hes_eth16.ster not found)
file ./output/model3_hes_eth16.ster saved
(note: file ./output/model3_hes_eth16.dta not found)
file ./output/model3_hes_eth16.dta saved
(output written to ./output/estout_table2_eth16.txt)
icu
(11,780 observations deleted)

         failure _d:  icu
   analysis time _t:  (stime_icu-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,971                  Number of obs    =      66,971
No. of failures =        7,083
Time at risk    =      6936693
                                                LR chi2(16)      =       11.45
Log likelihood  =   -60220.907                  Prob > chi2      =      0.7812

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |    1.13586    .085615     1.69   0.091     .9798639    1.316691
Other White  |   .9433205   .0744179    -0.74   0.460     .8081809    1.101057
White + C..  |   1.022808   .0792727     0.29   0.771     .8786622    1.190602
White + A..  |   .9762587   .0757814    -0.31   0.757     .8384767    1.136682
White + A..  |   1.053862   .0816185     0.68   0.498     .9054425    1.226611
Other mixed  |   1.044862   .0803822     0.57   0.568     .8986184    1.214906
     Indian  |   1.013154   .0787718     0.17   0.867     .8699522    1.179929
  Pakistani  |   .9701664   .0760237    -0.39   0.699     .8320412    1.131222
Bangladeshi  |   .9644549   .0756395    -0.46   0.644     .8270363    1.124707
Other Asian  |   .9570123   .0750541    -0.56   0.575      .820657    1.116023
  Caribbean  |   1.006023   .0779136     0.08   0.938     .8643401     1.17093
    African  |   1.023686   .0791032     0.30   0.762     .8798156    1.191081
Other Black  |   1.024617   .0793538     0.31   0.754     .8803151    1.192572
    Chinese  |   1.072927   .0824275     0.92   0.360     .9229465    1.247279
      Other  |   1.021336   .0791022     0.27   0.785     .8774923    1.188759
    Unknown  |    1.02459   .0610125     0.41   0.683     .9117227    1.151431
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/crude_icu_eth16.ster not found)
file ./output/crude_icu_eth16.ster saved
(note: file ./output/crude_icu_eth16.dta not found)
file ./output/crude_icu_eth16.dta saved

         failure _d:  icu
   analysis time _t:  (stime_icu-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,971                  Number of obs    =      66,971
No. of failures =        7,083
Time at risk    =      6936693
                                                LR chi2(20)      =       15.06
Log likelihood  =   -60219.098                  Prob > chi2      =      0.7727

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   1.135125   .0855625     1.68   0.093     .9792253    1.315846
Other White  |   .9430343   .0743964    -0.74   0.457      .807934    1.100726
White + C..  |   1.022551   .0792574     0.29   0.774     .8784338    1.190313
White + A..  |   .9756971   .0757397    -0.32   0.751     .8379911    1.136032
White + A..  |   1.053519   .0815941     0.67   0.501     .9051434    1.226216
Other mixed  |     1.0446   .0803635     0.57   0.571     .8983909    1.214605
     Indian  |   1.012694    .078741     0.16   0.871     .8695484    1.179403
  Pakistani  |    .969203   .0759532    -0.40   0.690     .8312064     1.13011
Bangladeshi  |   .9645933   .0756516    -0.46   0.646     .8271528    1.124871
Other Asian  |   .9567558   .0750369    -0.56   0.573     .8204321    1.115731
  Caribbean  |   1.005446   .0778695     0.07   0.944     .8638433     1.17026
    African  |   1.024238   .0791498     0.31   0.757     .8802837    1.191733
Other Black  |   1.024377   .0793362     0.31   0.756      .880108    1.192296
    Chinese  |   1.073417   .0824664     0.92   0.356     .9233664    1.247852
      Other  |   1.020865   .0790676     0.27   0.790     .8770842    1.188215
    Unknown  |   1.024458   .0610057     0.41   0.685     .9116029    1.151284
             |
        male |
       Male  |   1.028264   .0244418     1.17   0.241     .9814578    1.077303
        age1 |   1.002792   .0032545     0.86   0.390     .9964339    1.009191
        age2 |   .9870954   .0116595    -1.10   0.272     .9645057    1.010214
        age3 |   1.034251   .0324458     1.07   0.283     .9725736    1.099839
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model0_icu_eth16.ster not found)
file ./output/model0_icu_eth16.ster saved
(note: file ./output/model0_icu_eth16.dta not found)
file ./output/model0_icu_eth16.dta saved

         failure _d:  icu
   analysis time _t:  (stime_icu-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,971                  Number of obs    =      66,971
No. of failures =        7,083
Time at risk    =      6936693
                                                LR chi2(22)      =       16.50
Log likelihood  =   -60218.379                  Prob > chi2      =      0.7903

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   1.135017   .0855556     1.68   0.093     .9791296    1.315723
Other White  |   .9428825   .0743854    -0.75   0.456     .8078022    1.100551
White + C..  |   1.022435   .0792486     0.29   0.775     .8783333    1.190178
White + A..  |   .9759572   .0757602    -0.31   0.754      .838214    1.136336
White + A..  |   1.053621   .0816061     0.67   0.500     .9052244    1.226345
Other mixed  |   1.044393   .0803482     0.56   0.572     .8982117    1.214366
     Indian  |   1.012947   .0787615     0.17   0.869     .8697649    1.179701
  Pakistani  |   .9689391    .075934    -0.40   0.687     .8309776    1.129805
Bangladeshi  |   .9647944   .0756678    -0.46   0.648     .8273245    1.125106
Other Asian  |   .9568448   .0750439    -0.56   0.574     .8205084    1.115835
  Caribbean  |   1.005504   .0778752     0.07   0.943     .8638917     1.17033
    African  |   1.023744    .079113     0.30   0.761     .8798569    1.191161
Other Black  |   1.024895   .0793783     0.32   0.751     .8805496    1.192903
    Chinese  |   1.073493   .0824725     0.92   0.356     .9234308     1.24794
      Other  |   1.020764   .0790604     0.27   0.791     .8769964    1.188099
    Unknown  |   1.024635   .0610171     0.41   0.683     .9117591    1.151485
             |
        male |
       Male  |   1.028149   .0244395     1.17   0.243     .9813467    1.077182
        age1 |   1.002774   .0032547     0.85   0.393     .9964148    1.009173
        age2 |   .9871685   .0116614    -1.09   0.274     .9645751    1.010291
        age3 |   1.034034   .0324418     1.07   0.286     .9723646    1.099614
             |
         imd |
          4  |   1.036053   .0308391     1.19   0.234     .9773391    1.098295
5 most de..  |   1.001273   .0401667     0.03   0.975     .9255634    1.083176
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,971                  Number of obs    =      66,971
No. of failures =        7,083
Time at risk    =      6936693
                                                LR chi2(22)      =       16.50
Log likelihood  =   -60218.379                  Prob > chi2      =      0.7903

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   1.135017   .0855556     1.68   0.093     .9791296    1.315723
Other White  |   .9428825   .0743854    -0.75   0.456     .8078022    1.100551
White + C..  |   1.022435   .0792486     0.29   0.775     .8783333    1.190178
White + A..  |   .9759572   .0757602    -0.31   0.754      .838214    1.136336
White + A..  |   1.053621   .0816061     0.67   0.500     .9052244    1.226345
Other mixed  |   1.044393   .0803482     0.56   0.572     .8982117    1.214366
     Indian  |   1.012947   .0787615     0.17   0.869     .8697649    1.179701
  Pakistani  |   .9689391    .075934    -0.40   0.687     .8309776    1.129805
Bangladeshi  |   .9647944   .0756678    -0.46   0.648     .8273245    1.125106
Other Asian  |   .9568448   .0750439    -0.56   0.574     .8205084    1.115835
  Caribbean  |   1.005504   .0778752     0.07   0.943     .8638917     1.17033
    African  |   1.023744    .079113     0.30   0.761     .8798569    1.191161
Other Black  |   1.024895   .0793783     0.32   0.751     .8805496    1.192903
    Chinese  |   1.073493   .0824725     0.92   0.356     .9234308     1.24794
      Other  |   1.020764   .0790604     0.27   0.791     .8769964    1.188099
    Unknown  |   1.024635   .0610171     0.41   0.683     .9117591    1.151485
             |
        male |
       Male  |   1.028149   .0244395     1.17   0.243     .9813467    1.077182
        age1 |   1.002774   .0032547     0.85   0.393     .9964148    1.009173
        age2 |   .9871685   .0116614    -1.09   0.274     .9645751    1.010291
        age3 |   1.034034   .0324418     1.07   0.286     .9723646    1.099614
             |
         imd |
          4  |   1.036053   .0308391     1.19   0.234     .9773391    1.098295
5 most de..  |   1.001273   .0401667     0.03   0.975     .9255634    1.083176
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model1_icu_eth16.ster not found)
file ./output/model1_icu_eth16.ster saved
(note: file ./output/model1_icu_eth16.dta not found)
file ./output/model1_icu_eth16.dta saved

         failure _d:  icu
   analysis time _t:  (stime_icu-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,971                  Number of obs    =      66,971
No. of failures =        7,083
Time at risk    =      6936693
                                                LR chi2(55)      =       72.25
Log likelihood  =   -60190.504                  Prob > chi2      =      0.0593

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   1.137148   .0857437     1.70   0.088     .9809222    1.318256
Other White  |   .9400543   .0741877    -0.78   0.433     .8053365    1.097308
White + C..  |   1.019046   .0790065     0.24   0.808     .8753874     1.18628
White + A..  |   .9721435   .0754895    -0.36   0.716     .8348959    1.131953
White + A..  |    1.04831    .081224     0.61   0.543      .900612    1.220229
Other mixed  |   1.041719   .0801774     0.53   0.595      .895853    1.211336
     Indian  |    1.01178   .0786992     0.15   0.880     .8687142    1.178406
  Pakistani  |   .9688613   .0759536    -0.40   0.687     .8308679    1.129773
Bangladeshi  |   .9596255    .075292    -0.53   0.599     .8228424    1.119146
Other Asian  |   .9537571    .074821    -0.60   0.546     .8178283    1.112278
  Caribbean  |   1.004151   .0777955     0.05   0.957     .8626866    1.168813
    African  |   1.022344   .0790397     0.29   0.775      .878595    1.189612
Other Black  |   1.020809   .0791032     0.27   0.790     .8769691    1.188242
    Chinese  |   1.069861   .0822161     0.88   0.380      .920269     1.24377
      Other  |   1.022321   .0792149     0.28   0.776     .8782772    1.189989
    Unknown  |   1.022602    .060915     0.38   0.708     .9099167    1.149242
             |
        male |
       Male  |   1.031322    .024652     1.29   0.197     .9841195    1.080789
        age1 |    1.00327   .0033639     0.97   0.330     .9966983    1.009884
        age2 |   .9858228   .0118712    -1.19   0.236     .9628281    1.009367
        age3 |   1.037044   .0330367     1.14   0.254     .9742731    1.103859
             |
         imd |
          4  |   1.034685   .0308105     1.15   0.252     .9760263     1.09687
5 most de..  |   1.000364   .0401438     0.01   0.993     .9246987    1.082222
             |
   bmicat_sa |
Normal (..)  |   1.152739   .1087962     1.51   0.132     .9580634    1.386973
Overweig..)  |   1.186335    .108564     1.87   0.062     .9915439    1.419392
Obese I ..)  |   1.237207   .1112784     2.37   0.018     1.037248    1.475714
Obese II..)  |   1.108739   .1001005     1.14   0.253     .9289239    1.323361
Obese II..)  |   1.229201   .1090043     2.33   0.020     1.033092    1.462536
    Unknown  |   1.215423   .1086106     2.18   0.029     1.020149    1.448075
             |
    hba1ccat |
  >=6.5-7.4  |   .9662633   .0308907    -1.07   0.283     .9075765    1.028745
  >=7.5-7.9  |   .9350279   .0481181    -1.31   0.192     .8453184    1.034258
    >=8-8.9  |   .9862595   .0449036    -0.30   0.761     .9020626    1.078315
        >=9  |   .9743334   .0592222    -0.43   0.669     .8649074    1.097604
    Unknown  |   .9424521   .1820302    -0.31   0.759     .6454368    1.376147
             |
gp_consult~t |   .9973011   .0051447    -0.52   0.600     .9872685    1.007436
             |
smoke_nomiss |
     Former  |   .6980856    .069724    -3.60   0.000     .5739732    .8490352
    Current  |   1.004948   .0366205     0.14   0.892     .9356759    1.079348
             |
1.hyperten~n |   .9615837   .0288231    -1.31   0.191     .9067189    1.019768
             |
      bp_cat |
High, sta..  |   .3694589   .4052402    -0.91   0.364     .0430455    3.171061
High, sta..  |   .4954993   .4962293    -0.70   0.483     .0695965    3.527757
    Unknown  |   .4815706   .4826016    -0.73   0.466     .0675517    3.433079
             |
    1.asthma |   .9569768   .0588967    -0.71   0.475     .8482319    1.079663
1.~y_disease |   .9996558   .0297857    -0.01   0.991     .9429489    1.059773
1.~c_disease |   .9867628   .0294266    -0.45   0.655     .9307409    1.046157
             |
     dm_type |
       T1DM  |   .8217567   .0638507    -2.53   0.012     .7056749    .9569338
       T2DM  |   .9799309   .0293618    -0.68   0.499       .92404    1.039202
 UNKNOWN_DM  |   .8675391   .0776145    -1.59   0.112     .7280081    1.033813
             |
    1.cancer |   1.001597   .0298617     0.05   0.957     .9447461    1.061868
1.~r_disease |   .9661977   .0291249    -1.14   0.254     .9107676    1.025001
    1.stroke |    .997118   .0296728    -0.10   0.923     .9406239    1.057005
  1.dementia |   .9479885   .0287457    -1.76   0.078     .8932895    1.006037
1.other_ne~o |   1.063187   .0310445     2.10   0.036      1.00405    1.125808
             |
      egfr60 |
   eGFR <60  |    1.14583   .1320776     1.18   0.238     .9141214    1.436272
      1.esrf |   .9931136   .0296247    -0.23   0.817      .936715    1.052908
1.immunosu~d |   .9810429   .0244018    -0.77   0.442     .9343633    1.030055
1.ra_sle_p~s |   1.003533   .0298839     0.12   0.906     .9466384    1.063848
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,971                  Number of obs    =      66,971
No. of failures =        7,083
Time at risk    =      6936693
                                                LR chi2(55)      =       72.25
Log likelihood  =   -60190.504                  Prob > chi2      =      0.0593

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   1.137148   .0857437     1.70   0.088     .9809222    1.318256
Other White  |   .9400543   .0741877    -0.78   0.433     .8053365    1.097308
White + C..  |   1.019046   .0790065     0.24   0.808     .8753874     1.18628
White + A..  |   .9721435   .0754895    -0.36   0.716     .8348959    1.131953
White + A..  |    1.04831    .081224     0.61   0.543      .900612    1.220229
Other mixed  |   1.041719   .0801774     0.53   0.595      .895853    1.211336
     Indian  |    1.01178   .0786992     0.15   0.880     .8687142    1.178406
  Pakistani  |   .9688613   .0759536    -0.40   0.687     .8308679    1.129773
Bangladeshi  |   .9596255    .075292    -0.53   0.599     .8228424    1.119146
Other Asian  |   .9537571    .074821    -0.60   0.546     .8178283    1.112278
  Caribbean  |   1.004151   .0777955     0.05   0.957     .8626866    1.168813
    African  |   1.022344   .0790397     0.29   0.775      .878595    1.189612
Other Black  |   1.020809   .0791032     0.27   0.790     .8769691    1.188242
    Chinese  |   1.069861   .0822161     0.88   0.380      .920269     1.24377
      Other  |   1.022321   .0792149     0.28   0.776     .8782772    1.189989
    Unknown  |   1.022602    .060915     0.38   0.708     .9099167    1.149242
             |
        male |
       Male  |   1.031322    .024652     1.29   0.197     .9841195    1.080789
        age1 |    1.00327   .0033639     0.97   0.330     .9966983    1.009884
        age2 |   .9858228   .0118712    -1.19   0.236     .9628281    1.009367
        age3 |   1.037044   .0330367     1.14   0.254     .9742731    1.103859
             |
         imd |
          4  |   1.034685   .0308105     1.15   0.252     .9760263     1.09687
5 most de..  |   1.000364   .0401438     0.01   0.993     .9246987    1.082222
             |
   bmicat_sa |
Normal (..)  |   1.152739   .1087962     1.51   0.132     .9580634    1.386973
Overweig..)  |   1.186335    .108564     1.87   0.062     .9915439    1.419392
Obese I ..)  |   1.237207   .1112784     2.37   0.018     1.037248    1.475714
Obese II..)  |   1.108739   .1001005     1.14   0.253     .9289239    1.323361
Obese II..)  |   1.229201   .1090043     2.33   0.020     1.033092    1.462536
    Unknown  |   1.215423   .1086106     2.18   0.029     1.020149    1.448075
             |
    hba1ccat |
  >=6.5-7.4  |   .9662633   .0308907    -1.07   0.283     .9075765    1.028745
  >=7.5-7.9  |   .9350279   .0481181    -1.31   0.192     .8453184    1.034258
    >=8-8.9  |   .9862595   .0449036    -0.30   0.761     .9020626    1.078315
        >=9  |   .9743334   .0592222    -0.43   0.669     .8649074    1.097604
    Unknown  |   .9424521   .1820302    -0.31   0.759     .6454368    1.376147
             |
gp_consult~t |   .9973011   .0051447    -0.52   0.600     .9872685    1.007436
             |
smoke_nomiss |
     Former  |   .6980856    .069724    -3.60   0.000     .5739732    .8490352
    Current  |   1.004948   .0366205     0.14   0.892     .9356759    1.079348
             |
1.hyperten~n |   .9615837   .0288231    -1.31   0.191     .9067189    1.019768
             |
      bp_cat |
High, sta..  |   .3694589   .4052402    -0.91   0.364     .0430455    3.171061
High, sta..  |   .4954993   .4962293    -0.70   0.483     .0695965    3.527757
    Unknown  |   .4815706   .4826016    -0.73   0.466     .0675517    3.433079
             |
    1.asthma |   .9569768   .0588967    -0.71   0.475     .8482319    1.079663
1.~y_disease |   .9996558   .0297857    -0.01   0.991     .9429489    1.059773
1.~c_disease |   .9867628   .0294266    -0.45   0.655     .9307409    1.046157
             |
     dm_type |
       T1DM  |   .8217567   .0638507    -2.53   0.012     .7056749    .9569338
       T2DM  |   .9799309   .0293618    -0.68   0.499       .92404    1.039202
 UNKNOWN_DM  |   .8675391   .0776145    -1.59   0.112     .7280081    1.033813
             |
    1.cancer |   1.001597   .0298617     0.05   0.957     .9447461    1.061868
1.~r_disease |   .9661977   .0291249    -1.14   0.254     .9107676    1.025001
    1.stroke |    .997118   .0296728    -0.10   0.923     .9406239    1.057005
  1.dementia |   .9479885   .0287457    -1.76   0.078     .8932895    1.006037
1.other_ne~o |   1.063187   .0310445     2.10   0.036      1.00405    1.125808
             |
      egfr60 |
   eGFR <60  |    1.14583   .1320776     1.18   0.238     .9141214    1.436272
      1.esrf |   .9931136   .0296247    -0.23   0.817      .936715    1.052908
1.immunosu~d |   .9810429   .0244018    -0.77   0.442     .9343633    1.030055
1.ra_sle_p~s |   1.003533   .0298839     0.12   0.906     .9466384    1.063848
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model2_icu_eth16.ster not found)
file ./output/model2_icu_eth16.ster saved
(note: file ./output/model2_icu_eth16.dta not found)
file ./output/model2_icu_eth16.dta saved

         failure _d:  icu
   analysis time _t:  (stime_icu-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,971                  Number of obs    =      66,971
No. of failures =        7,083
Time at risk    =      6936693
                                                LR chi2(57)      =       73.99
Log likelihood  =   -60189.634                  Prob > chi2      =      0.0646

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   1.137131   .0857426     1.70   0.088     .9809071    1.318237
Other White  |    .940478   .0742215    -0.78   0.437     .8056988    1.097803
White + C..  |   1.019194   .0790181     0.25   0.806     .8755139    1.186453
White + A..  |   .9727379   .0755371    -0.36   0.722     .8354039    1.132648
White + A..  |   1.048067   .0812054     0.61   0.545     .9004031    1.219947
Other mixed  |   1.041609   .0801691     0.53   0.596     .8957578    1.211208
     Indian  |   1.012214    .078734     0.16   0.876     .8690851    1.178914
  Pakistani  |   .9689441   .0759602    -0.40   0.687     .8309386     1.12987
Bangladeshi  |   .9592362   .0752621    -0.53   0.596     .8225077    1.118694
Other Asian  |   .9541104   .0748496    -0.60   0.549     .8181297    1.112692
  Caribbean  |   1.004043   .0777874     0.05   0.958     .8625935    1.168688
    African  |   1.022673   .0790668     0.29   0.772     .8788754    1.189999
Other Black  |   1.021242   .0791377     0.27   0.786     .8773395    1.188748
    Chinese  |   1.069982   .0822272     0.88   0.379       .92037    1.243915
      Other  |   1.022764   .0792505     0.29   0.771     .8786558    1.190508
    Unknown  |   1.022883    .060932     0.38   0.704     .9101669    1.149559
             |
        male |
       Male  |   1.031293   .0246517     1.29   0.197     .9840908    1.080759
        age1 |   1.003273   .0033639     0.97   0.330     .9967012    1.009888
        age2 |   .9858249   .0118708    -1.19   0.236     .9628309    1.009368
        age3 |   1.037046   .0330351     1.14   0.253      .974278    1.103857
             |
         imd |
          4  |   1.034621   .0308091     1.14   0.253     .9759647    1.096803
5 most de..  |   1.000457   .0401476     0.01   0.991     .9247838    1.082322
             |
   bmicat_sa |
Normal (..)  |   1.152133   .1087394     1.50   0.133     .9575588    1.386245
Overweig..)  |   1.185282     .10847     1.86   0.063     .9906607    1.418139
Obese I ..)  |    1.23634   .1112015     2.36   0.018     1.036519    1.474682
Obese II..)  |   1.107912   .1000275     1.14   0.256      .928228    1.322378
Obese II..)  |   1.228109   .1089095     2.32   0.021     1.032171    1.461242
    Unknown  |    1.21456   .1085359     2.18   0.030     1.019421    1.447053
             |
    hba1ccat |
  >=6.5-7.4  |   .9662096   .0308893    -1.08   0.282     .9075254    1.028689
  >=7.5-7.9  |    .934912   .0481137    -1.31   0.191     .8452108    1.034133
    >=8-8.9  |   .9865264   .0449161    -0.30   0.766     .9023062    1.078608
        >=9  |   .9742338   .0592165    -0.43   0.668     .8648184    1.097492
    Unknown  |     .94214   .1819713    -0.31   0.758     .6452212    1.375695
             |
gp_consult~t |   .9972498   .0051445    -0.53   0.593     .9872175    1.007384
             |
smoke_nomiss |
     Former  |   .6976983   .0696857    -3.60   0.000      .573654    .8485652
    Current  |   1.004891   .0366185     0.13   0.893     .9356233    1.079287
             |
1.hyperten~n |   .9616737   .0288258    -1.30   0.192     .9068037    1.019864
             |
      bp_cat |
High, sta..  |    .368982   .4047195    -0.91   0.363     .0429894    3.167009
High, sta..  |   .4954285   .4961594    -0.70   0.483     .0695863    3.527268
    Unknown  |   .4815161   .4825482    -0.73   0.466     .0675437    3.432707
             |
    1.asthma |   .9576968   .0589432    -0.70   0.482     .8488663     1.08048
1.~y_disease |    .999843   .0297916    -0.01   0.996     .9431248    1.059972
1.~c_disease |   .9871341   .0294387    -0.43   0.664     .9310892    1.046553
             |
     dm_type |
       T1DM  |    .822641   .0639225    -2.51   0.012      .706429    .9579705
       T2DM  |    .979947   .0293624    -0.68   0.499     .9240551     1.03922
 UNKNOWN_DM  |   .8678031   .0776384    -1.58   0.113     .7282291    1.034128
             |
    1.cancer |   1.001536   .0298599     0.05   0.959     .9446883    1.061804
1.~r_disease |   .9663064   .0291287    -1.14   0.256      .910869    1.025118
    1.stroke |   .9971537    .029674    -0.10   0.924     .9406573    1.057043
  1.dementia |     .94791   .0287433    -1.76   0.078     .8932155    1.005954
1.other_ne~o |   1.063073   .0310414     2.09   0.036     1.003942    1.125688
             |
      egfr60 |
   eGFR <60  |   1.145512   .1320429     1.18   0.239     .9138645    1.435877
      1.esrf |   .9929271   .0296194    -0.24   0.812     .9365385    1.052711
1.immunosu~d |   .9813051   .0244091    -0.76   0.448     .9346115    1.030331
1.ra_sle_p~s |   1.003843    .029894     0.13   0.898     .9469292    1.064178
             |
hh_total_cat |
       6-10  |   .9673877   .0757887    -0.42   0.672      .829687    1.127942
        11+  |   .6044442   .2512614    -1.21   0.226     .2676211    1.365187
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model3_icu_eth16.ster not found)
file ./output/model3_icu_eth16.ster saved
(note: file ./output/model3_icu_eth16.dta not found)
file ./output/model3_icu_eth16.dta saved
(output written to ./output/estout_table2_eth16.txt)
onscoviddeath
(11,780 observations deleted)

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,971                  Number of obs    =      66,971
No. of failures =        4,027
Time at risk    =      7021368
                                                LR chi2(16)      =       11.94
Log likelihood  =   -34950.458                  Prob > chi2      =      0.7478

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   1.181865   .1225764     1.61   0.107     .9644638     1.44827
Other White  |    1.13392   .1187373     1.20   0.230     .9235267    1.392243
White + C..  |   1.153136   .1205898     1.36   0.173     .9394328    1.415453
White + A..  |   .9913219   .1069052    -0.08   0.936     .8024542    1.224642
White + A..  |   1.147095   .1205529     1.31   0.192     .9335619    1.409469
Other mixed  |   1.090629   .1153539     0.82   0.412     .8864352     1.34186
     Indian  |   1.128038   .1185569     1.15   0.252     .9180411    1.386069
  Pakistani  |   1.145229   .1194773     1.30   0.194     .9334468     1.40506
Bangladeshi  |   1.220591   .1257428     1.93   0.053     .9974271    1.493686
Other Asian  |   1.102782   .1163397     0.93   0.354     .8967902     1.35609
  Caribbean  |   .9811937   .1064471    -0.18   0.861     .7932502    1.213666
    African  |   1.137943   .1188579     1.24   0.216     .9272834    1.396459
Other Black  |   1.099839   .1163284     0.90   0.368     .8939197    1.353192
    Chinese  |   1.208023   .1251523     1.82   0.068     .9860292    1.479996
      Other  |   1.132875   .1186202     1.19   0.233     .9226882    1.390941
    Unknown  |   1.104789   .0909915     1.21   0.226     .9400991     1.29833
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/crude_onscoviddeath_eth16.ster not found)
file ./output/crude_onscoviddeath_eth16.ster saved
(note: file ./output/crude_onscoviddeath_eth16.dta not found)
file ./output/crude_onscoviddeath_eth16.dta saved

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,971                  Number of obs    =      66,971
No. of failures =        4,027
Time at risk    =      7021368
                                                LR chi2(20)      =       15.54
Log likelihood  =    -34948.66                  Prob > chi2      =      0.7447

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   1.182281    .122622     1.61   0.106     .9647999    1.448787
Other White  |    1.13453   .1188041     1.21   0.228     .9240192    1.392999
White + C..  |   1.151584    .120433     1.35   0.177     .9381599    1.413561
White + A..  |   .9904651   .1068148    -0.09   0.929     .8017574    1.223588
White + A..  |   1.146088   .1204516     1.30   0.194     .9327356    1.408243
Other mixed  |   1.090429   .1153348     0.82   0.413     .8862691    1.341618
     Indian  |   1.128128   .1185756     1.15   0.251     .9181002    1.386203
  Pakistani  |   1.144167   .1193738     1.29   0.197     .9325704    1.403775
Bangladeshi  |   1.220202   .1257051     1.93   0.053     .9971058    1.493216
Other Asian  |    1.10302   .1163696     0.93   0.353     .8969765    1.356395
  Caribbean  |   .9812638   .1064551    -0.17   0.862     .7933062    1.213754
    African  |   1.138262   .1188962     1.24   0.215     .9275363    1.396863
Other Black  |   1.100093   .1163571     0.90   0.367     .8941236    1.353509
    Chinese  |   1.207697   .1251212     1.82   0.069     .9857597    1.479603
      Other  |   1.132699   .1186032     1.19   0.234      .922543    1.390729
    Unknown  |   1.105032   .0910138     1.21   0.225     .9403019    1.298621
             |
        male |
       Male  |   .9567844   .0301802    -1.40   0.161     .8994237    1.017803
        age1 |   1.001832   .0042963     0.43   0.669     .9934472    1.010288
        age2 |   .9894421   .0154894    -0.68   0.498     .9595445    1.020271
        age3 |   1.028195   .0428071     0.67   0.504      .947627    1.115614
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model0_onscoviddeath_eth16.ster not found)
file ./output/model0_onscoviddeath_eth16.ster saved
(note: file ./output/model0_onscoviddeath_eth16.dta not found)
file ./output/model0_onscoviddeath_eth16.dta saved

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,971                  Number of obs    =      66,971
No. of failures =        4,027
Time at risk    =      7021368
                                                LR chi2(22)      =       20.44
Log likelihood  =   -34946.208                  Prob > chi2      =      0.5552

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   1.183536   .1227541     1.62   0.104      .965821    1.450329
Other White  |   1.135423   .1188988     1.21   0.225     .9247446    1.394098
White + C..  |   1.152134   .1204906     1.35   0.176      .938607    1.414236
White + A..  |   .9898027   .1067443    -0.10   0.924     .8012198    1.222772
White + A..  |   1.148393   .1206993     1.32   0.188      .934602    1.411088
Other mixed  |   1.091438   .1154425     0.83   0.408      .887088    1.342863
     Indian  |   1.128627   .1186288     1.15   0.250     .9185046    1.386817
  Pakistani  |   1.145622   .1195271     1.30   0.193     .9337532    1.405563
Bangladeshi  |   1.220594   .1257466     1.93   0.053      .997424    1.493698
Other Asian  |   1.102669   .1163327     0.93   0.354     .8966901    1.355963
  Caribbean  |   .9822336   .1065615    -0.17   0.869     .7940883    1.214957
    African  |   1.139261   .1190013     1.25   0.212     .9283486    1.398091
Other Black  |   1.100651   .1164181     0.91   0.365     .8945744    1.354201
    Chinese  |   1.206755   .1250241     1.81   0.070     .9849893     1.47845
      Other  |   1.133133   .1186486     1.19   0.233     .9228959    1.391261
    Unknown  |   1.105536   .0910568     1.22   0.223     .9407283    1.299217
             |
        male |
       Male  |   .9569969    .030187    -1.39   0.163     .8996232     1.01803
        age1 |   1.001928   .0042966     0.45   0.653     .9935423    1.010385
        age2 |    .989081   .0154834    -0.70   0.483     .9591949    1.019898
        age3 |   1.029172   .0428467     0.69   0.490     .9485286    1.116671
             |
         imd |
          4  |   .9552863   .0383552    -1.14   0.255     .8829933    1.033498
5 most de..  |   .8938165   .0494474    -2.03   0.042     .8019707    .9961809
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,971                  Number of obs    =      66,971
No. of failures =        4,027
Time at risk    =      7021368
                                                LR chi2(22)      =       20.44
Log likelihood  =   -34946.208                  Prob > chi2      =      0.5552

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   1.183536   .1227541     1.62   0.104      .965821    1.450329
Other White  |   1.135423   .1188988     1.21   0.225     .9247446    1.394098
White + C..  |   1.152134   .1204906     1.35   0.176      .938607    1.414236
White + A..  |   .9898027   .1067443    -0.10   0.924     .8012198    1.222772
White + A..  |   1.148393   .1206993     1.32   0.188      .934602    1.411088
Other mixed  |   1.091438   .1154425     0.83   0.408      .887088    1.342863
     Indian  |   1.128627   .1186288     1.15   0.250     .9185046    1.386817
  Pakistani  |   1.145622   .1195271     1.30   0.193     .9337532    1.405563
Bangladeshi  |   1.220594   .1257466     1.93   0.053      .997424    1.493698
Other Asian  |   1.102669   .1163327     0.93   0.354     .8966901    1.355963
  Caribbean  |   .9822336   .1065615    -0.17   0.869     .7940883    1.214957
    African  |   1.139261   .1190013     1.25   0.212     .9283486    1.398091
Other Black  |   1.100651   .1164181     0.91   0.365     .8945744    1.354201
    Chinese  |   1.206755   .1250241     1.81   0.070     .9849893     1.47845
      Other  |   1.133133   .1186486     1.19   0.233     .9228959    1.391261
    Unknown  |   1.105536   .0910568     1.22   0.223     .9407283    1.299217
             |
        male |
       Male  |   .9569969    .030187    -1.39   0.163     .8996232     1.01803
        age1 |   1.001928   .0042966     0.45   0.653     .9935423    1.010385
        age2 |    .989081   .0154834    -0.70   0.483     .9591949    1.019898
        age3 |   1.029172   .0428467     0.69   0.490     .9485286    1.116671
             |
         imd |
          4  |   .9552863   .0383552    -1.14   0.255     .8829933    1.033498
5 most de..  |   .8938165   .0494474    -2.03   0.042     .8019707    .9961809
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model1_onscoviddeath_eth16.ster not found)
file ./output/model1_onscoviddeath_eth16.ster saved
(note: file ./output/model1_onscoviddeath_eth16.dta not found)
file ./output/model1_onscoviddeath_eth16.dta saved

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,971                  Number of obs    =      66,971
No. of failures =        4,027
Time at risk    =      7021368
                                                LR chi2(54)      =       65.11
Log likelihood  =   -34923.877                  Prob > chi2      =      0.1432

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   1.183042   .1227239     1.62   0.105     .9653835    1.449773
Other White  |   1.128412   .1181899     1.15   0.249     .9189941    1.385551
White + C..  |   1.150885   .1203754     1.34   0.179      .937565     1.41274
White + A..  |   .9846977   .1062145    -0.14   0.886     .7970544    1.216516
White + A..  |   1.144247   .1202961     1.28   0.200     .9311759    1.406072
Other mixed  |   1.088512   .1151662     0.80   0.423     .8846571    1.339343
     Indian  |   1.127895   .1185809     1.14   0.252     .9178627    1.385988
  Pakistani  |   1.138537   .1188111     1.24   0.214     .9279417    1.396927
Bangladeshi  |   1.216602   .1253712     1.90   0.057     .9941048    1.488899
Other Asian  |   1.105267   .1166244     0.95   0.343      .898775      1.3592
  Caribbean  |   .9780773   .1061269    -0.20   0.838     .7907023    1.209855
    African  |    1.13362   .1184471     1.20   0.230     .9236962    1.391253
Other Black  |    1.09839   .1162171     0.89   0.375     .8926757    1.351511
    Chinese  |   1.204203   .1247868     1.79   0.073     .9828629    1.475388
      Other  |   1.130768   .1184277     1.17   0.241      .920927    1.388422
    Unknown  |   1.101496   .0907385     1.17   0.241     .9372668    1.294503
             |
        male |
       Male  |   .9604718   .0304597    -1.27   0.203     .9025895    1.022066
        age1 |    1.00256   .0044419     0.58   0.564     .9938916    1.011304
        age2 |   .9872393    .015754    -0.80   0.421     .9568399    1.018605
        age3 |   1.033401   .0436797     0.78   0.437     .9512408    1.122658
             |
         imd |
          4  |   .9548447   .0383482    -1.15   0.250     .8825657    1.033043
5 most de..  |   .8930963   .0494211    -2.04   0.041     .8013006    .9954079
             |
   bmicat_sa |
Normal (..)  |   1.129988   .1427882     0.97   0.333     .8820919    1.447551
Overweig..)  |   1.182308   .1447037     1.37   0.171     .9301464     1.50283
Obese I ..)  |   1.143038   .1380588     1.11   0.268     .9020916    1.448341
Obese II..)  |   1.205462   .1449436     1.55   0.120     .9523705    1.525813
Obese II..)  |    1.23348   .1462791     1.77   0.077     .9776593     1.55624
    Unknown  |    1.20773   .1443269     1.58   0.114     .9555404    1.526479
             |
    hba1ccat |
  >=6.5-7.4  |   .9377397   .0402845    -1.50   0.135     .8620163    1.020115
  >=7.5-7.9  |   .9446149   .0641263    -0.84   0.401     .8269323    1.079045
    >=8-8.9  |   1.029683   .0607865     0.50   0.620     .9171776    1.155988
        >=9  |   1.037265   .0812692     0.47   0.641     .8896074     1.20943
    Unknown  |   .9926505   .2490381    -0.03   0.977     .6070791    1.623108
             |
gp_consult~t |   .9876328   .0067942    -1.81   0.070     .9744058    1.001039
             |
smoke_nomiss |
     Former  |   .9699865   .1118294    -0.26   0.792      .773804    1.215907
    Current  |   1.069979   .0505095     1.43   0.152     .9754239      1.1737
             |
1.hyperten~n |   .9777373    .038763    -0.57   0.570       .90464    1.056741
             |
      bp_cat |
High, sta..  |   1.05e+08          .        .       .            .           .
High, sta..  |   6.75e+07   2.76e+07    44.09   0.000     3.03e+07    1.50e+08
    Unknown  |   6.84e+07   2.81e+07    43.82   0.000     3.05e+07    1.53e+08
             |
    1.asthma |   .9385563   .0778925    -0.76   0.445     .7976595    1.104341
1.~y_disease |   1.094822   .0420631     2.36   0.018     1.015407    1.180447
1.~c_disease |   1.076796    .041442     1.92   0.055     .9985592    1.161163
             |
     dm_type |
       T1DM  |   1.155097    .102404     1.63   0.104     .9708586    1.374298
       T2DM  |   1.016508    .040154     0.41   0.679      .940777    1.098335
 UNKNOWN_DM  |   1.075146   .1169743     0.67   0.505     .8686758     1.33069
             |
    1.cancer |   1.061403    .041175     1.54   0.125     .9836927    1.145251
1.~r_disease |    1.05944   .0411676     1.49   0.137     .9817488    1.143279
    1.stroke |    1.08421   .0417099     2.10   0.036     1.005467    1.169121
  1.dementia |   1.059164   .0411708     1.48   0.139      .981468    1.143011
1.other_ne~o |   .9904023   .0391748    -0.24   0.807     .9165218    1.070238
             |
      egfr60 |
   eGFR <60  |   1.131798   .1691525     0.83   0.407     .8444087    1.516998
      1.esrf |   .9621125   .0384004    -0.97   0.333     .8897176    1.040398
1.immunosu~d |   .9939653   .0327254    -0.18   0.854     .9318503    1.060221
1.ra_sle_p~s |   1.059984   .0411754     1.50   0.134     .9822772    1.143838
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,971                  Number of obs    =      66,971
No. of failures =        4,027
Time at risk    =      7021368
                                                LR chi2(54)      =       65.11
Log likelihood  =   -34923.877                  Prob > chi2      =      0.1432

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   1.183042   .1227239     1.62   0.105     .9653835    1.449773
Other White  |   1.128412   .1181899     1.15   0.249     .9189941    1.385551
White + C..  |   1.150885   .1203754     1.34   0.179      .937565     1.41274
White + A..  |   .9846977   .1062145    -0.14   0.886     .7970544    1.216516
White + A..  |   1.144247   .1202961     1.28   0.200     .9311759    1.406072
Other mixed  |   1.088512   .1151662     0.80   0.423     .8846571    1.339343
     Indian  |   1.127895   .1185809     1.14   0.252     .9178627    1.385988
  Pakistani  |   1.138537   .1188111     1.24   0.214     .9279417    1.396927
Bangladeshi  |   1.216602   .1253712     1.90   0.057     .9941048    1.488899
Other Asian  |   1.105267   .1166244     0.95   0.343      .898775      1.3592
  Caribbean  |   .9780773   .1061269    -0.20   0.838     .7907023    1.209855
    African  |    1.13362   .1184471     1.20   0.230     .9236962    1.391253
Other Black  |    1.09839   .1162171     0.89   0.375     .8926757    1.351511
    Chinese  |   1.204203   .1247868     1.79   0.073     .9828629    1.475388
      Other  |   1.130768   .1184277     1.17   0.241      .920927    1.388422
    Unknown  |   1.101496   .0907385     1.17   0.241     .9372668    1.294503
             |
        male |
       Male  |   .9604718   .0304597    -1.27   0.203     .9025895    1.022066
        age1 |    1.00256   .0044419     0.58   0.564     .9938916    1.011304
        age2 |   .9872393    .015754    -0.80   0.421     .9568399    1.018605
        age3 |   1.033401   .0436797     0.78   0.437     .9512408    1.122658
             |
         imd |
          4  |   .9548447   .0383482    -1.15   0.250     .8825657    1.033043
5 most de..  |   .8930963   .0494211    -2.04   0.041     .8013006    .9954079
             |
   bmicat_sa |
Normal (..)  |   1.129988   .1427882     0.97   0.333     .8820919    1.447551
Overweig..)  |   1.182308   .1447037     1.37   0.171     .9301464     1.50283
Obese I ..)  |   1.143038   .1380588     1.11   0.268     .9020916    1.448341
Obese II..)  |   1.205462   .1449436     1.55   0.120     .9523705    1.525813
Obese II..)  |    1.23348   .1462791     1.77   0.077     .9776593     1.55624
    Unknown  |    1.20773   .1443269     1.58   0.114     .9555404    1.526479
             |
    hba1ccat |
  >=6.5-7.4  |   .9377397   .0402845    -1.50   0.135     .8620163    1.020115
  >=7.5-7.9  |   .9446149   .0641263    -0.84   0.401     .8269323    1.079045
    >=8-8.9  |   1.029683   .0607865     0.50   0.620     .9171776    1.155988
        >=9  |   1.037265   .0812692     0.47   0.641     .8896074     1.20943
    Unknown  |   .9926505   .2490381    -0.03   0.977     .6070791    1.623108
             |
gp_consult~t |   .9876328   .0067942    -1.81   0.070     .9744058    1.001039
             |
smoke_nomiss |
     Former  |   .9699865   .1118294    -0.26   0.792      .773804    1.215907
    Current  |   1.069979   .0505095     1.43   0.152     .9754239      1.1737
             |
1.hyperten~n |   .9777373    .038763    -0.57   0.570       .90464    1.056741
             |
      bp_cat |
High, sta..  |   1.05e+08          .        .       .            .           .
High, sta..  |   6.75e+07   2.76e+07    44.09   0.000     3.03e+07    1.50e+08
    Unknown  |   6.84e+07   2.81e+07    43.82   0.000     3.05e+07    1.53e+08
             |
    1.asthma |   .9385563   .0778925    -0.76   0.445     .7976595    1.104341
1.~y_disease |   1.094822   .0420631     2.36   0.018     1.015407    1.180447
1.~c_disease |   1.076796    .041442     1.92   0.055     .9985592    1.161163
             |
     dm_type |
       T1DM  |   1.155097    .102404     1.63   0.104     .9708586    1.374298
       T2DM  |   1.016508    .040154     0.41   0.679      .940777    1.098335
 UNKNOWN_DM  |   1.075146   .1169743     0.67   0.505     .8686758     1.33069
             |
    1.cancer |   1.061403    .041175     1.54   0.125     .9836927    1.145251
1.~r_disease |    1.05944   .0411676     1.49   0.137     .9817488    1.143279
    1.stroke |    1.08421   .0417099     2.10   0.036     1.005467    1.169121
  1.dementia |   1.059164   .0411708     1.48   0.139      .981468    1.143011
1.other_ne~o |   .9904023   .0391748    -0.24   0.807     .9165218    1.070238
             |
      egfr60 |
   eGFR <60  |   1.131798   .1691525     0.83   0.407     .8444087    1.516998
      1.esrf |   .9621125   .0384004    -0.97   0.333     .8897176    1.040398
1.immunosu~d |   .9939653   .0327254    -0.18   0.854     .9318503    1.060221
1.ra_sle_p~s |   1.059984   .0411754     1.50   0.134     .9822772    1.143838
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model2_onscoviddeath_eth16.ster not found)
file ./output/model2_onscoviddeath_eth16.ster saved
(note: file ./output/model2_onscoviddeath_eth16.dta not found)
file ./output/model2_onscoviddeath_eth16.dta saved

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,971                  Number of obs    =      66,971
No. of failures =        4,027
Time at risk    =      7021368
                                                LR chi2(56)      =       65.17
Log likelihood  =   -34923.846                  Prob > chi2      =      0.1880

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   1.183058   .1227256     1.62   0.105     .9653966    1.449794
Other White  |   1.128382   .1181869     1.15   0.249     .9189697    1.385515
White + C..  |   1.150973   .1203856     1.34   0.179     .9376355    1.412851
White + A..  |   .9847259   .1062186    -0.14   0.887     .7970757    1.216554
White + A..  |   1.144382   .1203117     1.28   0.200     .9312836    1.406241
Other mixed  |   1.088504   .1151657     0.80   0.423     .8846495    1.339333
     Indian  |   1.127981   .1185918     1.15   0.252     .9179298    1.386098
  Pakistani  |   1.138567   .1188143     1.24   0.214      .927966    1.396964
Bangladeshi  |    1.21676   .1253903     1.90   0.057     .9942293    1.489099
Other Asian  |   1.105297   .1166279     0.95   0.343     .8987993    1.359238
  Caribbean  |   .9781109    .106131    -0.20   0.838     .7907288    1.209898
    African  |   1.133696   .1184559     1.20   0.230      .923757    1.391348
Other Black  |   1.098456   .1162258     0.89   0.375     .8927265    1.351596
    Chinese  |    1.20416   .1247832     1.79   0.073     .9828264    1.475337
      Other  |   1.130851   .1184384     1.17   0.240     .9209915    1.388529
    Unknown  |   1.101507   .0907395     1.17   0.241     .9372758    1.294516
             |
        male |
       Male  |   .9604951   .0304606    -1.27   0.204      .902611    1.022091
        age1 |   1.002557   .0044419     0.58   0.564     .9938891    1.011301
        age2 |   .9872449   .0157543    -0.80   0.421     .9568449    1.018611
        age3 |   1.033387   .0436798     0.78   0.437      .951226    1.122644
             |
         imd |
          4  |   .9548263   .0383477    -1.15   0.250     .8825482    1.033024
5 most de..  |    .893067   .0494197    -2.04   0.041     .8012739    .9953758
             |
   bmicat_sa |
Normal (..)  |   1.130168    .142813     0.97   0.333     .8822292    1.447787
Overweig..)  |   1.182583   .1447428     1.37   0.171     .9303549    1.503194
Obese I ..)  |   1.143226   .1380842     1.11   0.268      .902236    1.448586
Obese II..)  |   1.205729     .14498     1.56   0.120     .9525744    1.526161
Obese II..)  |   1.233729    .146313     1.77   0.077     .9778504    1.556565
    Unknown  |   1.207942   .1443551     1.58   0.114     .9557036    1.526754
             |
    hba1ccat |
  >=6.5-7.4  |   .9377898   .0402872    -1.50   0.135     .8620613    1.020171
  >=7.5-7.9  |   .9446944   .0641332    -0.84   0.402     .8269994    1.079139
    >=8-8.9  |   1.029605   .0607829     0.49   0.621     .9171062    1.155903
        >=9  |   1.037349   .0812766     0.47   0.640     .8896783    1.209531
    Unknown  |     .99288   .2490977    -0.03   0.977      .607217     1.62349
             |
gp_consult~t |   .9876387   .0067943    -1.81   0.071     .9744115    1.001046
             |
smoke_nomiss |
     Former  |    .970096   .1118439    -0.26   0.792     .7738885    1.216049
    Current  |       1.07   .0505106     1.43   0.152     .9754429    1.173723
             |
1.hyperten~n |   .9777301   .0387632    -0.57   0.570     .9046325    1.056734
             |
      bp_cat |
High, sta..  |   1.05e+08          .        .       .            .           .
High, sta..  |   6.75e+07   2.76e+07    44.08   0.000     3.03e+07    1.50e+08
    Unknown  |   6.83e+07   2.81e+07    43.82   0.000     3.05e+07    1.53e+08
             |
    1.asthma |   .9384739   .0778889    -0.77   0.444     .7975842    1.104251
1.~y_disease |   1.094799   .0420625     2.36   0.018     1.015386    1.180423
1.~c_disease |   1.076757   .0414427     1.92   0.055     .9985193    1.161126
             |
     dm_type |
       T1DM  |   1.154822   .1023871     1.62   0.104     .9706156    1.373989
       T2DM  |    1.01648   .0401531     0.41   0.679     .9407504    1.098305
 UNKNOWN_DM  |   1.075018    .116962     0.66   0.506     .8685701    1.330535
             |
    1.cancer |   1.061438   .0411767     1.54   0.124      .983725     1.14529
1.~r_disease |   1.059455   .0411685     1.49   0.137      .981762    1.143296
    1.stroke |   1.084212     .04171     2.10   0.036     1.005468    1.169123
  1.dementia |   1.059166   .0411711     1.48   0.139     .9814698    1.143014
1.other_ne~o |   .9904351   .0391764    -0.24   0.808     .9165517    1.070274
             |
      egfr60 |
   eGFR <60  |   1.131762   .1691466     0.83   0.408     .8443833    1.516948
      1.esrf |   .9621458   .0384022    -0.97   0.334     .8897475    1.040435
1.immunosu~d |   .9939399   .0327262    -0.18   0.854     .9318236    1.060197
1.ra_sle_p~s |   1.059961   .0411757     1.50   0.134     .9822542    1.143816
             |
hh_total_cat |
       6-10  |   .9875094   .1036418    -0.12   0.905     .8039061    1.213046
        11+  |   1.082368   .4561874     0.19   0.851     .4738246    2.472477
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model3_onscoviddeath_eth16.ster not found)
file ./output/model3_onscoviddeath_eth16.ster saved
(note: file ./output/model3_onscoviddeath_eth16.dta not found)
file ./output/model3_onscoviddeath_eth16.dta saved
(output written to ./output/estout_table2_eth16.txt)
ons_noncoviddeath
(11,780 observations deleted)

         failure _d:  ons_noncoviddeath
   analysis time _t:  (stime_ons_noncoviddeath-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,971                  Number of obs    =      66,971
No. of failures =       12,073
Time at risk    =      7021368
                                                LR chi2(16)      =       23.13
Log likelihood  =   -104771.88                  Prob > chi2      =      0.1104

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |    1.00336   .0603724     0.06   0.956     .8917435    1.128948
Other White  |   1.085301   .0640267     1.39   0.165     .9667945    1.218334
White + C..  |   1.033302   .0618655     0.55   0.584     .9188918    1.161957
White + A..  |    .950924   .0577875    -0.83   0.408     .8441477    1.071206
White + A..  |   1.114402   .0657638     1.84   0.066     .9926825    1.251047
Other mixed  |   .9917172   .0598933    -0.14   0.890     .8810099    1.116336
     Indian  |   1.057806   .0629781     0.94   0.345     .9413006    1.188731
  Pakistani  |   1.088855   .0641016     1.45   0.148     .9701954    1.222027
Bangladeshi  |   1.014955    .060932     0.25   0.805     .9022892     1.14169
Other Asian  |   1.022999   .0612774     0.38   0.704     .9096796    1.150435
  Caribbean  |   1.027051   .0614098     0.45   0.655     .9134747    1.154748
    African  |   1.122802   .0656094     1.98   0.047     1.001301    1.259048
Other Black  |   1.007378   .0606979     0.12   0.903      .895168    1.133653
    Chinese  |    1.02043   .0613463     0.34   0.737     .9070072    1.148037
      Other  |    1.13508   .0662029     2.17   0.030     1.012466    1.272542
    Unknown  |   1.018374   .0470728     0.39   0.694     .9301692    1.114944
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/crude_ons_noncoviddeath_eth16.ster not found)
file ./output/crude_ons_noncoviddeath_eth16.ster saved
(note: file ./output/crude_ons_noncoviddeath_eth16.dta not found)
file ./output/crude_ons_noncoviddeath_eth16.dta saved

         failure _d:  ons_noncoviddeath
   analysis time _t:  (stime_ons_noncoviddeath-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,971                  Number of obs    =      66,971
No. of failures =       12,073
Time at risk    =      7021368
                                                LR chi2(20)      =       24.27
Log likelihood  =    -104771.3                  Prob > chi2      =      0.2307

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   1.003209   .0603643     0.05   0.958     .8916074     1.12878
Other White  |    1.08537   .0640318     1.39   0.165     .9668538    1.218414
White + C..  |   1.033337   .0618704     0.55   0.584     .9189182    1.162003
White + A..  |    .950694   .0577748    -0.83   0.405     .8439413     1.07095
White + A..  |   1.114439   .0657684     1.84   0.066     .9927106    1.251093
Other mixed  |   .9916678   .0598915    -0.14   0.890      .880964    1.116283
     Indian  |   1.057777    .062981     0.94   0.345     .9412665    1.188708
  Pakistani  |   1.088627    .064092     1.44   0.149     .9699854    1.221779
Bangladeshi  |   1.015168   .0609456     0.25   0.802     .9024773    1.141931
Other Asian  |    1.02289    .061273     0.38   0.706     .9095785    1.150317
  Caribbean  |   1.026865   .0613989     0.44   0.657     .9133088     1.15454
    African  |   1.123163   .0656331     1.99   0.047     1.001618    1.259457
Other Black  |    1.00731   .0606946     0.12   0.904     .8951067    1.133579
    Chinese  |   1.020696   .0613634     0.34   0.733     .9072411    1.148338
      Other  |   1.135119   .0662058     2.17   0.030       1.0125    1.272588
    Unknown  |   1.018425   .0470762     0.39   0.693     .9302139    1.115002
             |
        male |
       Male  |   1.013204   .0184466     0.72   0.471     .9776866    1.050011
        age1 |    1.00082   .0024872     0.33   0.742      .995957    1.005707
        age2 |   .9954885   .0090151    -0.50   0.618     .9779751    1.013316
        age3 |   1.012185   .0243498     0.50   0.615     .9655675    1.061052
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model0_ons_noncoviddeath_eth16.ster not found)
file ./output/model0_ons_noncoviddeath_eth16.ster saved
(note: file ./output/model0_ons_noncoviddeath_eth16.dta not found)
file ./output/model0_ons_noncoviddeath_eth16.dta saved

         failure _d:  ons_noncoviddeath
   analysis time _t:  (stime_ons_noncoviddeath-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,971                  Number of obs    =      66,971
No. of failures =       12,073
Time at risk    =      7021368
                                                LR chi2(22)      =       25.04
Log likelihood  =   -104770.92                  Prob > chi2      =      0.2954

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |    1.00347   .0603809     0.06   0.954     .8918376    1.129075
Other White  |   1.085586   .0640453     1.39   0.164     .9670453    1.218658
White + C..  |   1.033429   .0618759     0.55   0.583     .9189995    1.162106
White + A..  |     .95055   .0577665    -0.83   0.404     .8438127    1.070789
White + A..  |   1.114965   .0658028     1.84   0.065     .9931736    1.251691
Other mixed  |   .9918623   .0599037    -0.14   0.892      .881136    1.116503
     Indian  |   1.057894   .0629884     0.95   0.345     .9413704    1.188841
  Pakistani  |   1.088935   .0641111     1.45   0.148     .9702581    1.222127
Bangladeshi  |   1.015256   .0609515     0.25   0.801     .9025538    1.142031
Other Asian  |   1.022813   .0612685     0.38   0.706     .9095105    1.150231
  Caribbean  |   1.027086   .0614129     0.45   0.655     .9135046     1.15479
    African  |   1.123374    .065646     1.99   0.047     1.001805    1.259695
Other Black  |   1.007431   .0607028     0.12   0.902     .8952123    1.133717
    Chinese  |    1.02051   .0613526     0.34   0.736     .9070758    1.148131
      Other  |   1.135211   .0662112     2.17   0.030     1.012582    1.272691
    Unknown  |   1.018534    .047082     0.40   0.691     .9303119    1.115122
             |
        male |
       Male  |   1.013255   .0184477     0.72   0.470     .9777358    1.050065
        age1 |   1.000841   .0024873     0.34   0.735     .9959781    1.005728
        age2 |   .9954075   .0090147    -0.51   0.611     .9778949    1.013234
        age3 |   1.012399   .0243558     0.51   0.608     .9657705    1.061279
             |
         imd |
          4  |   .9907408   .0228251    -0.40   0.686     .9469995    1.036502
5 most de..  |   .9746315   .0301943    -0.83   0.407     .9172127    1.035645
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,971                  Number of obs    =      66,971
No. of failures =       12,073
Time at risk    =      7021368
                                                LR chi2(22)      =       25.04
Log likelihood  =   -104770.92                  Prob > chi2      =      0.2954

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |    1.00347   .0603809     0.06   0.954     .8918376    1.129075
Other White  |   1.085586   .0640453     1.39   0.164     .9670453    1.218658
White + C..  |   1.033429   .0618759     0.55   0.583     .9189995    1.162106
White + A..  |     .95055   .0577665    -0.83   0.404     .8438127    1.070789
White + A..  |   1.114965   .0658028     1.84   0.065     .9931736    1.251691
Other mixed  |   .9918623   .0599037    -0.14   0.892      .881136    1.116503
     Indian  |   1.057894   .0629884     0.95   0.345     .9413704    1.188841
  Pakistani  |   1.088935   .0641111     1.45   0.148     .9702581    1.222127
Bangladeshi  |   1.015256   .0609515     0.25   0.801     .9025538    1.142031
Other Asian  |   1.022813   .0612685     0.38   0.706     .9095105    1.150231
  Caribbean  |   1.027086   .0614129     0.45   0.655     .9135046     1.15479
    African  |   1.123374    .065646     1.99   0.047     1.001805    1.259695
Other Black  |   1.007431   .0607028     0.12   0.902     .8952123    1.133717
    Chinese  |    1.02051   .0613526     0.34   0.736     .9070758    1.148131
      Other  |   1.135211   .0662112     2.17   0.030     1.012582    1.272691
    Unknown  |   1.018534    .047082     0.40   0.691     .9303119    1.115122
             |
        male |
       Male  |   1.013255   .0184477     0.72   0.470     .9777358    1.050065
        age1 |   1.000841   .0024873     0.34   0.735     .9959781    1.005728
        age2 |   .9954075   .0090147    -0.51   0.611     .9778949    1.013234
        age3 |   1.012399   .0243558     0.51   0.608     .9657705    1.061279
             |
         imd |
          4  |   .9907408   .0228251    -0.40   0.686     .9469995    1.036502
5 most de..  |   .9746315   .0301943    -0.83   0.407     .9172127    1.035645
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model1_ons_noncoviddeath_eth16.ster not found)
file ./output/model1_ons_noncoviddeath_eth16.ster saved
(note: file ./output/model1_ons_noncoviddeath_eth16.dta not found)
file ./output/model1_ons_noncoviddeath_eth16.dta saved

         failure _d:  ons_noncoviddeath
   analysis time _t:  (stime_ons_noncoviddeath-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,971                  Number of obs    =      66,971
No. of failures =       12,073
Time at risk    =      7021368
                                                LR chi2(54)      =       71.75
Log likelihood  =   -104747.57                  Prob > chi2      =      0.0534

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   1.004537    .060456     0.08   0.940     .8927673    1.130301
Other White  |   1.086518   .0641146     1.41   0.160     .9678499    1.219735
White + C..  |   1.034652   .0619574     0.57   0.569     .9200727    1.163499
White + A..  |   .9502343   .0577602    -0.84   0.401     .8435099    1.070462
White + A..  |   1.116678   .0659233     1.87   0.062     .9946657    1.253657
Other mixed  |   .9918328   .0599206    -0.14   0.892     .8810772    1.116511
     Indian  |   1.057108   .0629577     0.93   0.351      .940643    1.187993
  Pakistani  |   1.089162   .0641371     1.45   0.147     .9704386     1.22241
Bangladeshi  |    1.01722   .0610874     0.28   0.776     .9042692     1.14428
Other Asian  |   1.023974   .0613483     0.40   0.693     .9105247    1.151559
  Caribbean  |    1.02697   .0614168     0.44   0.656     .9133822    1.154683
    African  |   1.124213   .0657151     2.00   0.045     1.002518     1.26068
Other Black  |   1.008821   .0608096     0.15   0.884     .8964077    1.135332
    Chinese  |   1.023014   .0615167     0.38   0.705     .9092774    1.150977
      Other  |   1.135663   .0662561     2.18   0.029     1.012953    1.273238
    Unknown  |   1.019086   .0471157     0.41   0.683     .9308017    1.115745
             |
        male |
       Male  |   1.017249   .0186304     0.93   0.350      .981382    1.054427
        age1 |   1.000791   .0025714     0.31   0.758     .9957639    1.005844
        age2 |   .9954424   .0091932    -0.49   0.621     .9775861    1.013625
        age3 |   1.011742   .0247178     0.48   0.633     .9644381    1.061367
             |
         imd |
          4  |   .9912301   .0228429    -0.38   0.702     .9474549    1.037028
5 most de..  |   .9747273   .0302057    -0.83   0.409     .9172872    1.035764
             |
   bmicat_sa |
Normal (..)  |   1.003914   .0656774     0.06   0.952     .8830999    1.141257
Overweig..)  |   .9259614    .059057    -1.21   0.228     .8171541    1.049257
Obese I ..)  |   .9113453   .0571152    -1.48   0.139     .8060038    1.030454
Obese II..)  |   .9214904   .0575847    -1.31   0.191     .8152644    1.041557
Obese II..)  |   .9277225   .0570116    -1.22   0.222     .8224489    1.046471
    Unknown  |   .9313074   .0577172    -1.15   0.251     .8247841    1.051588
             |
    hba1ccat |
  >=6.5-7.4  |    1.01513   .0247637     0.62   0.538     .9677364    1.064845
  >=7.5-7.9  |   1.136015   .0415573     3.49   0.000     1.057416    1.220457
    >=8-8.9  |   1.055231   .0361061     1.57   0.116     .9867856    1.128425
        >=9  |   1.056557   .0481393     1.21   0.227     .9662961     1.15525
    Unknown  |   .9701305   .1451148    -0.20   0.839     .7236109    1.300634
             |
gp_consult~t |   .9973941   .0039418    -0.66   0.509      .989698     1.00515
             |
smoke_nomiss |
     Former  |   1.003408   .0655502     0.05   0.958     .8828166    1.140471
    Current  |   1.029599   .0284815     1.05   0.292     .9752622    1.086962
             |
1.hyperten~n |   .9483087   .0219185    -2.30   0.022     .9063077     .992256
             |
      bp_cat |
High, sta..  |   1.89e+08          .        .       .            .           .
High, sta..  |   1.85e+08   5.34e+07    65.86   0.000     1.05e+08    3.25e+08
    Unknown  |   1.87e+08   5.44e+07    65.62   0.000     1.06e+08    3.31e+08
             |
    1.asthma |   .9907493   .0461738    -0.20   0.842     .9042605     1.08551
1.~y_disease |   .9928702   .0226555    -0.31   0.754     .9494446    1.038282
1.~c_disease |   .9999303   .0227105    -0.00   0.998     .9563947    1.045448
             |
     dm_type |
       T1DM  |   1.069895   .0568494     1.27   0.204     .9640783    1.187327
       T2DM  |    1.03263   .0234046     1.42   0.157     .9877615    1.079536
 UNKNOWN_DM  |   .9621138   .0638622    -0.58   0.561     .8447463    1.095788
             |
    1.cancer |   1.014186   .0230178     0.62   0.535     .9700605    1.060318
1.~r_disease |   1.011229   .0230151     0.49   0.624     .9671119    1.057359
    1.stroke |   .9892779   .0225813    -0.47   0.637     .9459948    1.034541
  1.dementia |   1.033693    .023371     1.47   0.143     .9888865    1.080529
1.other_ne~o |   .9827665   .0224991    -0.76   0.448     .9396438    1.027868
             |
      egfr60 |
   eGFR <60  |   1.203446   .1014984     2.20   0.028     1.020085    1.419766
      1.esrf |   1.037741   .0233779     1.64   0.100     .9929183    1.084588
1.immunosu~d |   .9953659   .0189226    -0.24   0.807     .9589608    1.033153
1.ra_sle_p~s |   .9970634   .0227592    -0.13   0.897     .9534393    1.042683
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,971                  Number of obs    =      66,971
No. of failures =       12,073
Time at risk    =      7021368
                                                LR chi2(54)      =       71.75
Log likelihood  =   -104747.57                  Prob > chi2      =      0.0534

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   1.004537    .060456     0.08   0.940     .8927673    1.130301
Other White  |   1.086518   .0641146     1.41   0.160     .9678499    1.219735
White + C..  |   1.034652   .0619574     0.57   0.569     .9200727    1.163499
White + A..  |   .9502343   .0577602    -0.84   0.401     .8435099    1.070462
White + A..  |   1.116678   .0659233     1.87   0.062     .9946657    1.253657
Other mixed  |   .9918328   .0599206    -0.14   0.892     .8810772    1.116511
     Indian  |   1.057108   .0629577     0.93   0.351      .940643    1.187993
  Pakistani  |   1.089162   .0641371     1.45   0.147     .9704386     1.22241
Bangladeshi  |    1.01722   .0610874     0.28   0.776     .9042692     1.14428
Other Asian  |   1.023974   .0613483     0.40   0.693     .9105247    1.151559
  Caribbean  |    1.02697   .0614168     0.44   0.656     .9133822    1.154683
    African  |   1.124213   .0657151     2.00   0.045     1.002518     1.26068
Other Black  |   1.008821   .0608096     0.15   0.884     .8964077    1.135332
    Chinese  |   1.023014   .0615167     0.38   0.705     .9092774    1.150977
      Other  |   1.135663   .0662561     2.18   0.029     1.012953    1.273238
    Unknown  |   1.019086   .0471157     0.41   0.683     .9308017    1.115745
             |
        male |
       Male  |   1.017249   .0186304     0.93   0.350      .981382    1.054427
        age1 |   1.000791   .0025714     0.31   0.758     .9957639    1.005844
        age2 |   .9954424   .0091932    -0.49   0.621     .9775861    1.013625
        age3 |   1.011742   .0247178     0.48   0.633     .9644381    1.061367
             |
         imd |
          4  |   .9912301   .0228429    -0.38   0.702     .9474549    1.037028
5 most de..  |   .9747273   .0302057    -0.83   0.409     .9172872    1.035764
             |
   bmicat_sa |
Normal (..)  |   1.003914   .0656774     0.06   0.952     .8830999    1.141257
Overweig..)  |   .9259614    .059057    -1.21   0.228     .8171541    1.049257
Obese I ..)  |   .9113453   .0571152    -1.48   0.139     .8060038    1.030454
Obese II..)  |   .9214904   .0575847    -1.31   0.191     .8152644    1.041557
Obese II..)  |   .9277225   .0570116    -1.22   0.222     .8224489    1.046471
    Unknown  |   .9313074   .0577172    -1.15   0.251     .8247841    1.051588
             |
    hba1ccat |
  >=6.5-7.4  |    1.01513   .0247637     0.62   0.538     .9677364    1.064845
  >=7.5-7.9  |   1.136015   .0415573     3.49   0.000     1.057416    1.220457
    >=8-8.9  |   1.055231   .0361061     1.57   0.116     .9867856    1.128425
        >=9  |   1.056557   .0481393     1.21   0.227     .9662961     1.15525
    Unknown  |   .9701305   .1451148    -0.20   0.839     .7236109    1.300634
             |
gp_consult~t |   .9973941   .0039418    -0.66   0.509      .989698     1.00515
             |
smoke_nomiss |
     Former  |   1.003408   .0655502     0.05   0.958     .8828166    1.140471
    Current  |   1.029599   .0284815     1.05   0.292     .9752622    1.086962
             |
1.hyperten~n |   .9483087   .0219185    -2.30   0.022     .9063077     .992256
             |
      bp_cat |
High, sta..  |   1.89e+08          .        .       .            .           .
High, sta..  |   1.85e+08   5.34e+07    65.86   0.000     1.05e+08    3.25e+08
    Unknown  |   1.87e+08   5.44e+07    65.62   0.000     1.06e+08    3.31e+08
             |
    1.asthma |   .9907493   .0461738    -0.20   0.842     .9042605     1.08551
1.~y_disease |   .9928702   .0226555    -0.31   0.754     .9494446    1.038282
1.~c_disease |   .9999303   .0227105    -0.00   0.998     .9563947    1.045448
             |
     dm_type |
       T1DM  |   1.069895   .0568494     1.27   0.204     .9640783    1.187327
       T2DM  |    1.03263   .0234046     1.42   0.157     .9877615    1.079536
 UNKNOWN_DM  |   .9621138   .0638622    -0.58   0.561     .8447463    1.095788
             |
    1.cancer |   1.014186   .0230178     0.62   0.535     .9700605    1.060318
1.~r_disease |   1.011229   .0230151     0.49   0.624     .9671119    1.057359
    1.stroke |   .9892779   .0225813    -0.47   0.637     .9459948    1.034541
  1.dementia |   1.033693    .023371     1.47   0.143     .9888865    1.080529
1.other_ne~o |   .9827665   .0224991    -0.76   0.448     .9396438    1.027868
             |
      egfr60 |
   eGFR <60  |   1.203446   .1014984     2.20   0.028     1.020085    1.419766
      1.esrf |   1.037741   .0233779     1.64   0.100     .9929183    1.084588
1.immunosu~d |   .9953659   .0189226    -0.24   0.807     .9589608    1.033153
1.ra_sle_p~s |   .9970634   .0227592    -0.13   0.897     .9534393    1.042683
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model2_ons_noncoviddeath_eth16.ster not found)
file ./output/model2_ons_noncoviddeath_eth16.ster saved
(note: file ./output/model2_ons_noncoviddeath_eth16.dta not found)
file ./output/model2_ons_noncoviddeath_eth16.dta saved

         failure _d:  ons_noncoviddeath
   analysis time _t:  (stime_ons_noncoviddeath-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,971                  Number of obs    =      66,971
No. of failures =       12,073
Time at risk    =      7021368
                                                LR chi2(56)      =       71.92
Log likelihood  =   -104747.48                  Prob > chi2      =      0.0745

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   1.004549   .0604567     0.08   0.940     .8927774    1.130313
Other White  |   1.086469   .0641119     1.41   0.160     .9678065    1.219681
White + C..  |   1.034662   .0619583     0.57   0.569     .9200811    1.163511
White + A..  |   .9501699   .0577568    -0.84   0.400     .8434519    1.070391
White + A..  |   1.116793   .0659309     1.87   0.061     .9947666    1.253788
Other mixed  |   .9918774   .0599235    -0.13   0.893     .8811164    1.116562
     Indian  |   1.057058   .0629556     0.93   0.351     .9405969    1.187939
  Pakistani  |   1.089174   .0641378     1.45   0.147     .9704495    1.222424
Bangladeshi  |   1.017386   .0610987     0.29   0.774     .9044141     1.14447
Other Asian  |   1.023976   .0613485     0.40   0.693     .9105262    1.151561
  Caribbean  |   1.027051    .061422     0.45   0.655      .913454    1.154775
    African  |    1.12421   .0657153     2.00   0.045     1.002514    1.260678
Other Black  |   1.008796   .0608086     0.15   0.884     .8963842    1.135304
    Chinese  |   1.023041   .0615187     0.38   0.705     .9093012    1.151009
      Other  |   1.135609   .0662539     2.18   0.029     1.012903     1.27318
    Unknown  |   1.019091    .047116     0.41   0.683     .9308057     1.11575
             |
        male |
       Male  |   1.017247   .0186305     0.93   0.350     .9813797    1.054426
        age1 |   1.000791   .0025714     0.31   0.758     .9957642    1.005844
        age2 |   .9954355   .0091933    -0.50   0.620      .977579    1.013618
        age3 |   1.011762   .0247188     0.48   0.632     .9644554    1.061388
             |
         imd |
          4  |   .9912445   .0228434    -0.38   0.703     .9474684    1.037043
5 most de..  |   .9746933   .0302048    -0.83   0.408      .917255    1.035729
             |
   bmicat_sa |
Normal (..)  |   1.004002   .0656842     0.06   0.951     .8831757    1.141359
Overweig..)  |   .9261327   .0590703    -1.20   0.229     .8173012    1.049456
Obese I ..)  |   .9114719   .0571245    -1.48   0.139     .8061134    1.030601
Obese II..)  |    .921622   .0575949    -1.31   0.192     .8153774     1.04171
Obese II..)  |   .9278801   .0570234    -1.22   0.223     .8225851    1.046653
    Unknown  |   .9314181   .0577252    -1.15   0.252     .8248802    1.051716
             |
    hba1ccat |
  >=6.5-7.4  |    1.01515   .0247646     0.62   0.538     .9677542    1.064867
  >=7.5-7.9  |   1.136004    .041558     3.49   0.000     1.057403    1.220447
    >=8-8.9  |   1.055174   .0361044     1.57   0.117     .9867311    1.128364
        >=9  |   1.056579   .0481406     1.21   0.227     .9663154    1.155274
    Unknown  |   .9701872   .1451246    -0.20   0.840     .7236512    1.300714
             |
gp_consult~t |   .9974055    .003942    -0.66   0.511     .9897092    1.005162
             |
smoke_nomiss |
     Former  |   1.003554   .0655608     0.05   0.957     .8829435     1.14064
    Current  |   1.029605   .0284817     1.05   0.292     .9752686     1.08697
             |
1.hyperten~n |   .9482751    .021918    -2.30   0.022     .9062753    .9922215
             |
      bp_cat |
High, sta..  |   1.89e+08          .        .       .            .           .
High, sta..  |   1.85e+08   5.34e+07    65.86   0.000     1.05e+08    3.25e+08
    Unknown  |   1.87e+08   5.44e+07    65.62   0.000     1.06e+08    3.31e+08
             |
    1.asthma |   .9905969   .0461682    -0.20   0.839     .9041187    1.085347
1.~y_disease |   .9928443   .0226549    -0.31   0.753     .9494197    1.038255
1.~c_disease |   .9998332   .0227096    -0.01   0.994     .9562994    1.045349
             |
     dm_type |
       T1DM  |   1.069619   .0568397     1.27   0.205     .9638209    1.187032
       T2DM  |   1.032627   .0234047     1.42   0.157      .987759    1.079534
 UNKNOWN_DM  |   .9619965   .0638551    -0.58   0.559     .8446421    1.095656
             |
    1.cancer |   1.014209   .0230185     0.62   0.534     .9700821    1.060343
1.~r_disease |   1.011215   .0230148     0.49   0.624     .9670978    1.057344
    1.stroke |   .9892688   .0225811    -0.47   0.636      .945986    1.034532
  1.dementia |   1.033707   .0233714     1.47   0.143     .9889004    1.080545
1.other_ne~o |   .9828017      .0225    -0.76   0.449     .9396772    1.027905
             |
      egfr60 |
   eGFR <60  |   1.203385    .101493     2.20   0.028     1.020034    1.419694
      1.esrf |   1.037794   .0233795     1.65   0.100     .9929683    1.084644
1.immunosu~d |   .9952904   .0189221    -0.25   0.804     .9588862    1.033077
1.ra_sle_p~s |   .9970052   .0227584    -0.13   0.895     .9533827    1.042624
             |
hh_total_cat |
       6-10  |   1.010535   .0619961     0.17   0.864     .8960457    1.139652
        11+  |   1.107543   .2697134     0.42   0.675     .6871827    1.785043
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model3_ons_noncoviddeath_eth16.ster not found)
file ./output/model3_ons_noncoviddeath_eth16.ster saved
(note: file ./output/model3_ons_noncoviddeath_eth16.dta not found)
file ./output/model3_ons_noncoviddeath_eth16.dta saved
(output written to ./output/estout_table2_eth16.txt)
onsdeath
(11,780 observations deleted)

         failure _d:  onsdeath
   analysis time _t:  (stime_onsdeath-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,971                  Number of obs    =      66,971
No. of failures =       16,100
Time at risk    =      7021368
                                                LR chi2(16)      =       25.81
Log likelihood  =   -139726.96                  Prob > chi2      =      0.0568

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   1.045702   .0543903     0.86   0.390     .9443526    1.157928
Other White  |   1.096851   .0563744     1.80   0.072     .9917426      1.2131
White + C..  |   1.061722   .0551509     1.15   0.249     .9589485     1.17551
White + A..  |   .9605193   .0508505    -0.76   0.447     .8658506    1.065539
White + A..  |   1.122172   .0577409     2.24   0.025     1.014522    1.241246
Other mixed  |   1.015187   .0532315     0.29   0.774     .9160375    1.125069
     Indian  |   1.074474   .0556551     1.39   0.166     .9707461    1.189285
  Pakistani  |   1.102241   .0565098     1.90   0.058     .9968666    1.218754
Bangladeshi  |   1.063721   .0551308     1.19   0.233     .9609738    1.177454
Other Asian  |    1.04193   .0542666     0.79   0.430     .9408184    1.153909
  Caribbean  |   1.016214    .053212     0.31   0.759      .917094    1.126048
    African  |   1.126408   .0574419     2.33   0.020     1.019267     1.24481
Other Black  |   1.029311   .0538797     0.55   0.581     .9289457    1.140521
    Chinese  |   1.064853   .0553347     1.21   0.227     .9617392    1.179023
      Other  |   1.134618   .0578121     2.48   0.013     1.026783    1.253779
    Unknown  |   1.038879   .0418731     0.95   0.344      .959967    1.124277
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/crude_onsdeath_eth16.ster not found)
file ./output/crude_onsdeath_eth16.ster saved
(note: file ./output/crude_onsdeath_eth16.dta not found)
file ./output/crude_onsdeath_eth16.dta saved

         failure _d:  onsdeath
   analysis time _t:  (stime_onsdeath-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,971                  Number of obs    =      66,971
No. of failures =       16,100
Time at risk    =      7021368
                                                LR chi2(20)      =       27.55
Log likelihood  =   -139726.09                  Prob > chi2      =      0.1204

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   1.045675   .0543898     0.86   0.391     .9443262      1.1579
Other White  |   1.097019   .0563841     1.80   0.072     .9918923    1.213288
White + C..  |   1.061373   .0551352     1.15   0.252     .9586287    1.175128
White + A..  |    .960122   .0508305    -0.77   0.442     .8654906      1.0651
White + A..  |   1.121947   .0577314     2.24   0.025     1.014314    1.241001
Other mixed  |   1.015102    .053228     0.29   0.775      .915959    1.124977
     Indian  |   1.074477   .0556595     1.39   0.166     .9707415    1.189298
  Pakistani  |   1.101805   .0564908     1.89   0.059     .9964665    1.218279
Bangladeshi  |   1.063812   .0551363     1.19   0.233     .9610541    1.177556
Other Asian  |   1.041884   .0542662     0.79   0.431     .9407727    1.153862
  Caribbean  |   1.016097   .0532061     0.30   0.760     .9169878    1.125918
    African  |   1.126755   .0574619     2.34   0.019     1.019577    1.245199
Other Black  |   1.029306   .0538801     0.55   0.581       .92894    1.140517
    Chinese  |   1.064981   .0553424     1.21   0.226     .9618528    1.179166
      Other  |   1.134609   .0578122     2.48   0.013     1.026773     1.25377
    Unknown  |   1.038974   .0418778     0.95   0.343     .9600531    1.124382
             |
        male |
       Male  |   .9987858   .0157478    -0.08   0.939     .9683927    1.030133
        age1 |   1.001074   .0021525     0.50   0.618     .9968642    1.005302
        age2 |   .9939703   .0077915    -0.77   0.440      .978816    1.009359
        age3 |   1.016173    .021166     0.77   0.441     .9755236    1.058516
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model0_onsdeath_eth16.ster not found)
file ./output/model0_onsdeath_eth16.ster saved
(note: file ./output/model0_onsdeath_eth16.dta not found)
file ./output/model0_onsdeath_eth16.dta saved

         failure _d:  onsdeath
   analysis time _t:  (stime_onsdeath-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,971                  Number of obs    =      66,971
No. of failures =       16,100
Time at risk    =      7021368
                                                LR chi2(22)      =       31.01
Log likelihood  =   -139724.36                  Prob > chi2      =      0.0959

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   1.046161    .054416     0.87   0.386     .9447639     1.15844
Other White  |   1.097405   .0564045     1.81   0.071     .9922401    1.213716
White + C..  |   1.061554   .0551447     1.15   0.250     .9587927     1.17533
White + A..  |   .9598485   .0508165    -0.77   0.439     .8652433    1.064798
White + A..  |   1.122904   .0577836     2.25   0.024     1.015174    1.242066
Other mixed  |   1.015479   .0532482     0.29   0.770     .9162982    1.125395
     Indian  |   1.074685   .0556706     1.39   0.164     .9709291    1.189529
  Pakistani  |    1.10238   .0565211     1.90   0.057     .9969847    1.218916
Bangladeshi  |   1.063963   .0551447     1.20   0.232     .9611903    1.177725
Other Asian  |   1.041742   .0542589     0.79   0.432     .9406448    1.153705
  Caribbean  |   1.016499   .0532278     0.31   0.755     .9173497    1.126365
    African  |   1.127156   .0574828     2.35   0.019     1.019939    1.245643
Other Black  |    1.02952   .0538922     0.56   0.578     .9291311    1.140755
    Chinese  |   1.064625   .0553242     1.21   0.228      .961531    1.178773
      Other  |   1.134779   .0578209     2.48   0.013     1.026927    1.253957
    Unknown  |   1.039168   .0418864     0.95   0.341     .9602312    1.124594
             |
        male |
       Male  |   .9988795   .0157494    -0.07   0.943     .9684833     1.03023
        age1 |   1.001114   .0021526     0.52   0.605     .9969034    1.005341
        age2 |   .9938204   .0077904    -0.79   0.429     .9786682    1.009207
        age3 |   1.016572   .0211747     0.79   0.430      .975906    1.058932
             |
         imd |
          4  |   .9817816    .019618    -0.92   0.357     .9440743    1.020995
5 most de..  |    .954189   .0257902    -1.73   0.083     .9049567      1.0061
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,971                  Number of obs    =      66,971
No. of failures =       16,100
Time at risk    =      7021368
                                                LR chi2(22)      =       31.01
Log likelihood  =   -139724.36                  Prob > chi2      =      0.0959

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   1.046161    .054416     0.87   0.386     .9447639     1.15844
Other White  |   1.097405   .0564045     1.81   0.071     .9922401    1.213716
White + C..  |   1.061554   .0551447     1.15   0.250     .9587927     1.17533
White + A..  |   .9598485   .0508165    -0.77   0.439     .8652433    1.064798
White + A..  |   1.122904   .0577836     2.25   0.024     1.015174    1.242066
Other mixed  |   1.015479   .0532482     0.29   0.770     .9162982    1.125395
     Indian  |   1.074685   .0556706     1.39   0.164     .9709291    1.189529
  Pakistani  |    1.10238   .0565211     1.90   0.057     .9969847    1.218916
Bangladeshi  |   1.063963   .0551447     1.20   0.232     .9611903    1.177725
Other Asian  |   1.041742   .0542589     0.79   0.432     .9406448    1.153705
  Caribbean  |   1.016499   .0532278     0.31   0.755     .9173497    1.126365
    African  |   1.127156   .0574828     2.35   0.019     1.019939    1.245643
Other Black  |    1.02952   .0538922     0.56   0.578     .9291311    1.140755
    Chinese  |   1.064625   .0553242     1.21   0.228      .961531    1.178773
      Other  |   1.134779   .0578209     2.48   0.013     1.026927    1.253957
    Unknown  |   1.039168   .0418864     0.95   0.341     .9602312    1.124594
             |
        male |
       Male  |   .9988795   .0157494    -0.07   0.943     .9684833     1.03023
        age1 |   1.001114   .0021526     0.52   0.605     .9969034    1.005341
        age2 |   .9938204   .0077904    -0.79   0.429     .9786682    1.009207
        age3 |   1.016572   .0211747     0.79   0.430      .975906    1.058932
             |
         imd |
          4  |   .9817816    .019618    -0.92   0.357     .9440743    1.020995
5 most de..  |    .954189   .0257902    -1.73   0.083     .9049567      1.0061
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model1_onsdeath_eth16.ster not found)
file ./output/model1_onsdeath_eth16.ster saved
(note: file ./output/model1_onsdeath_eth16.dta not found)
file ./output/model1_onsdeath_eth16.dta saved

         failure _d:  onsdeath
   analysis time _t:  (stime_onsdeath-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,971                  Number of obs    =      66,971
No. of failures =       16,100
Time at risk    =      7021368
                                                LR chi2(54)      =       81.44
Log likelihood  =   -139699.15                  Prob > chi2      =      0.0093

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   1.046866   .0544623     0.88   0.379     .9453836    1.159242
Other White  |   1.096467   .0563687     1.79   0.073     .9913702    1.212706
White + C..  |     1.0622   .0551855     1.16   0.245     .9593635    1.176061
White + A..  |   .9583979   .0507506    -0.80   0.422     .8639163    1.063212
White + A..  |   1.123259   .0578184     2.26   0.024     1.015465    1.242494
Other mixed  |   1.014812   .0532295     0.28   0.779      .915668    1.124692
     Indian  |   1.073804   .0556389     1.37   0.169      .970108    1.188584
  Pakistani  |   1.100806   .0564515     1.87   0.061      .995542    1.217201
Bangladeshi  |   1.064641   .0551958     1.21   0.227     .9617741     1.17851
Other Asian  |   1.043299   .0543487     0.81   0.416     .9420353    1.155449
  Caribbean  |   1.015351   .0531767     0.29   0.771     .9162975    1.125112
    African  |   1.126418   .0574626     2.33   0.020     1.019241    1.244865
Other Black  |   1.030127   .0539435     0.57   0.571     .9296438     1.14147
    Chinese  |   1.066101   .0554131     1.23   0.218     .9628426    1.180434
      Other  |    1.13453   .0578235     2.48   0.013     1.026675    1.253716
    Unknown  |    1.03871    .041875     0.94   0.346     .9597957    1.124114
             |
        male |
       Male  |   1.002749    .015902     0.17   0.863     .9720606    1.034405
        age1 |   1.001233   .0022254     0.55   0.579     .9968813    1.005605
        age2 |   .9933893   .0079402    -0.83   0.407      .977948    1.009074
        age3 |   1.017105   .0215132     0.80   0.423     .9758016    1.060156
             |
         imd |
          4  |   .9820058    .019628    -0.91   0.364     .9442793    1.021239
5 most de..  |   .9540759   .0257943    -1.74   0.082     .9048361    1.005995
             |
   bmicat_sa |
Normal (..)  |   1.030101   .0598342     0.51   0.610     .9192574     1.15431
Overweig..)  |   .9791642   .0553448    -0.37   0.710      .876483    1.093875
Obese I ..)  |    .959393   .0533438    -0.75   0.456     .8603366    1.069854
Obese II..)  |   .9804093   .0543275    -0.36   0.721     .8795077    1.092887
Obese II..)  |   .9911804     .05405    -0.16   0.871     .8907092    1.102985
    Unknown  |   .9886624   .0543625    -0.21   0.836     .8876544    1.101164
             |
    hba1ccat |
  >=6.5-7.4  |   .9953441   .0211121    -0.22   0.826     .9548135    1.037595
  >=7.5-7.9  |   1.087109   .0349999     2.59   0.009      1.02063    1.157918
    >=8-8.9  |    1.04872   .0310453     1.61   0.108     .9896042    1.111368
        >=9  |   1.051604   .0414191     1.28   0.201     .9734782       1.136
    Unknown  |   .9760331      .1254    -0.19   0.850     .7587571    1.255528
             |
gp_consult~t |   .9949527   .0034095    -1.48   0.140     .9882926    1.001658
             |
smoke_nomiss |
     Former  |   .9950374   .0565548    -0.09   0.930      .890143    1.112293
    Current  |    1.03964   .0248123     1.63   0.103     .9921287    1.089427
             |
1.hyperten~n |   .9556907   .0190826    -2.27   0.023     .9190119    .9938334
             |
      bp_cat |
High, sta..  |   7.86e+07          .        .       .            .           .
High, sta..  |   6.79e+07   1.60e+07    76.42   0.000     4.28e+07    1.08e+08
    Unknown  |   6.89e+07   1.63e+07    76.10   0.000     4.33e+07    1.10e+08
             |
    1.asthma |    .977795   .0397331    -0.55   0.581       .90294    1.058856
1.~y_disease |   1.017983   .0199689     0.91   0.364     .9795875    1.057883
1.~c_disease |   1.018932   .0199286     0.96   0.338     .9806114    1.058749
             |
     dm_type |
       T1DM  |   1.091145   .0497289     1.91   0.056     .9979047    1.193098
       T2DM  |   1.028551   .0202201     1.43   0.152      .989674    1.068955
 UNKNOWN_DM  |   .9905652   .0561273    -0.17   0.867     .8864462    1.106914
             |
    1.cancer |   1.025918   .0200966     1.31   0.191     .9872761    1.066073
1.~r_disease |   1.023246   .0200946     1.17   0.242     .9846099    1.063399
    1.stroke |   1.012679   .0198768     0.64   0.521     .9744607    1.052396
  1.dementia |   1.040019   .0203256     2.01   0.045     1.000934    1.080629
1.other_ne~o |   .9846763   .0195104    -0.78   0.436     .9471696    1.023668
             |
      egfr60 |
   eGFR <60  |   1.185126   .0870477     2.31   0.021     1.026228    1.368628
      1.esrf |    1.01862    .019982     0.94   0.347     .9801997    1.058547
1.immunosu~d |   .9950212   .0163813    -0.30   0.762     .9634268    1.027652
1.ra_sle_p~s |   1.012633   .0199275     0.64   0.524      .974319    1.052453
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,971                  Number of obs    =      66,971
No. of failures =       16,100
Time at risk    =      7021368
                                                LR chi2(54)      =       81.44
Log likelihood  =   -139699.15                  Prob > chi2      =      0.0093

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   1.046866   .0544623     0.88   0.379     .9453836    1.159242
Other White  |   1.096467   .0563687     1.79   0.073     .9913702    1.212706
White + C..  |     1.0622   .0551855     1.16   0.245     .9593635    1.176061
White + A..  |   .9583979   .0507506    -0.80   0.422     .8639163    1.063212
White + A..  |   1.123259   .0578184     2.26   0.024     1.015465    1.242494
Other mixed  |   1.014812   .0532295     0.28   0.779      .915668    1.124692
     Indian  |   1.073804   .0556389     1.37   0.169      .970108    1.188584
  Pakistani  |   1.100806   .0564515     1.87   0.061      .995542    1.217201
Bangladeshi  |   1.064641   .0551958     1.21   0.227     .9617741     1.17851
Other Asian  |   1.043299   .0543487     0.81   0.416     .9420353    1.155449
  Caribbean  |   1.015351   .0531767     0.29   0.771     .9162975    1.125112
    African  |   1.126418   .0574626     2.33   0.020     1.019241    1.244865
Other Black  |   1.030127   .0539435     0.57   0.571     .9296438     1.14147
    Chinese  |   1.066101   .0554131     1.23   0.218     .9628426    1.180434
      Other  |    1.13453   .0578235     2.48   0.013     1.026675    1.253716
    Unknown  |    1.03871    .041875     0.94   0.346     .9597957    1.124114
             |
        male |
       Male  |   1.002749    .015902     0.17   0.863     .9720606    1.034405
        age1 |   1.001233   .0022254     0.55   0.579     .9968813    1.005605
        age2 |   .9933893   .0079402    -0.83   0.407      .977948    1.009074
        age3 |   1.017105   .0215132     0.80   0.423     .9758016    1.060156
             |
         imd |
          4  |   .9820058    .019628    -0.91   0.364     .9442793    1.021239
5 most de..  |   .9540759   .0257943    -1.74   0.082     .9048361    1.005995
             |
   bmicat_sa |
Normal (..)  |   1.030101   .0598342     0.51   0.610     .9192574     1.15431
Overweig..)  |   .9791642   .0553448    -0.37   0.710      .876483    1.093875
Obese I ..)  |    .959393   .0533438    -0.75   0.456     .8603366    1.069854
Obese II..)  |   .9804093   .0543275    -0.36   0.721     .8795077    1.092887
Obese II..)  |   .9911804     .05405    -0.16   0.871     .8907092    1.102985
    Unknown  |   .9886624   .0543625    -0.21   0.836     .8876544    1.101164
             |
    hba1ccat |
  >=6.5-7.4  |   .9953441   .0211121    -0.22   0.826     .9548135    1.037595
  >=7.5-7.9  |   1.087109   .0349999     2.59   0.009      1.02063    1.157918
    >=8-8.9  |    1.04872   .0310453     1.61   0.108     .9896042    1.111368
        >=9  |   1.051604   .0414191     1.28   0.201     .9734782       1.136
    Unknown  |   .9760331      .1254    -0.19   0.850     .7587571    1.255528
             |
gp_consult~t |   .9949527   .0034095    -1.48   0.140     .9882926    1.001658
             |
smoke_nomiss |
     Former  |   .9950374   .0565548    -0.09   0.930      .890143    1.112293
    Current  |    1.03964   .0248123     1.63   0.103     .9921287    1.089427
             |
1.hyperten~n |   .9556907   .0190826    -2.27   0.023     .9190119    .9938334
             |
      bp_cat |
High, sta..  |   7.86e+07          .        .       .            .           .
High, sta..  |   6.79e+07   1.60e+07    76.42   0.000     4.28e+07    1.08e+08
    Unknown  |   6.89e+07   1.63e+07    76.10   0.000     4.33e+07    1.10e+08
             |
    1.asthma |    .977795   .0397331    -0.55   0.581       .90294    1.058856
1.~y_disease |   1.017983   .0199689     0.91   0.364     .9795875    1.057883
1.~c_disease |   1.018932   .0199286     0.96   0.338     .9806114    1.058749
             |
     dm_type |
       T1DM  |   1.091145   .0497289     1.91   0.056     .9979047    1.193098
       T2DM  |   1.028551   .0202201     1.43   0.152      .989674    1.068955
 UNKNOWN_DM  |   .9905652   .0561273    -0.17   0.867     .8864462    1.106914
             |
    1.cancer |   1.025918   .0200966     1.31   0.191     .9872761    1.066073
1.~r_disease |   1.023246   .0200946     1.17   0.242     .9846099    1.063399
    1.stroke |   1.012679   .0198768     0.64   0.521     .9744607    1.052396
  1.dementia |   1.040019   .0203256     2.01   0.045     1.000934    1.080629
1.other_ne~o |   .9846763   .0195104    -0.78   0.436     .9471696    1.023668
             |
      egfr60 |
   eGFR <60  |   1.185126   .0870477     2.31   0.021     1.026228    1.368628
      1.esrf |    1.01862    .019982     0.94   0.347     .9801997    1.058547
1.immunosu~d |   .9950212   .0163813    -0.30   0.762     .9634268    1.027652
1.ra_sle_p~s |   1.012633   .0199275     0.64   0.524      .974319    1.052453
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model2_onsdeath_eth16.ster not found)
file ./output/model2_onsdeath_eth16.ster saved
(note: file ./output/model2_onsdeath_eth16.dta not found)
file ./output/model2_onsdeath_eth16.dta saved

         failure _d:  onsdeath
   analysis time _t:  (stime_onsdeath-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,971                  Number of obs    =      66,971
No. of failures =       16,100
Time at risk    =      7021368
                                                LR chi2(56)      =       81.65
Log likelihood  =   -139699.05                  Prob > chi2      =      0.0143

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   1.046877   .0544629     0.88   0.379     .9453933    1.159254
Other White  |   1.096425   .0563667     1.79   0.073     .9913318    1.212659
White + C..  |   1.062222   .0551869     1.16   0.245     .9593826    1.176085
White + A..  |    .958355   .0507488    -0.80   0.422     .8638769    1.063166
White + A..  |   1.123374    .057825     2.26   0.024     1.015569    1.242623
Other mixed  |   1.014844   .0532313     0.28   0.779     .9156958    1.124727
     Indian  |   1.073785   .0556388     1.37   0.169     .9700896    1.188565
  Pakistani  |   1.100821   .0564522     1.87   0.061      .995555    1.217216
Bangladeshi  |   1.064804   .0552055     1.21   0.226     .9619186    1.178693
Other Asian  |   1.043304    .054349     0.81   0.416     .9420393    1.155454
  Caribbean  |   1.015419   .0531805     0.29   0.770     .9163586    1.125189
    African  |   1.126434   .0574637     2.33   0.020     1.019254    1.244883
Other Black  |   1.030118   .0539436     0.57   0.571     .9296349    1.141461
    Chinese  |   1.066113    .055414     1.23   0.218     .9628522    1.180447
      Other  |   1.134508   .0578233     2.48   0.013     1.026653    1.253693
    Unknown  |   1.038714   .0418752     0.94   0.346     .9597987    1.124117
             |
        male |
       Male  |   1.002754   .0159022     0.17   0.862     .9720659    1.034411
        age1 |   1.001233   .0022254     0.55   0.579     .9968809    1.005604
        age2 |   .9933855   .0079403    -0.83   0.406      .977944    1.009071
        age3 |   1.017115   .0215139     0.80   0.422     .9758112    1.060168
             |
         imd |
          4  |   .9820117   .0196283    -0.91   0.364     .9442848    1.021246
5 most de..  |   .9540422   .0257935    -1.74   0.082     .9048039     1.00596
             |
   bmicat_sa |
Normal (..)  |   1.030213   .0598416     0.51   0.608     .9193553    1.154437
Overweig..)  |   .9793614   .0553581    -0.37   0.712     .8766556      1.0941
Obese I ..)  |   .9595358   .0533529    -0.74   0.458     .8604625    1.070016
Obese II..)  |   .9805711   .0543383    -0.35   0.723     .8796497    1.093071
Obese II..)  |   .9913601   .0540616    -0.16   0.874     .8908674    1.103189
    Unknown  |   .9887962    .054371    -0.20   0.838     .8877726    1.101316
             |
    hba1ccat |
  >=6.5-7.4  |   .9953732   .0211131    -0.22   0.827     .9548406    1.037626
  >=7.5-7.9  |   1.087124   .0350013     2.59   0.009     1.020642    1.157936
    >=8-8.9  |    1.04866   .0310439     1.60   0.108     .9895462    1.111304
        >=9  |   1.051641   .0414209     1.28   0.201     .9735114     1.13604
    Unknown  |   .9761372   .1254145    -0.19   0.851     .7588364    1.255664
             |
gp_consult~t |   .9949626   .0034096    -1.47   0.141     .9883023    1.001668
             |
smoke_nomiss |
     Former  |   .9951767   .0565636    -0.09   0.932      .890266     1.11245
    Current  |    1.03965   .0248126     1.63   0.103     .9921383    1.089437
             |
1.hyperten~n |   .9556642   .0190823    -2.27   0.023      .918986    .9938062
             |
      bp_cat |
High, sta..  |   7.87e+07          .        .       .            .           .
High, sta..  |   6.79e+07   1.60e+07    76.42   0.000     4.28e+07    1.08e+08
    Unknown  |   6.89e+07   1.63e+07    76.10   0.000     4.33e+07    1.10e+08
             |
    1.asthma |   .9776566   .0397288    -0.56   0.578     .9028097    1.058709
1.~y_disease |   1.017957   .0199684     0.91   0.364     .9795627    1.057857
1.~c_disease |   1.018849   .0199281     0.95   0.340     .9805298    1.058666
             |
     dm_type |
       T1DM  |    1.09087   .0497206     1.91   0.056      .997646    1.192806
       T2DM  |   1.028541     .02022     1.43   0.152     .9896644    1.068945
 UNKNOWN_DM  |   .9904478   .0561213    -0.17   0.865       .88634    1.106784
             |
    1.cancer |   1.025944   .0200973     1.31   0.191     .9873009      1.0661
1.~r_disease |   1.023236   .0200945     1.17   0.242     .9846001    1.063388
    1.stroke |   1.012672   .0198767     0.64   0.521     .9744541    1.052389
  1.dementia |   1.040031   .0203259     2.01   0.045     1.000946    1.080642
1.other_ne~o |    .984709   .0195112    -0.78   0.437     .9472007    1.023703
             |
      egfr60 |
   eGFR <60  |   1.185074   .0870436     2.31   0.021     1.026183    1.368567
      1.esrf |   1.018668   .0199832     0.94   0.346      .980245    1.058597
1.immunosu~d |   .9949583   .0163811    -0.31   0.759     .9633644    1.027588
1.ra_sle_p~s |   1.012583    .019927     0.64   0.525     .9742704    1.052402
             |
hh_total_cat |
       6-10  |   1.004686   .0532126     0.09   0.930     .9056217    1.114586
        11+  |   1.100922   .2321364     0.46   0.648     .7282416    1.664324
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model3_onsdeath_eth16.ster not found)
file ./output/model3_onsdeath_eth16.ster saved
(note: file ./output/model3_onsdeath_eth16.dta not found)
file ./output/model3_onsdeath_eth16.dta saved
(output written to ./output/estout_table2_eth16.txt)

. 
. file close tablecontent

. 
. ************************************************create forestplot dataset
. dsconcat `hr'

. duplicates drop

Duplicates in terms of all variables

(0 observations are duplicates)

. split idstr, p(_)
variables created as string: 
idstr1  idstr2  idstr3  idstr4

. ren idstr1 model

. ren idstr2 outcome

. drop idstr idstr3

. tab model

      model |      Freq.     Percent        Cum.
------------+-----------------------------------
      crude |        119        7.76        7.76
     model0 |        154       10.05       17.81
     model1 |        175       11.42       29.22
     model2 |        532       34.70       63.93
     model3 |        553       36.07      100.00
------------+-----------------------------------
      Total |      1,533      100.00

. 
. *save dataset for later
. outsheet using ./output/FP_multivariable_eth16.txt, replace
(note: file ./output/FP_multivariable_eth16.txt not found)

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/logs/04a_eth_an_multivariable_eth16.log
  log type:  text
 closed on:   5 May 2021, 17:50:47
-------------------------------------------------------------------------------
