-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/04b_eth_an_multivariable_eth5.log
  log type:  text
 opened on:   5 May 2021, 17:35:07

. cap file close tablecontent

. file open tablecontent using ./output/table2_eth5.txt, write text replace
(note: file ./output/table2_eth5.txt not found)

. 
. file write tablecontent ("Table 2: Association between ethnicity in 5 categor
> ies and COVID-19 outcomes - No care homes") _n

. file write tablecontent _tab ("Denominator") _tab ("Event") _tab ("Total pers
> on-weeks") _tab ("Rate per 1,000") _tab ("Crude") _tab _tab ("Age/Sex Adjuste
> d") _tab _tab ("Age/Sex/IMD Adjusted") _tab _tab      ("plus co-morbidities")
>  _tab _tab       ("plus hh size")  _tab _tab  _n

. file write tablecontent _tab _tab _tab _tab _tab   ("HR") _tab ("95% CI") _ta
> b ("HR") _tab ("95% CI") _tab ("HR") _tab ("95% CI") _tab ("HR") _tab ("95% C
> I") _tab ("HR") _tab ("95% CI") _tab _tab _n

. 
. 
. 
. foreach i of global outcomes {
  2. use ./output/analysis_dataset_STSET_`i'.dta, clear
  3. drop if carehome==1
  4. safetab eth5 `i', missing row
  5. } //end outcomes
(11,780 observations deleted)

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

      Eth 5 |    outcome tested
 categories |         0          1 |     Total
------------+----------------------+----------
      White |     3,310      6,688 |     9,998 
            |     33.11      66.89 |    100.00 
------------+----------------------+----------
South Asian |     3,373      6,778 |    10,151 
            |     33.23      66.77 |    100.00 
------------+----------------------+----------
      Black |     3,152      6,654 |     9,806 
            |     32.14      67.86 |    100.00 
------------+----------------------+----------
      Mixed |     3,308      6,847 |    10,155 
            |     32.58      67.42 |    100.00 
------------+----------------------+----------
      Other |     3,160      6,944 |    10,104 
            |     31.27      68.73 |    100.00 
------------+----------------------+----------
    Unknown |     5,299     11,458 |    16,757 
            |     31.62      68.38 |    100.00 
------------+----------------------+----------
      Total |    21,602     45,369 |    66,971 
            |     32.26      67.74 |    100.00 
(11,780 observations deleted)

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

      Eth 5 | outcome positivetest
 categories |         0          1 |     Total
------------+----------------------+----------
      White |     3,294      6,704 |     9,998 
            |     32.95      67.05 |    100.00 
------------+----------------------+----------
South Asian |     3,171      6,980 |    10,151 
            |     31.24      68.76 |    100.00 
------------+----------------------+----------
      Black |     3,223      6,583 |     9,806 
            |     32.87      67.13 |    100.00 
------------+----------------------+----------
      Mixed |     3,275      6,880 |    10,155 
            |     32.25      67.75 |    100.00 
------------+----------------------+----------
      Other |     3,292      6,812 |    10,104 
            |     32.58      67.42 |    100.00 
------------+----------------------+----------
    Unknown |     5,396     11,361 |    16,757 
            |     32.20      67.80 |    100.00 
------------+----------------------+----------
      Total |    21,651     45,320 |    66,971 
            |     32.33      67.67 |    100.00 
(11,780 observations deleted)

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

      Eth 5 |      outcome hes
 categories |         0          1 |     Total
------------+----------------------+----------
      White |     7,863      2,135 |     9,998 
            |     78.65      21.35 |    100.00 
------------+----------------------+----------
South Asian |     7,989      2,162 |    10,151 
            |     78.70      21.30 |    100.00 
------------+----------------------+----------
      Black |     7,765      2,041 |     9,806 
            |     79.19      20.81 |    100.00 
------------+----------------------+----------
      Mixed |     7,960      2,195 |    10,155 
            |     78.39      21.61 |    100.00 
------------+----------------------+----------
      Other |     8,013      2,091 |    10,104 
            |     79.31      20.69 |    100.00 
------------+----------------------+----------
    Unknown |    13,205      3,552 |    16,757 
            |     78.80      21.20 |    100.00 
------------+----------------------+----------
      Total |    52,795     14,176 |    66,971 
            |     78.83      21.17 |    100.00 
(11,780 observations deleted)

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

      Eth 5 |      outcome icu
 categories |         0          1 |     Total
------------+----------------------+----------
      White |     8,891      1,107 |     9,998 
            |     88.93      11.07 |    100.00 
------------+----------------------+----------
South Asian |     9,037      1,114 |    10,151 
            |     89.03      10.97 |    100.00 
------------+----------------------+----------
      Black |     8,757      1,049 |     9,806 
            |     89.30      10.70 |    100.00 
------------+----------------------+----------
      Mixed |     9,083      1,072 |    10,155 
            |     89.44      10.56 |    100.00 
------------+----------------------+----------
      Other |     9,056      1,048 |    10,104 
            |     89.63      10.37 |    100.00 
------------+----------------------+----------
    Unknown |    15,064      1,693 |    16,757 
            |     89.90      10.10 |    100.00 
------------+----------------------+----------
      Total |    59,888      7,083 |    66,971 
            |     89.42      10.58 |    100.00 
(11,780 observations deleted)

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

      Eth 5 | outcome onscoviddeath
 categories |         0          1 |     Total
------------+----------------------+----------
      White |     9,414        584 |     9,998 
            |     94.16       5.84 |    100.00 
------------+----------------------+----------
South Asian |     9,544        607 |    10,151 
            |     94.02       5.98 |    100.00 
------------+----------------------+----------
      Black |     9,211        595 |     9,806 
            |     93.93       6.07 |    100.00 
------------+----------------------+----------
      Mixed |     9,531        624 |    10,155 
            |     93.86       6.14 |    100.00 
------------+----------------------+----------
      Other |     9,480        624 |    10,104 
            |     93.82       6.18 |    100.00 
------------+----------------------+----------
    Unknown |    15,764        993 |    16,757 
            |     94.07       5.93 |    100.00 
------------+----------------------+----------
      Total |    62,944      4,027 |    66,971 
            |     93.99       6.01 |    100.00 
(11,780 observations deleted)

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

            |        outcome
      Eth 5 |   ons_noncoviddeath
 categories |         0          1 |     Total
------------+----------------------+----------
      White |     8,146      1,852 |     9,998 
            |     81.48      18.52 |    100.00 
------------+----------------------+----------
South Asian |     8,311      1,840 |    10,151 
            |     81.87      18.13 |    100.00 
------------+----------------------+----------
      Black |     8,025      1,781 |     9,806 
            |     81.84      18.16 |    100.00 
------------+----------------------+----------
      Mixed |     8,269      1,886 |    10,155 
            |     81.43      18.57 |    100.00 
------------+----------------------+----------
      Other |     8,358      1,746 |    10,104 
            |     82.72      17.28 |    100.00 
------------+----------------------+----------
    Unknown |    13,789      2,968 |    16,757 
            |     82.29      17.71 |    100.00 
------------+----------------------+----------
      Total |    54,898     12,073 |    66,971 
            |     81.97      18.03 |    100.00 
(11,780 observations deleted)

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

      Eth 5 |   outcome onsdeath
 categories |         0          1 |     Total
------------+----------------------+----------
      White |     7,562      2,436 |     9,998 
            |     75.64      24.36 |    100.00 
------------+----------------------+----------
South Asian |     7,704      2,447 |    10,151 
            |     75.89      24.11 |    100.00 
------------+----------------------+----------
      Black |     7,430      2,376 |     9,806 
            |     75.77      24.23 |    100.00 
------------+----------------------+----------
      Mixed |     7,645      2,510 |    10,155 
            |     75.28      24.72 |    100.00 
------------+----------------------+----------
      Other |     7,734      2,370 |    10,104 
            |     76.54      23.46 |    100.00 
------------+----------------------+----------
    Unknown |    12,796      3,961 |    16,757 
            |     76.36      23.64 |    100.00 
------------+----------------------+----------
      Total |    50,871     16,100 |    66,971 
            |     75.96      24.04 |    100.00 

. 
. foreach i of global outcomes {
  2.         di "`i'"
  3.         
. * Open Stata dataset
. use ./output/analysis_dataset_STSET_`i'.dta, clear
  4. drop if carehome==1
  5. 
. 
. /* Main Model================================================================
> =*/
. 
. /* Univariable model */ 
. 
. stcox i.eth5, strata(stp) nolog
  6. estimates save ./output/crude_`i'_eth5, replace 
  7. eststo model1
  8. parmest, label eform format(estimate p lb ub) saving(./output/crude_`i'_et
> h5, replace) idstr(crude_`i'_eth5) 
  9. local hr "`hr' ./output/crude_`i'_eth5 "
 10. 
. 
. /* Multivariable models */ 
. *Age and gender
. stcox i.eth5 i.male age1 age2 age3, strata(stp) nolog
 11. estimates save ./output/model0_`i'_eth5, replace 
 12. eststo model2
 13. 
. parmest, label eform format(estimate p lb ub) saving(./output/model0_`i'_eth5
> , replace) idstr(model0_`i'_eth5)
 14. local hr "`hr' ./output/model0_`i'_eth5 "
 15.  
. 
. * Age, Gender, IMD
. 
. stcox i.eth5 i.male age1 age2 age3 i.imd, strata(stp) nolog
 16. if _rc==0{
 17. estimates
 18. estimates save ./output/model1_`i'_eth5, replace 
 19. eststo model3
 20. 
. parmest, label eform format(estimate p lb ub) saving(./output/model1_`i'_eth5
> , replace) idstr(model1_`i'_eth5) 
 21. local hr "`hr' ./output/model1_`i'_eth5 "
 22. }
 23. else di "WARNING MODEL1 DID NOT FIT (OUTCOME `i')"
 24. 
. * Age, Gender, IMD and Comorbidities 
. stcox i.eth5 i.male age1 age2 age3      i.imd                                
>            ///
>                                                                              
>    i.bmicat_sa     i.hba1ccat                      ///
>                                                                              
>    gp_consult_count                        ///
>                                                                              
>    i.smoke_nomiss                          ///
>                                                                              
>    i.hypertension i.bp_cat         ///     
>                                                                              
>    i.asthma                                        ///
>                                                                              
>    i.chronic_respiratory_disease ///
>                                                                              
>    i.chronic_cardiac_disease       ///
>                                                                              
>    i.dm_type                                       ///     
>                                                                              
>    i.cancer                    ///
>                                                                              
>    i.chronic_liver_disease         ///
>                                                                              
>    i.stroke                                        ///
>                                                                              
>    i.dementia                                      ///
>                                                                              
>    i.other_neuro                           ///
>                                                                              
>    i.egfr60                                        ///
>                                                                              
>    i.esrf                                          ///
>                                                                              
>    i.immunosuppressed                      ///
>                                                                              
>    i.ra_sle_psoriasis, strata(stp) nolog           
 25. if _rc==0{
 26. estimates
 27. estimates save ./output/model2_`i'_eth5, replace 
 28. eststo model4
 29. 
. parmest, label eform format(estimate p lb ub) saving(./output/model2_`i'_eth5
> , replace) idstr(model2_`i'_eth5) 
 30. local hr "`hr' ./output/model2_`i'_eth5 "
 31. }
 32. else di "WARNING MODEL2 DID NOT FIT (OUTCOME `i')"
 33. 
.                                                                              
>    
. * Age, Gender, IMD and Comorbidities  and household size 
. stcox i.eth5 i.male age1 age2 age3      i.imd                                
>            ///
>                                                                              
>    i.bmicat_sa     i.hba1ccat                      ///
>                                                                              
>    gp_consult_count                        ///
>                                                                              
>    i.smoke_nomiss                          ///
>                                                                              
>    i.hypertension i.bp_cat         ///     
>                                                                              
>    i.asthma                                        ///
>                                                                              
>    i.chronic_respiratory_disease ///
>                                                                              
>    i.chronic_cardiac_disease       ///
>                                                                              
>    i.dm_type                                       ///     
>                                                                              
>    i.cancer                    ///
>                                                                              
>    i.chronic_liver_disease         ///
>                                                                              
>    i.stroke                                        ///
>                                                                              
>    i.dementia                                      ///
>                                                                              
>    i.other_neuro                           ///
>                                                                              
>    i.egfr60                                        ///
>                                                                              
>    i.esrf                                          ///
>                                                                              
>    i.immunosuppressed                      ///
>                                                                              
>    i.ra_sle_psoriasis                      ///
>                                                                              
>    i.hh_total_cat, strata(stp) nolog               
 34. estimates save ./output/model3_`i'_eth5, replace
 35. eststo model5
 36. 
. parmest, label eform format(estimate p lb ub) saving(./output/model3_`i'_eth5
> , replace) idstr(model3_`i'_eth5) 
 37. local hr "`hr' ./output/model3_`i'_eth5 "
 38. 
. 
. 
. /* Estout================================================================*/ 
. esttab model1 model2 model3 model4 model5 using ./output/estout_table2_eth5.t
> xt, b(a2) ci(2) label wide compress eform ///
>         title ("`i'") ///
>         varlabels(`e(labels)') ///
>         stats(N_sub) ///
>         append 
 39. eststo clear
 40. 
.                                                                              
>    
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. 
. * Column headings 
. file write tablecontent ("`i'") _n
 41. 
. * eth5 labelled columns
. 
. local lab1: label eth5 1
 42. local lab2: label eth5 2
 43. local lab3: label eth5 3
 44. local lab4: label eth5 4
 45. local lab5: label eth5 5
 46. local lab6: label eth5 6
 47. 
. /* counts */
.  
. * First row, eth5 = 1 (White British) reference cat
.         qui safecount if eth5==1
 48.         local denominator = r(N)
 49.         qui safecount if eth5 == 1 & `i' == 1
 50.         local event = r(N)
 51.     bysort eth5: egen total_follow_up = total(_t)
 52.         qui su total_follow_up if eth5 == 1
 53.         local person_week = r(mean)/7
 54.         local rate = 1000*(`event'/`person_week')
 55.         
.         file write tablecontent  ("`lab1'") _tab (`denominator') _tab (`event
> ') _tab %10.0f (`person_week') _tab %3.2f (`rate') _tab
 56.         file write tablecontent ("1.00") _tab _tab ("1.00") _tab _tab ("1.
> 00")  _tab _tab ("1.00") _tab _tab ("1.00") _n
 57.         
. * Subsequent ethnic groups
. forvalues eth=2/6 {
 58.         qui safecount if eth5==`eth'
 59.         local denominator = r(N)
 60.         qui safecount if eth5 == `eth' & `i' == 1
 61.         local event = r(N)
 62.         qui su total_follow_up if eth5 == `eth'
 63.         local person_week = r(mean)/7
 64.         local rate = 1000*(`event'/`person_week')
 65.         file write tablecontent  ("`lab`eth''") _tab (`denominator') _tab 
> (`event') _tab %10.0f (`person_week') _tab %3.2f (`rate ') _tab  
 66.         cap estimates use ./output/crude_`i'_eth5 
 67.          cap lincom `eth'.eth5, eform
 68.         file write tablecontent  %4.2f (r(estimate)) _tab ("(") %4.2f (r(l
> b)) (" - ") %4.2f (r(ub)) (")") _tab 
 69.         cap estimates clear
 70.         cap estimates use ./output/model0_`i'_eth5 
 71.          cap lincom `eth'.eth5, eform
 72.         file write tablecontent  %4.2f (r(estimate)) _tab ("(") %4.2f (r(l
> b)) (" - ") %4.2f (r(ub)) (")") _tab 
 73.         cap estimates clear
 74.         cap estimates use ./output/model1_`i'_eth5 
 75.          cap lincom `eth'.eth5, eform
 76.         file write tablecontent  %4.2f (r(estimate)) _tab ("(") %4.2f (r(l
> b)) (" - ") %4.2f (r(ub)) (")") _tab 
 77.         cap estimates clear
 78.         cap estimates use ./output/model2_`i'_eth5 
 79.          cap lincom `eth'.eth5, eform
 80.         file write tablecontent  %4.2f (r(estimate)) _tab ("(") %4.2f (r(l
> b)) (" - ") %4.2f (r(ub)) (")") _tab 
 81.         cap estimates clear
 82.         cap estimates use ./output/model3_`i'_eth5 
 83.          cap lincom `eth'.eth5, eform
 84.         file write tablecontent  %4.2f (r(estimate)) _tab ("(") %4.2f (r(l
> b)) (" - ") %4.2f (r(ub)) (")") _n
 85. }  //end ethnic group
 86. 
. 
. } //end outcomes
tested
(11,780 observations deleted)

         failure _d:  tested
   analysis time _t:  (stime_tested-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,971                  Number of obs    =      66,971
No. of failures =       45,369
Time at risk    =      4479565
                                                LR chi2(5)       =       12.80
Log likelihood  =   -370390.75                  Prob > chi2      =      0.0253

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   1.002417   .0172789     0.14   0.889     .9691168    1.036862
      Black  |   1.024197   .0177373     1.38   0.167     .9900156    1.059558
      Mixed  |   1.030744   .0177248     1.76   0.078     .9965831    1.066076
      Other  |   1.043796   .0178859     2.50   0.012     1.009322    1.079447
    Unknown  |   1.041245   .0160259     2.63   0.009     1.010303    1.073133
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/crude_tested_eth5.ster not found)
file ./output/crude_tested_eth5.ster saved
(note: file ./output/crude_tested_eth5.dta not found)
file ./output/crude_tested_eth5.dta saved

         failure _d:  tested
   analysis time _t:  (stime_tested-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,971                  Number of obs    =      66,971
No. of failures =       45,369
Time at risk    =      4479565
                                                LR chi2(9)       =       23.44
Log likelihood  =   -370385.44                  Prob > chi2      =      0.0053

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   1.002594   .0172827     0.15   0.881     .9692865    1.037046
      Black  |   1.024124   .0177364     1.38   0.169     .9899441    1.059483
      Mixed  |   1.031059   .0177307     1.78   0.075     .9968864    1.066403
      Other  |   1.044045    .017891     2.52   0.012     1.009562    1.079706
    Unknown  |   1.041409   .0160289     2.64   0.008     1.010463    1.073304
             |
        male |
       Male  |   1.005815   .0094466     0.62   0.537     .9874697    1.024502
        age1 |   1.002625   .0012906     2.04   0.042     1.000098    1.005158
        age2 |   .9871235   .0046233    -2.77   0.006     .9781035    .9962266
        age3 |   1.037542   .0128978     2.96   0.003     1.012568    1.063131
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model0_tested_eth5.ster not found)
file ./output/model0_tested_eth5.ster saved
(note: file ./output/model0_tested_eth5.dta not found)
file ./output/model0_tested_eth5.dta saved

         failure _d:  tested
   analysis time _t:  (stime_tested-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,971                  Number of obs    =      66,971
No. of failures =       45,369
Time at risk    =      4479565
                                                LR chi2(11)      =       26.16
Log likelihood  =   -370384.08                  Prob > chi2      =      0.0061

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   1.002414   .0172799     0.14   0.889     .9691113     1.03686
      Black  |   1.024109   .0177363     1.38   0.169     .9899303    1.059469
      Mixed  |    1.03106   .0177311     1.78   0.075     .9968871    1.066405
      Other  |    1.04402   .0178909     2.51   0.012     1.009537    1.079681
    Unknown  |   1.041311   .0160275     2.63   0.009     1.010366    1.073203
             |
        male |
       Male  |   1.005854    .009447     0.62   0.534     .9875078    1.024542
        age1 |   1.002647   .0012907     2.05   0.040      1.00012     1.00518
        age2 |   .9870414   .0046231    -2.78   0.005     .9780217    .9961442
        age3 |    1.03776    .012901     2.98   0.003      1.01278    1.063356
             |
         imd |
          4  |   .9968105   .0118437    -0.27   0.788     .9738655    1.020296
5 most de..  |    .974193   .0154806    -1.65   0.100     .9443192    1.005012
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,971                  Number of obs    =      66,971
No. of failures =       45,369
Time at risk    =      4479565
                                                LR chi2(11)      =       26.16
Log likelihood  =   -370384.08                  Prob > chi2      =      0.0061

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   1.002414   .0172799     0.14   0.889     .9691113     1.03686
      Black  |   1.024109   .0177363     1.38   0.169     .9899303    1.059469
      Mixed  |    1.03106   .0177311     1.78   0.075     .9968871    1.066405
      Other  |    1.04402   .0178909     2.51   0.012     1.009537    1.079681
    Unknown  |   1.041311   .0160275     2.63   0.009     1.010366    1.073203
             |
        male |
       Male  |   1.005854    .009447     0.62   0.534     .9875078    1.024542
        age1 |   1.002647   .0012907     2.05   0.040      1.00012     1.00518
        age2 |   .9870414   .0046231    -2.78   0.005     .9780217    .9961442
        age3 |    1.03776    .012901     2.98   0.003      1.01278    1.063356
             |
         imd |
          4  |   .9968105   .0118437    -0.27   0.788     .9738655    1.020296
5 most de..  |    .974193   .0154806    -1.65   0.100     .9443192    1.005012
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model1_tested_eth5.ster not found)
file ./output/model1_tested_eth5.ster saved
(note: file ./output/model1_tested_eth5.dta not found)
file ./output/model1_tested_eth5.dta saved

         failure _d:  tested
   analysis time _t:  (stime_tested-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,971                  Number of obs    =      66,971
No. of failures =       45,369
Time at risk    =      4479565
                                                LR chi2(44)      =       51.82
Log likelihood  =   -370371.25                  Prob > chi2      =      0.1952

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   1.001102   .0173014     0.06   0.949     .9677593    1.035593
      Black  |   1.023495   .0177311     1.34   0.180     .9893261    1.058844
      Mixed  |   1.030696   .0177293     1.76   0.079     .9965269    1.066038
      Other  |   1.043577   .0178886     2.49   0.013     1.009098    1.079233
    Unknown  |   1.040756   .0160258     2.59   0.009     1.009815    1.072645
             |
        male |
       Male  |   1.007389   .0095143     0.78   0.436      .988913     1.02621
        age1 |    1.00257   .0013333     1.93   0.054     .9999606    1.005187
        age2 |   .9872524   .0047148    -2.69   0.007     .9780546    .9965367
        age3 |    1.03696   .0130915     2.87   0.004     1.011616    1.062939
             |
         imd |
          4  |   .9968273   .0118474    -0.27   0.789     .9738752     1.02032
5 most de..  |   .9734942   .0154763    -1.69   0.091     .9436289    1.004305
             |
   bmicat_sa |
Normal (..)  |   1.015935   .0356625     0.45   0.652     .9483881    1.088293
Overweig..)  |   1.041652   .0353699     1.20   0.229     .9745849    1.113335
Obese I ..)  |   1.033344   .0344972     0.98   0.326     .9678953    1.103218
Obese II..)  |   1.034595   .0344684     1.02   0.307     .9691966    1.104406
Obese II..)  |   1.033429   .0339267     1.00   0.317     .9690283     1.10211
    Unknown  |   1.029748   .0340864     0.89   0.376     .9650614    1.098771
             |
    hba1ccat |
  >=6.5-7.4  |   .9999281   .0125396    -0.01   0.995     .9756505     1.02481
  >=7.5-7.9  |   .9795903    .019471    -1.04   0.300     .9421616    1.018506
    >=8-8.9  |   1.018874   .0182269     1.05   0.296     .9837685    1.055231
        >=9  |   .9872709   .0237163    -0.53   0.594     .9418651    1.034866
    Unknown  |   1.013217   .0762147     0.17   0.861     .8743289    1.174168
             |
gp_consult~t |     .99987   .0020391    -0.06   0.949     .9958815    1.003874
             |
smoke_nomiss |
     Former  |   .9917249   .0336379    -0.24   0.806     .9279395    1.059895
    Current  |   .9868458   .0142483    -0.92   0.359      .959311    1.015171
             |
1.hyperten~n |   .9944661   .0116854    -0.47   0.637     .9718248    1.017635
             |
      bp_cat |
High, sta..  |   .7948605   .4751063    -0.38   0.701     .2463249    2.564918
High, sta..  |   .8303628   .4798879    -0.32   0.748      .267508    2.577502
    Unknown  |   .8134573   .4702583    -0.36   0.721      .261973    2.525882
             |
    1.asthma |   1.067628   .0252289     2.77   0.006     1.019307    1.118238
1.~y_disease |   1.002373   .0117803     0.20   0.840     .9795475    1.025729
1.~c_disease |   .9877217   .0115963    -1.05   0.293     .9652528    1.010714
             |
     dm_type |
       T1DM  |   .9675151   .0273741    -1.17   0.243     .9153233    1.022683
       T2DM  |   .9976236   .0117673    -0.20   0.840     .9748246    1.020956
 UNKNOWN_DM  |   .9923325   .0332737    -0.23   0.818      .929214    1.059739
             |
    1.cancer |   1.005694   .0118098     0.48   0.629     .9828116    1.029109
1.~r_disease |   1.000129   .0117896     0.01   0.991     .9772862    1.023505
    1.stroke |   .9913806   .0116554    -0.74   0.462     .9687976     1.01449
  1.dementia |   1.003379   .0118091     0.29   0.774     .9804985    1.026793
1.other_ne~o |   .9921668   .0116712    -0.67   0.504     .9695533    1.015308
             |
      egfr60 |
   eGFR <60  |   1.081951   .0499728     1.71   0.088     .9883082    1.184466
      1.esrf |   .9872518   .0116126    -1.09   0.275     .9647519    1.010277
1.immunosu~d |   .9929396   .0097332    -0.72   0.470     .9740449    1.012201
1.ra_sle_p~s |   1.014857   .0119268     1.25   0.210     .9917483    1.038505
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,971                  Number of obs    =      66,971
No. of failures =       45,369
Time at risk    =      4479565
                                                LR chi2(44)      =       51.82
Log likelihood  =   -370371.25                  Prob > chi2      =      0.1952

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   1.001102   .0173014     0.06   0.949     .9677593    1.035593
      Black  |   1.023495   .0177311     1.34   0.180     .9893261    1.058844
      Mixed  |   1.030696   .0177293     1.76   0.079     .9965269    1.066038
      Other  |   1.043577   .0178886     2.49   0.013     1.009098    1.079233
    Unknown  |   1.040756   .0160258     2.59   0.009     1.009815    1.072645
             |
        male |
       Male  |   1.007389   .0095143     0.78   0.436      .988913     1.02621
        age1 |    1.00257   .0013333     1.93   0.054     .9999606    1.005187
        age2 |   .9872524   .0047148    -2.69   0.007     .9780546    .9965367
        age3 |    1.03696   .0130915     2.87   0.004     1.011616    1.062939
             |
         imd |
          4  |   .9968273   .0118474    -0.27   0.789     .9738752     1.02032
5 most de..  |   .9734942   .0154763    -1.69   0.091     .9436289    1.004305
             |
   bmicat_sa |
Normal (..)  |   1.015935   .0356625     0.45   0.652     .9483881    1.088293
Overweig..)  |   1.041652   .0353699     1.20   0.229     .9745849    1.113335
Obese I ..)  |   1.033344   .0344972     0.98   0.326     .9678953    1.103218
Obese II..)  |   1.034595   .0344684     1.02   0.307     .9691966    1.104406
Obese II..)  |   1.033429   .0339267     1.00   0.317     .9690283     1.10211
    Unknown  |   1.029748   .0340864     0.89   0.376     .9650614    1.098771
             |
    hba1ccat |
  >=6.5-7.4  |   .9999281   .0125396    -0.01   0.995     .9756505     1.02481
  >=7.5-7.9  |   .9795903    .019471    -1.04   0.300     .9421616    1.018506
    >=8-8.9  |   1.018874   .0182269     1.05   0.296     .9837685    1.055231
        >=9  |   .9872709   .0237163    -0.53   0.594     .9418651    1.034866
    Unknown  |   1.013217   .0762147     0.17   0.861     .8743289    1.174168
             |
gp_consult~t |     .99987   .0020391    -0.06   0.949     .9958815    1.003874
             |
smoke_nomiss |
     Former  |   .9917249   .0336379    -0.24   0.806     .9279395    1.059895
    Current  |   .9868458   .0142483    -0.92   0.359      .959311    1.015171
             |
1.hyperten~n |   .9944661   .0116854    -0.47   0.637     .9718248    1.017635
             |
      bp_cat |
High, sta..  |   .7948605   .4751063    -0.38   0.701     .2463249    2.564918
High, sta..  |   .8303628   .4798879    -0.32   0.748      .267508    2.577502
    Unknown  |   .8134573   .4702583    -0.36   0.721      .261973    2.525882
             |
    1.asthma |   1.067628   .0252289     2.77   0.006     1.019307    1.118238
1.~y_disease |   1.002373   .0117803     0.20   0.840     .9795475    1.025729
1.~c_disease |   .9877217   .0115963    -1.05   0.293     .9652528    1.010714
             |
     dm_type |
       T1DM  |   .9675151   .0273741    -1.17   0.243     .9153233    1.022683
       T2DM  |   .9976236   .0117673    -0.20   0.840     .9748246    1.020956
 UNKNOWN_DM  |   .9923325   .0332737    -0.23   0.818      .929214    1.059739
             |
    1.cancer |   1.005694   .0118098     0.48   0.629     .9828116    1.029109
1.~r_disease |   1.000129   .0117896     0.01   0.991     .9772862    1.023505
    1.stroke |   .9913806   .0116554    -0.74   0.462     .9687976     1.01449
  1.dementia |   1.003379   .0118091     0.29   0.774     .9804985    1.026793
1.other_ne~o |   .9921668   .0116712    -0.67   0.504     .9695533    1.015308
             |
      egfr60 |
   eGFR <60  |   1.081951   .0499728     1.71   0.088     .9883082    1.184466
      1.esrf |   .9872518   .0116126    -1.09   0.275     .9647519    1.010277
1.immunosu~d |   .9929396   .0097332    -0.72   0.470     .9740449    1.012201
1.ra_sle_p~s |   1.014857   .0119268     1.25   0.210     .9917483    1.038505
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model2_tested_eth5.ster not found)
file ./output/model2_tested_eth5.ster saved
(note: file ./output/model2_tested_eth5.dta not found)
file ./output/model2_tested_eth5.dta saved

         failure _d:  tested
   analysis time _t:  (stime_tested-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,971                  Number of obs    =      66,971
No. of failures =       45,369
Time at risk    =      4479565
                                                LR chi2(46)      =       52.74
Log likelihood  =   -370370.78                  Prob > chi2      =      0.2296

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   1.001269   .0173053     0.07   0.941     .9679196    1.035768
      Black  |   1.023573   .0177329     1.34   0.179     .9894007    1.058926
      Mixed  |    1.03088   .0177336     1.77   0.077     .9967019    1.066229
      Other  |   1.043578   .0178889     2.49   0.013     1.009099    1.079235
    Unknown  |   1.040863    .016028     2.60   0.009     1.009918    1.072756
             |
        male |
       Male  |   1.007404   .0095144     0.78   0.435     .9889277    1.026226
        age1 |   1.002569   .0013333     1.93   0.054     .9999588    1.005185
        age2 |   .9872643   .0047149    -2.68   0.007     .9780664    .9965487
        age3 |    1.03693    .013091     2.87   0.004     1.011587    1.062908
             |
         imd |
          4  |   .9968048   .0118472    -0.27   0.788     .9738531    1.020297
5 most de..  |   .9735113   .0154766    -1.69   0.091     .9436454    1.004322
             |
   bmicat_sa |
Normal (..)  |   1.015814   .0356605     0.45   0.655     .9482708    1.088168
Overweig..)  |   1.041427   .0353648     1.20   0.232     .9743698      1.1131
Obese I ..)  |   1.033183   .0344936     0.98   0.328     .9677409     1.10305
Obese II..)  |   1.034427   .0344648     1.02   0.310     .9690356    1.104231
Obese II..)  |   1.033238   .0339228     1.00   0.319     .9688441    1.101911
    Unknown  |   1.029587   .0340827     0.88   0.378     .9649067    1.098602
             |
    hba1ccat |
  >=6.5-7.4  |   .9999528   .0125401    -0.00   0.997     .9756742    1.024835
  >=7.5-7.9  |   .9796827   .0194732    -1.03   0.302     .9422499    1.018603
    >=8-8.9  |    1.01883   .0182264     1.04   0.297     .9837257    1.055187
        >=9  |   .9872177   .0237153    -0.54   0.592     .9418139     1.03481
    Unknown  |    1.01329   .0762206     0.18   0.861     .8743909    1.174254
             |
gp_consult~t |   .9998628    .002039    -0.07   0.946     .9958744    1.003867
             |
smoke_nomiss |
     Former  |   .9916334   .0336353    -0.25   0.804      .927853    1.059798
    Current  |   .9868008   .0142478    -0.92   0.357     .9592671    1.015125
             |
1.hyperten~n |   .9945243   .0116863    -0.47   0.640     .9718814    1.017695
             |
      bp_cat |
High, sta..  |   .7941331   .4746726    -0.39   0.700     .2460988    2.562578
High, sta..  |   .8299425   .4796456    -0.32   0.747     .2673722    2.576201
    Unknown  |   .8130142   .4700028    -0.36   0.720     .2618299     2.52451
             |
    1.asthma |   1.067899   .0252374     2.78   0.005     1.019563    1.118527
1.~y_disease |   1.002399   .0117807     0.20   0.838     .9795736    1.025757
1.~c_disease |   .9878097    .011598    -1.04   0.296     .9653377    1.010805
             |
     dm_type |
       T1DM  |   .9675431   .0273771    -1.17   0.244     .9153457    1.022717
       T2DM  |   .9975773   .0117669    -0.21   0.837     .9747792    1.020909
 UNKNOWN_DM  |   .9923509   .0332744    -0.23   0.819     .9292311    1.059758
             |
    1.cancer |   1.005684   .0118098     0.48   0.629     .9828012    1.029099
1.~r_disease |   1.000121   .0117896     0.01   0.992     .9772791    1.023498
    1.stroke |   .9913732   .0116555    -0.74   0.461       .96879    1.014483
  1.dementia |    1.00339   .0118093     0.29   0.774     .9805087    1.026804
1.other_ne~o |   .9921446    .011671    -0.67   0.503     .9695316    1.015285
             |
      egfr60 |
   eGFR <60  |   1.082064    .049979     1.71   0.088       .98841    1.184592
      1.esrf |   .9872428   .0116126    -1.09   0.275     .9647429    1.010267
1.immunosu~d |   .9930286   .0097345    -0.71   0.475     .9741314    1.012292
1.ra_sle_p~s |   1.014959   .0119285     1.26   0.206     .9918465    1.038609
             |
hh_total_cat |
       6-10  |   .9757095   .0306082    -0.78   0.433     .9175255    1.037583
        11+  |   .9078814   .1225595    -0.72   0.474     .6968208     1.18287
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model3_tested_eth5.ster not found)
file ./output/model3_tested_eth5.ster saved
(note: file ./output/model3_tested_eth5.dta not found)
file ./output/model3_tested_eth5.dta saved
(note: file ./output/estout_table2_eth5.txt not found)
(output written to ./output/estout_table2_eth5.txt)
positivetest
(11,780 observations deleted)

         failure _d:  positivetest
   analysis time _t:  (stime_positivetest-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,971                  Number of obs    =      66,971
No. of failures =       45,320
Time at risk    =      4474285
                                                LR chi2(5)       =       16.13
Log likelihood  =   -369949.34                  Prob > chi2      =      0.0065

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   1.048372   .0179295     2.76   0.006     1.013813    1.084109
      Black  |   .9949679   .0172666    -0.29   0.771     .9616951    1.029392
      Mixed  |   1.033685   .0177433     1.93   0.054     .9994878    1.069053
      Other  |   .9956995    .017132    -0.25   0.802     .9626814     1.02985
    Unknown  |    1.01441   .0156248     0.93   0.353     .9842437    1.045501
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/crude_positivetest_eth5.ster not found)
file ./output/crude_positivetest_eth5.ster saved
(note: file ./output/crude_positivetest_eth5.dta not found)
file ./output/crude_positivetest_eth5.dta saved

         failure _d:  positivetest
   analysis time _t:  (stime_positivetest-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,971                  Number of obs    =      66,971
No. of failures =       45,320
Time at risk    =      4474285
                                                LR chi2(9)       =       20.38
Log likelihood  =   -369947.22                  Prob > chi2      =      0.0157

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   1.048251   .0179284     2.76   0.006     1.013694    1.083985
      Black  |   .9949362   .0172661    -0.29   0.770     .9616643    1.029359
      Mixed  |   1.033633    .017743     1.93   0.054     .9994357       1.069
      Other  |   .9957597   .0171335    -0.25   0.805     .9627386    1.029913
    Unknown  |   1.014443   .0156255     0.93   0.352     .9842751    1.045535
             |
        male |
       Male  |      .9937   .0093387    -0.67   0.501     .9755639    1.012173
        age1 |   .9997217   .0012798    -0.22   0.828     .9972165    1.002233
        age2 |   .9978689   .0046559    -0.46   0.648     .9887852    1.007036
        age3 |   1.007886   .0124821     0.63   0.526     .9837165     1.03265
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model0_positivetest_eth5.ster not found)
file ./output/model0_positivetest_eth5.ster saved
(note: file ./output/model0_positivetest_eth5.dta not found)
file ./output/model0_positivetest_eth5.dta saved

         failure _d:  positivetest
   analysis time _t:  (stime_positivetest-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,971                  Number of obs    =      66,971
No. of failures =       45,320
Time at risk    =      4474285
                                                LR chi2(11)      =       25.92
Log likelihood  =   -369944.45                  Prob > chi2      =      0.0067

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   1.048275   .0179289     2.76   0.006     1.013717    1.084011
      Black  |   .9950806   .0172687    -0.28   0.776     .9618037    1.029509
      Mixed  |    1.03347   .0177408     1.92   0.055     .9992774    1.068833
      Other  |   .9956137   .0171312    -0.26   0.798      .962597    1.029763
    Unknown  |   1.014518   .0156267     0.94   0.349     .9843482    1.045613
             |
        male |
       Male  |   .9936454   .0093383    -0.68   0.498     .9755103    1.012118
        age1 |    .999681   .0012799    -0.25   0.803     .9971756    1.002193
        age2 |   .9980261   .0046573    -0.42   0.672     .9889396    1.007196
        age3 |   1.007475   .0124788     0.60   0.548     .9833113    1.032232
             |
         imd |
          4  |   1.019636   .0120956     1.64   0.101     .9962028    1.043621
5 most de..  |    1.03127   .0162961     1.95   0.051     .9998195    1.063709
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,971                  Number of obs    =      66,971
No. of failures =       45,320
Time at risk    =      4474285
                                                LR chi2(11)      =       25.92
Log likelihood  =   -369944.45                  Prob > chi2      =      0.0067

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   1.048275   .0179289     2.76   0.006     1.013717    1.084011
      Black  |   .9950806   .0172687    -0.28   0.776     .9618037    1.029509
      Mixed  |    1.03347   .0177408     1.92   0.055     .9992774    1.068833
      Other  |   .9956137   .0171312    -0.26   0.798      .962597    1.029763
    Unknown  |   1.014518   .0156267     0.94   0.349     .9843482    1.045613
             |
        male |
       Male  |   .9936454   .0093383    -0.68   0.498     .9755103    1.012118
        age1 |    .999681   .0012799    -0.25   0.803     .9971756    1.002193
        age2 |   .9980261   .0046573    -0.42   0.672     .9889396    1.007196
        age3 |   1.007475   .0124788     0.60   0.548     .9833113    1.032232
             |
         imd |
          4  |   1.019636   .0120956     1.64   0.101     .9962028    1.043621
5 most de..  |    1.03127   .0162961     1.95   0.051     .9998195    1.063709
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model1_positivetest_eth5.ster not found)
file ./output/model1_positivetest_eth5.ster saved
(note: file ./output/model1_positivetest_eth5.dta not found)
file ./output/model1_positivetest_eth5.dta saved

         failure _d:  positivetest
   analysis time _t:  (stime_positivetest-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,971                  Number of obs    =      66,971
No. of failures =       45,320
Time at risk    =      4474285
                                                LR chi2(44)      =       64.02
Log likelihood  =    -369925.4                  Prob > chi2      =      0.0259

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   1.048385   .0179827     2.75   0.006     1.013726     1.08423
      Black  |    .994527    .017265    -0.32   0.752     .9612575    1.028948
      Mixed  |   1.033603   .0177471     1.92   0.054     .9993981    1.068979
      Other  |   .9954967   .0171342    -0.26   0.793     .9624743    1.029652
    Unknown  |   1.014497   .0156297     0.93   0.350     .9843213    1.045598
             |
        male |
       Male  |   .9948814    .009399    -0.54   0.587     .9766293    1.013475
        age1 |   .9995491   .0013241    -0.34   0.733     .9969573    1.002148
        age2 |   .9983582   .0047548    -0.35   0.730     .9890823    1.007721
        age3 |   1.006506   .0126703     0.52   0.606     .9819761    1.031648
             |
         imd |
          4  |   1.019832   .0121035     1.65   0.098     .9963831    1.043832
5 most de..  |   1.031547   .0163055     1.96   0.049     1.000079    1.064006
             |
   bmicat_sa |
Normal (..)  |    .968148   .0336137    -0.93   0.351     .9044579    1.036323
Overweig..)  |   .9643488   .0324062    -1.08   0.280     .9028803    1.030002
Obese I ..)  |   .9744406   .0321534    -0.78   0.433     .9134158    1.039543
Obese II..)  |   .9627514   .0317261    -1.15   0.249     .9025349    1.026985
Obese II..)  |   .9703536   .0314739    -0.93   0.353     .9105857    1.034044
    Unknown  |    .963951   .0315335    -1.12   0.262     .9040861     1.02778
             |
    hba1ccat |
  >=6.5-7.4  |   1.016074   .0127307     1.27   0.203     .9914256    1.041334
  >=7.5-7.9  |   1.040775    .020495     2.03   0.042     1.001371     1.08173
    >=8-8.9  |   .9773687   .0176482    -1.27   0.205     .9433838    1.012578
        >=9  |    .967669   .0233535    -1.36   0.173     .9229627    1.014541
    Unknown  |     .87259   .0671525    -1.77   0.077     .7504188    1.014651
             |
gp_consult~t |   .9983833   .0020361    -0.79   0.428     .9944007    1.002382
             |
smoke_nomiss |
     Former  |   .9933955   .0337881    -0.19   0.846     .9293312    1.061876
    Current  |   1.023953    .014729     1.65   0.100     .9954882    1.053232
             |
1.hyperten~n |   .9764916   .0115131    -2.02   0.044     .9541852    .9993195
             |
      bp_cat |
High, sta..  |   .3310764   .1737886    -2.11   0.035     .1183357    .9262768
High, sta..  |   .3444054   .1723889    -2.13   0.033     .1291246    .9186096
    Unknown  |   .3491514   .1748342    -2.10   0.036     .1308527     .931633
             |
    1.asthma |    .979002   .0235216    -0.88   0.377     .9339691    1.026206
1.~y_disease |   1.017158    .011932     1.45   0.147     .9940384    1.040815
1.~c_disease |   .9974249   .0117049    -0.22   0.826     .9747455    1.020632
             |
     dm_type |
       T1DM  |    1.03015   .0289228     1.06   0.290      .974994    1.088427
       T2DM  |   .9920696   .0117163    -0.67   0.500     .9693698    1.015301
 UNKNOWN_DM  |    .996048   .0334367    -0.12   0.906     .9326227    1.063787
             |
    1.cancer |   .9949312   .0117338    -0.43   0.667     .9721971    1.018197
1.~r_disease |   1.000115   .0117858     0.01   0.992     .9772798    1.023483
    1.stroke |   1.013213   .0118638     1.12   0.262     .9902248    1.036734
  1.dementia |   .9915661   .0116825    -0.72   0.472     .9689312     1.01473
1.other_ne~o |   1.005499   .0118175     0.47   0.641     .9826013    1.028929
             |
      egfr60 |
   eGFR <60  |   1.066006   .0496804     1.37   0.170     .9729485    1.167963
      1.esrf |   .9832749   .0116082    -1.43   0.153     .9607845    1.006292
1.immunosu~d |   1.005454   .0098536     0.56   0.579     .9863257    1.024953
1.ra_sle_p~s |   1.001503    .011786     0.13   0.898     .9786668    1.024871
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,971                  Number of obs    =      66,971
No. of failures =       45,320
Time at risk    =      4474285
                                                LR chi2(44)      =       64.02
Log likelihood  =    -369925.4                  Prob > chi2      =      0.0259

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   1.048385   .0179827     2.75   0.006     1.013726     1.08423
      Black  |    .994527    .017265    -0.32   0.752     .9612575    1.028948
      Mixed  |   1.033603   .0177471     1.92   0.054     .9993981    1.068979
      Other  |   .9954967   .0171342    -0.26   0.793     .9624743    1.029652
    Unknown  |   1.014497   .0156297     0.93   0.350     .9843213    1.045598
             |
        male |
       Male  |   .9948814    .009399    -0.54   0.587     .9766293    1.013475
        age1 |   .9995491   .0013241    -0.34   0.733     .9969573    1.002148
        age2 |   .9983582   .0047548    -0.35   0.730     .9890823    1.007721
        age3 |   1.006506   .0126703     0.52   0.606     .9819761    1.031648
             |
         imd |
          4  |   1.019832   .0121035     1.65   0.098     .9963831    1.043832
5 most de..  |   1.031547   .0163055     1.96   0.049     1.000079    1.064006
             |
   bmicat_sa |
Normal (..)  |    .968148   .0336137    -0.93   0.351     .9044579    1.036323
Overweig..)  |   .9643488   .0324062    -1.08   0.280     .9028803    1.030002
Obese I ..)  |   .9744406   .0321534    -0.78   0.433     .9134158    1.039543
Obese II..)  |   .9627514   .0317261    -1.15   0.249     .9025349    1.026985
Obese II..)  |   .9703536   .0314739    -0.93   0.353     .9105857    1.034044
    Unknown  |    .963951   .0315335    -1.12   0.262     .9040861     1.02778
             |
    hba1ccat |
  >=6.5-7.4  |   1.016074   .0127307     1.27   0.203     .9914256    1.041334
  >=7.5-7.9  |   1.040775    .020495     2.03   0.042     1.001371     1.08173
    >=8-8.9  |   .9773687   .0176482    -1.27   0.205     .9433838    1.012578
        >=9  |    .967669   .0233535    -1.36   0.173     .9229627    1.014541
    Unknown  |     .87259   .0671525    -1.77   0.077     .7504188    1.014651
             |
gp_consult~t |   .9983833   .0020361    -0.79   0.428     .9944007    1.002382
             |
smoke_nomiss |
     Former  |   .9933955   .0337881    -0.19   0.846     .9293312    1.061876
    Current  |   1.023953    .014729     1.65   0.100     .9954882    1.053232
             |
1.hyperten~n |   .9764916   .0115131    -2.02   0.044     .9541852    .9993195
             |
      bp_cat |
High, sta..  |   .3310764   .1737886    -2.11   0.035     .1183357    .9262768
High, sta..  |   .3444054   .1723889    -2.13   0.033     .1291246    .9186096
    Unknown  |   .3491514   .1748342    -2.10   0.036     .1308527     .931633
             |
    1.asthma |    .979002   .0235216    -0.88   0.377     .9339691    1.026206
1.~y_disease |   1.017158    .011932     1.45   0.147     .9940384    1.040815
1.~c_disease |   .9974249   .0117049    -0.22   0.826     .9747455    1.020632
             |
     dm_type |
       T1DM  |    1.03015   .0289228     1.06   0.290      .974994    1.088427
       T2DM  |   .9920696   .0117163    -0.67   0.500     .9693698    1.015301
 UNKNOWN_DM  |    .996048   .0334367    -0.12   0.906     .9326227    1.063787
             |
    1.cancer |   .9949312   .0117338    -0.43   0.667     .9721971    1.018197
1.~r_disease |   1.000115   .0117858     0.01   0.992     .9772798    1.023483
    1.stroke |   1.013213   .0118638     1.12   0.262     .9902248    1.036734
  1.dementia |   .9915661   .0116825    -0.72   0.472     .9689312     1.01473
1.other_ne~o |   1.005499   .0118175     0.47   0.641     .9826013    1.028929
             |
      egfr60 |
   eGFR <60  |   1.066006   .0496804     1.37   0.170     .9729485    1.167963
      1.esrf |   .9832749   .0116082    -1.43   0.153     .9607845    1.006292
1.immunosu~d |   1.005454   .0098536     0.56   0.579     .9863257    1.024953
1.ra_sle_p~s |   1.001503    .011786     0.13   0.898     .9786668    1.024871
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model2_positivetest_eth5.ster not found)
file ./output/model2_positivetest_eth5.ster saved
(note: file ./output/model2_positivetest_eth5.dta not found)
file ./output/model2_positivetest_eth5.dta saved

         failure _d:  positivetest
   analysis time _t:  (stime_positivetest-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,971                  Number of obs    =      66,971
No. of failures =       45,320
Time at risk    =      4474285
                                                LR chi2(46)      =       65.47
Log likelihood  =   -369924.67                  Prob > chi2      =      0.0310

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |    1.04834   .0179824     2.75   0.006     1.013681    1.084184
      Black  |   .9944925   .0172644    -0.32   0.750      .961224    1.028912
      Mixed  |    1.03364   .0177483     1.93   0.054     .9994328    1.069018
      Other  |   .9954888   .0171341    -0.26   0.793     .9624667    1.029644
    Unknown  |    1.01449   .0156296     0.93   0.350     .9843148    1.045591
             |
        male |
       Male  |   .9948956   .0093991    -0.54   0.588     .9766431    1.013489
        age1 |   .9995469   .0013241    -0.34   0.732     .9969552    1.002145
        age2 |   .9983604   .0047549    -0.34   0.730     .9890844    1.007723
        age3 |     1.0065   .0126705     0.51   0.607     .9819698    1.031642
             |
         imd |
          4  |   1.019797   .0121033     1.65   0.099     .9963491    1.043798
5 most de..  |   1.031457   .0163045     1.96   0.050     .9999911    1.063914
             |
   bmicat_sa |
Normal (..)  |   .9683851   .0336228    -0.93   0.355     .9046778    1.036579
Overweig..)  |   .9647161   .0324215    -1.07   0.285     .9032187    1.030401
Obese I ..)  |   .9747298   .0321647    -0.78   0.438     .9136835    1.039855
Obese II..)  |   .9630935   .0317394    -1.14   0.254     .9028519    1.027355
Obese II..)  |   .9706919   .0314872    -0.92   0.359      .910899     1.03441
    Unknown  |   .9642175   .0315435    -1.11   0.265     .9043338    1.028067
             |
    hba1ccat |
  >=6.5-7.4  |   1.016154    .012732     1.28   0.201     .9915039    1.041417
  >=7.5-7.9  |   1.040958   .0204994     2.04   0.042     1.001545    1.081921
    >=8-8.9  |   .9772467   .0176464    -1.27   0.202     .9432652    1.012452
        >=9  |   .9677052   .0233544    -1.36   0.174     .9229971    1.014579
    Unknown  |   .8727786   .0671673    -1.77   0.077     .7505806    1.014871
             |
gp_consult~t |   .9983925   .0020361    -0.79   0.430     .9944098    1.002391
             |
smoke_nomiss |
     Former  |   .9935593   .0337942    -0.19   0.849     .9294834    1.062052
    Current  |    1.02402   .0147303     1.65   0.099     .9955524    1.053302
             |
1.hyperten~n |    .976508   .0115134    -2.02   0.044      .954201    .9993366
             |
      bp_cat |
High, sta..  |   .3307853   .1736365    -2.11   0.035     .1182311    .9254667
High, sta..  |    .344181   .1722769    -2.13   0.033     .1290403    .9180126
    Unknown  |   .3489012   .1747093    -2.10   0.035     .1307587    .9309671
             |
    1.asthma |   .9788738   .0235193    -0.89   0.374     .9338453    1.026073
1.~y_disease |   1.017162   .0119323     1.45   0.147     .9940422     1.04082
1.~c_disease |   .9972768   .0117049    -0.23   0.816     .9745976    1.020484
             |
     dm_type |
       T1DM  |   1.029838   .0289154     1.05   0.295     .9746956    1.088099
       T2DM  |   .9920652   .0117165    -0.67   0.500      .969365    1.015297
 UNKNOWN_DM  |   .9956049   .0334239    -0.13   0.896     .9322039    1.063318
             |
    1.cancer |   .9949062   .0117336    -0.43   0.665     .9721726    1.018171
1.~r_disease |   1.000077   .0117858     0.01   0.995     .9772418    1.023445
    1.stroke |   1.013218    .011864     1.12   0.262     .9902296    1.036739
  1.dementia |   .9916005    .011683    -0.72   0.474     .9689647    1.014765
1.other_ne~o |    1.00548   .0118174     0.47   0.642     .9825834    1.028911
             |
      egfr60 |
   eGFR <60  |   1.066178   .0496886     1.37   0.169     .9731059    1.168152
      1.esrf |   .9832865   .0116084    -1.43   0.153     .9607957    1.006304
1.immunosu~d |   1.005447   .0098537     0.55   0.579     .9863189    1.024947
1.ra_sle_p~s |   1.001524   .0117869     0.13   0.897      .978686    1.024894
             |
hh_total_cat |
       6-10  |   .9832928   .0308041    -0.54   0.591     .9247341     1.04556
        11+  |   1.126738   .1431323     0.94   0.348     .8784011    1.445284
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model3_positivetest_eth5.ster not found)
file ./output/model3_positivetest_eth5.ster saved
(note: file ./output/model3_positivetest_eth5.dta not found)
file ./output/model3_positivetest_eth5.dta saved
(output written to ./output/estout_table2_eth5.txt)
hes
(11,780 observations deleted)

         failure _d:  hes
   analysis time _t:  (stime_hes-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,971                  Number of obs    =      66,971
No. of failures =       14,176
Time at risk    =      6224449
                                                LR chi2(5)       =        4.68
Log likelihood  =   -121378.85                  Prob > chi2      =      0.4560

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   .9969284   .0304193    -0.10   0.920     .9390555    1.058368
      Black  |   .9674098   .0299527    -1.07   0.285     .9104492    1.027934
      Mixed  |   1.014456    .030841     0.47   0.637     .9557749    1.076741
      Other  |   .9598448   .0295345    -1.33   0.183     .9036691    1.019513
    Unknown  |   .9865849   .0270189    -0.49   0.622      .935025    1.040988
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/crude_hes_eth5.ster not found)
file ./output/crude_hes_eth5.ster saved
(note: file ./output/crude_hes_eth5.dta not found)
file ./output/crude_hes_eth5.dta saved

         failure _d:  hes
   analysis time _t:  (stime_hes-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,971                  Number of obs    =      66,971
No. of failures =       14,176
Time at risk    =      6224449
                                                LR chi2(9)       =        7.98
Log likelihood  =    -121377.2                  Prob > chi2      =      0.5358

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   .9970999   .0304251    -0.10   0.924      .939216    1.058551
      Black  |   .9675988    .029959    -1.06   0.287     .9106263    1.028136
      Mixed  |   1.014791   .0308519     0.48   0.629     .9560884    1.077097
      Other  |   .9598664   .0295359    -1.33   0.183     .9036882    1.019537
    Unknown  |   .9866999   .0270222    -0.49   0.625     .9351336     1.04111
             |
        male |
       Male  |   .9805551   .0164776    -1.17   0.243     .9487857    1.013388
        age1 |   1.002937   .0023079     1.27   0.203     .9984233     1.00747
        age2 |   .9888611   .0082686    -1.34   0.180      .972787    1.005201
        age3 |   1.030363   .0228581     1.35   0.178     .9865217    1.076152
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model0_hes_eth5.ster not found)
file ./output/model0_hes_eth5.ster saved
(note: file ./output/model0_hes_eth5.dta not found)
file ./output/model0_hes_eth5.dta saved

         failure _d:  hes
   analysis time _t:  (stime_hes-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,971                  Number of obs    =      66,971
No. of failures =       14,176
Time at risk    =      6224449
                                                LR chi2(11)      =        8.12
Log likelihood  =   -121377.13                  Prob > chi2      =      0.7026

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   .9971336   .0304262    -0.09   0.925     .9392475    1.058587
      Black  |    .967612   .0299596    -1.06   0.288     .9106385     1.02815
      Mixed  |   1.014775   .0308515     0.48   0.629     .9560739    1.077081
      Other  |   .9598138   .0295351    -1.33   0.183     .9036372    1.019483
    Unknown  |   .9867099   .0270225    -0.49   0.625     .9351431     1.04112
             |
        male |
       Male  |   .9805352   .0164774    -1.17   0.242     .9487661    1.013368
        age1 |   1.002928   .0023081     1.27   0.204     .9984141    1.007462
        age2 |   .9888939   .0082694    -1.34   0.182     .9728183    1.005235
        age3 |   1.030276   .0228574     1.34   0.179     .9864364    1.076064
             |
         imd |
          4  |   1.001532   .0212598     0.07   0.943     .9607185     1.04408
5 most de..  |   1.010449   .0284999     0.37   0.712     .9561059     1.06788
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,971                  Number of obs    =      66,971
No. of failures =       14,176
Time at risk    =      6224449
                                                LR chi2(11)      =        8.12
Log likelihood  =   -121377.13                  Prob > chi2      =      0.7026

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   .9971336   .0304262    -0.09   0.925     .9392475    1.058587
      Black  |    .967612   .0299596    -1.06   0.288     .9106385     1.02815
      Mixed  |   1.014775   .0308515     0.48   0.629     .9560739    1.077081
      Other  |   .9598138   .0295351    -1.33   0.183     .9036372    1.019483
    Unknown  |   .9867099   .0270225    -0.49   0.625     .9351431     1.04112
             |
        male |
       Male  |   .9805352   .0164774    -1.17   0.242     .9487661    1.013368
        age1 |   1.002928   .0023081     1.27   0.204     .9984141    1.007462
        age2 |   .9888939   .0082694    -1.34   0.182     .9728183    1.005235
        age3 |   1.030276   .0228574     1.34   0.179     .9864364    1.076064
             |
         imd |
          4  |   1.001532   .0212598     0.07   0.943     .9607185     1.04408
5 most de..  |   1.010449   .0284999     0.37   0.712     .9561059     1.06788
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model1_hes_eth5.ster not found)
file ./output/model1_hes_eth5.ster saved
(note: file ./output/model1_hes_eth5.dta not found)
file ./output/model1_hes_eth5.dta saved

         failure _d:  hes
   analysis time _t:  (stime_hes-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,971                  Number of obs    =      66,971
No. of failures =       14,176
Time at risk    =      6224449
                                                LR chi2(44)      =       36.38
Log likelihood  =      -121363                  Prob > chi2      =      0.7858

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   .9989759   .0305669    -0.03   0.973      .940827    1.060719
      Black  |   .9673985   .0299615    -1.07   0.285     .9104219    1.027941
      Mixed  |   1.014516   .0308503     0.47   0.636     .9558167    1.076819
      Other  |   .9596104   .0295366    -1.34   0.180     .9034313    1.019283
    Unknown  |    .986435   .0270212    -0.50   0.618      .934871    1.040843
             |
        male |
       Male  |   .9797234   .0165429    -1.21   0.225     .9478305    1.012689
        age1 |   1.002666   .0023847     1.12   0.263     .9980031    1.007351
        age2 |   .9896175   .0084389    -1.22   0.221      .973215    1.006296
        age3 |   1.028633   .0231785     1.25   0.210     .9841926     1.07508
             |
         imd |
          4  |   1.001447   .0212651     0.07   0.946     .9606236    1.044005
5 most de..  |   1.009489   .0284825     0.33   0.738     .9551794    1.066886
             |
   bmicat_sa |
Normal (..)  |   1.056226   .0658861     0.88   0.381      .934674    1.193587
Overweig..)  |   1.001411   .0607837     0.02   0.981     .8890909    1.127921
Obese I ..)  |   1.006938   .0600374     0.12   0.908     .8958818     1.13176
Obese II..)  |   1.036186   .0615632     0.60   0.550     .9222843    1.164153
Obese II..)  |   .9975016   .0584824    -0.04   0.966     .8892188     1.11897
    Unknown  |   1.005302   .0594025     0.09   0.929     .8953646    1.128739
             |
    hba1ccat |
  >=6.5-7.4  |   .9848184   .0221069    -0.68   0.496     .9424291    1.029114
  >=7.5-7.9  |   .9561246    .034222    -1.25   0.210     .8913493    1.025607
    >=8-8.9  |   .9210103   .0303226    -2.50   0.012      .863456     .982401
        >=9  |   .9608354   .0415636    -0.92   0.356       .88273    1.045852
    Unknown  |   .9903063   .1339886    -0.07   0.943     .7596295    1.291033
             |
gp_consult~t |   1.000862   .0036429     0.24   0.813     .9937478    1.008028
             |
smoke_nomiss |
     Former  |   1.040471   .0618507     0.67   0.505     .9260419    1.169041
    Current  |   .9975843   .0257863    -0.09   0.925     .9483029    1.049427
             |
1.hyperten~n |   .9816239   .0207009    -0.88   0.379      .941878    1.023047
             |
      bp_cat |
High, sta..  |   .5735174   .4306657    -0.74   0.459     .1316323    2.498797
High, sta..  |   .4407137   .3120776    -1.16   0.247     .1100031    1.765665
    Unknown  |    .432594    .306526    -1.18   0.237     .1078795    1.734691
             |
    1.asthma |   1.001593   .0428728     0.04   0.970     .9209918    1.089247
1.~y_disease |   1.017404   .0212796     0.82   0.409     .9765399    1.059978
1.~c_disease |    1.04225   .0216015     2.00   0.046      1.00076    1.085459
             |
     dm_type |
       T1DM  |   .9361768   .0481573    -1.28   0.200     .8463924    1.035485
       T2DM  |   .9669876   .0205581    -1.58   0.114     .9275224    1.008132
 UNKNOWN_DM  |   .9468723   .0574369    -0.90   0.368     .8407326    1.066412
             |
    1.cancer |   .9837598   .0207937    -0.77   0.439     .9438374    1.025371
1.~r_disease |   1.025664   .0214698     1.21   0.226     .9844356    1.068619
    1.stroke |   1.011591   .0211853     0.55   0.582      .970909    1.053977
  1.dementia |   .9929545   .0209535    -0.34   0.738     .9527241    1.034884
1.other_ne~o |   1.000632   .0210369     0.03   0.976     .9602385    1.042725
             |
      egfr60 |
   eGFR <60  |   .9560367   .0813689    -0.53   0.597     .8091485     1.12959
      1.esrf |   1.007445   .0211384     0.35   0.724     .9668551    1.049739
1.immunosu~d |   1.000142   .0175352     0.01   0.994     .9663579    1.035108
1.ra_sle_p~s |   1.008511   .0211856     0.40   0.687     .9678312    1.050901
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,971                  Number of obs    =      66,971
No. of failures =       14,176
Time at risk    =      6224449
                                                LR chi2(44)      =       36.38
Log likelihood  =      -121363                  Prob > chi2      =      0.7858

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   .9989759   .0305669    -0.03   0.973      .940827    1.060719
      Black  |   .9673985   .0299615    -1.07   0.285     .9104219    1.027941
      Mixed  |   1.014516   .0308503     0.47   0.636     .9558167    1.076819
      Other  |   .9596104   .0295366    -1.34   0.180     .9034313    1.019283
    Unknown  |    .986435   .0270212    -0.50   0.618      .934871    1.040843
             |
        male |
       Male  |   .9797234   .0165429    -1.21   0.225     .9478305    1.012689
        age1 |   1.002666   .0023847     1.12   0.263     .9980031    1.007351
        age2 |   .9896175   .0084389    -1.22   0.221      .973215    1.006296
        age3 |   1.028633   .0231785     1.25   0.210     .9841926     1.07508
             |
         imd |
          4  |   1.001447   .0212651     0.07   0.946     .9606236    1.044005
5 most de..  |   1.009489   .0284825     0.33   0.738     .9551794    1.066886
             |
   bmicat_sa |
Normal (..)  |   1.056226   .0658861     0.88   0.381      .934674    1.193587
Overweig..)  |   1.001411   .0607837     0.02   0.981     .8890909    1.127921
Obese I ..)  |   1.006938   .0600374     0.12   0.908     .8958818     1.13176
Obese II..)  |   1.036186   .0615632     0.60   0.550     .9222843    1.164153
Obese II..)  |   .9975016   .0584824    -0.04   0.966     .8892188     1.11897
    Unknown  |   1.005302   .0594025     0.09   0.929     .8953646    1.128739
             |
    hba1ccat |
  >=6.5-7.4  |   .9848184   .0221069    -0.68   0.496     .9424291    1.029114
  >=7.5-7.9  |   .9561246    .034222    -1.25   0.210     .8913493    1.025607
    >=8-8.9  |   .9210103   .0303226    -2.50   0.012      .863456     .982401
        >=9  |   .9608354   .0415636    -0.92   0.356       .88273    1.045852
    Unknown  |   .9903063   .1339886    -0.07   0.943     .7596295    1.291033
             |
gp_consult~t |   1.000862   .0036429     0.24   0.813     .9937478    1.008028
             |
smoke_nomiss |
     Former  |   1.040471   .0618507     0.67   0.505     .9260419    1.169041
    Current  |   .9975843   .0257863    -0.09   0.925     .9483029    1.049427
             |
1.hyperten~n |   .9816239   .0207009    -0.88   0.379      .941878    1.023047
             |
      bp_cat |
High, sta..  |   .5735174   .4306657    -0.74   0.459     .1316323    2.498797
High, sta..  |   .4407137   .3120776    -1.16   0.247     .1100031    1.765665
    Unknown  |    .432594    .306526    -1.18   0.237     .1078795    1.734691
             |
    1.asthma |   1.001593   .0428728     0.04   0.970     .9209918    1.089247
1.~y_disease |   1.017404   .0212796     0.82   0.409     .9765399    1.059978
1.~c_disease |    1.04225   .0216015     2.00   0.046      1.00076    1.085459
             |
     dm_type |
       T1DM  |   .9361768   .0481573    -1.28   0.200     .8463924    1.035485
       T2DM  |   .9669876   .0205581    -1.58   0.114     .9275224    1.008132
 UNKNOWN_DM  |   .9468723   .0574369    -0.90   0.368     .8407326    1.066412
             |
    1.cancer |   .9837598   .0207937    -0.77   0.439     .9438374    1.025371
1.~r_disease |   1.025664   .0214698     1.21   0.226     .9844356    1.068619
    1.stroke |   1.011591   .0211853     0.55   0.582      .970909    1.053977
  1.dementia |   .9929545   .0209535    -0.34   0.738     .9527241    1.034884
1.other_ne~o |   1.000632   .0210369     0.03   0.976     .9602385    1.042725
             |
      egfr60 |
   eGFR <60  |   .9560367   .0813689    -0.53   0.597     .8091485     1.12959
      1.esrf |   1.007445   .0211384     0.35   0.724     .9668551    1.049739
1.immunosu~d |   1.000142   .0175352     0.01   0.994     .9663579    1.035108
1.ra_sle_p~s |   1.008511   .0211856     0.40   0.687     .9678312    1.050901
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model2_hes_eth5.ster not found)
file ./output/model2_hes_eth5.ster saved
(note: file ./output/model2_hes_eth5.dta not found)
file ./output/model2_hes_eth5.dta saved

         failure _d:  hes
   analysis time _t:  (stime_hes-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,971                  Number of obs    =      66,971
No. of failures =       14,176
Time at risk    =      6224449
                                                LR chi2(46)      =       36.69
Log likelihood  =   -121362.85                  Prob > chi2      =      0.8349

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   .9988425   .0305647    -0.04   0.970     .9406977    1.060581
      Black  |   .9673765   .0299613    -1.07   0.284     .9104003    1.027919
      Mixed  |   1.014456   .0308488     0.47   0.637     .9557605    1.076757
      Other  |   .9596127   .0295367    -1.34   0.180     .9034334    1.019286
    Unknown  |   .9863792   .0270208    -0.50   0.617     .9348161    1.040786
             |
        male |
       Male  |   .9796672   .0165423    -1.22   0.224     .9477756    1.012632
        age1 |   1.002671   .0023847     1.12   0.262     .9980079    1.007356
        age2 |   .9896016   .0084389    -1.23   0.220     .9731992     1.00628
        age3 |   1.028673   .0231796     1.25   0.210     .9842306    1.075123
             |
         imd |
          4  |   1.001497   .0212663     0.07   0.944     .9606711    1.044058
5 most de..  |    1.00949   .0284828     0.33   0.738     .9551807    1.066888
             |
   bmicat_sa |
Normal (..)  |   1.056185    .065884     0.88   0.381     .9346364    1.193541
Overweig..)  |   1.001343   .0607819     0.02   0.982     .8890261    1.127849
Obese I ..)  |   1.006896    .060036     0.12   0.908     .8958433    1.131716
Obese II..)  |   1.036104   .0615599     0.60   0.551     .9222085    1.164065
Obese II..)  |   .9974597   .0584817    -0.04   0.965     .8891783    1.118927
    Unknown  |   1.005221   .0593987     0.09   0.930     .8952908     1.12865
             |
    hba1ccat |
  >=6.5-7.4  |   .9847457   .0221057    -0.68   0.493     .9423587    1.029039
  >=7.5-7.9  |   .9559794   .0342178    -1.26   0.208     .8912121    1.025453
    >=8-8.9  |   .9210277   .0303235    -2.50   0.012     .8634717    .9824203
        >=9  |   .9608091   .0415626    -0.92   0.355     .8827057    1.045823
    Unknown  |   .9900242   .1339515    -0.07   0.941     .7594115    1.290668
             |
gp_consult~t |   1.000864   .0036431     0.24   0.812     .9937495     1.00803
             |
smoke_nomiss |
     Former  |   1.040438   .0618495     0.67   0.505     .9260111    1.169006
    Current  |   .9975688   .0257859    -0.09   0.925     .9482882     1.04941
             |
1.hyperten~n |   .9815794   .0207001    -0.88   0.378     .9418349    1.023001
             |
      bp_cat |
High, sta..  |     .57432   .4312709    -0.74   0.460     .1318153    2.502315
High, sta..  |   .4410577   .3123218    -1.16   0.248     .1100886    1.767048
    Unknown  |   .4329416    .306773    -1.18   0.237     .1079659     1.73609
             |
    1.asthma |   1.001526   .0428717     0.04   0.972     .9209271    1.089178
1.~y_disease |   1.017365    .021279     0.82   0.410     .9765022    1.059938
1.~c_disease |   1.042181   .0216017     1.99   0.046     1.000691    1.085392
             |
     dm_type |
       T1DM  |   .9362398   .0481644    -1.28   0.200     .8464425    1.035563
       T2DM  |   .9670097   .0205587    -1.58   0.115     .9275434    1.008155
 UNKNOWN_DM  |   .9469087   .0574393    -0.90   0.368     .8407646    1.066453
             |
    1.cancer |   .9837463   .0207936    -0.78   0.438     .9438243    1.025357
1.~r_disease |    1.02563   .0214692     1.21   0.227     .9844022    1.068584
    1.stroke |   1.011579    .021185     0.55   0.582     .9708982    1.053965
  1.dementia |   .9929765   .0209541    -0.33   0.738     .9527451    1.034907
1.other_ne~o |    1.00063   .0210369     0.03   0.976     .9602362    1.042723
             |
      egfr60 |
   eGFR <60  |   .9560156   .0813674    -0.53   0.597     .8091302    1.129566
      1.esrf |   1.007438   .0211386     0.35   0.724     .9668471    1.049732
1.immunosu~d |   1.000092    .017535     0.01   0.996     .9663074    1.035057
1.ra_sle_p~s |   1.008459   .0211853     0.40   0.688     .9677793    1.050848
             |
hh_total_cat |
       6-10  |   1.031053    .058769     0.54   0.592     .9220689    1.152919
        11+  |   .9975238   .2357919    -0.01   0.992     .6276516     1.58536
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model3_hes_eth5.ster not found)
file ./output/model3_hes_eth5.ster saved
(note: file ./output/model3_hes_eth5.dta not found)
file ./output/model3_hes_eth5.dta saved
(output written to ./output/estout_table2_eth5.txt)
icu
(11,780 observations deleted)

         failure _d:  icu
   analysis time _t:  (stime_icu-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,971                  Number of obs    =      66,971
No. of failures =        7,083
Time at risk    =      6936693
                                                LR chi2(5)       =       10.52
Log likelihood  =   -60221.367                  Prob > chi2      =      0.0617

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   .9836478    .041748    -0.39   0.698     .9051341    1.068972
      Black  |   .9574182   .0412601    -1.01   0.313     .8798709      1.0418
      Mixed  |   .9480636   .0406309    -1.24   0.213     .8716814    1.031139
      Other  |   .9214207   .0397164    -1.90   0.058     .8467753    1.002646
    Unknown  |   .8982812   .0347244    -2.78   0.006      .832737    .9689844
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/crude_icu_eth5.ster not found)
file ./output/crude_icu_eth5.ster saved
(note: file ./output/crude_icu_eth5.dta not found)
file ./output/crude_icu_eth5.dta saved

         failure _d:  icu
   analysis time _t:  (stime_icu-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,971                  Number of obs    =      66,971
No. of failures =        7,083
Time at risk    =      6936693
                                                LR chi2(9)       =       14.17
Log likelihood  =   -60219.545                  Prob > chi2      =      0.1165

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |    .984098   .0417683    -0.38   0.706     .9055462    1.069464
      Black  |   .9573129    .041256    -1.01   0.311     .8797734    1.041686
      Mixed  |   .9483351   .0406434    -1.24   0.216     .8719293    1.031436
      Other  |   .9215254   .0397216    -1.90   0.058     .8468705    1.002761
    Unknown  |   .8982053   .0347219    -2.78   0.005     .8326657    .9689035
             |
        male |
       Male  |    1.02852   .0244452     1.18   0.237     .9817073    1.077566
        age1 |   1.002841   .0032538     0.87   0.382     .9964838    1.009239
        age2 |   .9869937   .0116553    -1.11   0.268     .9644121    1.010104
        age3 |   1.034455   .0324435     1.08   0.280     .9727816    1.100038
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model0_icu_eth5.ster not found)
file ./output/model0_icu_eth5.ster saved
(note: file ./output/model0_icu_eth5.dta not found)
file ./output/model0_icu_eth5.dta saved

         failure _d:  icu
   analysis time _t:  (stime_icu-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,971                  Number of obs    =      66,971
No. of failures =        7,083
Time at risk    =      6936693
                                                LR chi2(11)      =       15.58
Log likelihood  =   -60218.837                  Prob > chi2      =      0.1573

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   .9841631   .0417713    -0.38   0.707     .9056056    1.069535
      Black  |   .9575362   .0412661    -1.01   0.314     .8799778     1.04193
      Mixed  |   .9482478   .0406399    -1.24   0.215     .8718487    1.031342
      Other  |   .9217536   .0397325    -1.89   0.059     .8470782    1.003012
    Unknown  |   .8983152   .0347264    -2.77   0.006     .8327673    .9690225
             |
        male |
       Male  |   1.028397   .0244428     1.18   0.239     .9815887    1.077437
        age1 |   1.002821    .003254     0.87   0.385     .9964637    1.009219
        age2 |   .9870672   .0116572    -1.10   0.270     .9644818    1.010181
        age3 |    1.03424   .0324396     1.07   0.283     .9725745    1.099816
             |
         imd |
          4  |   1.035854   .0308305     1.18   0.237     .9771561    1.098078
5 most de..  |   1.001867   .0401868     0.05   0.963     .9261192    1.083811
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,971                  Number of obs    =      66,971
No. of failures =        7,083
Time at risk    =      6936693
                                                LR chi2(11)      =       15.58
Log likelihood  =   -60218.837                  Prob > chi2      =      0.1573

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   .9841631   .0417713    -0.38   0.707     .9056056    1.069535
      Black  |   .9575362   .0412661    -1.01   0.314     .8799778     1.04193
      Mixed  |   .9482478   .0406399    -1.24   0.215     .8718487    1.031342
      Other  |   .9217536   .0397325    -1.89   0.059     .8470782    1.003012
    Unknown  |   .8983152   .0347264    -2.77   0.006     .8327673    .9690225
             |
        male |
       Male  |   1.028397   .0244428     1.18   0.239     .9815887    1.077437
        age1 |   1.002821    .003254     0.87   0.385     .9964637    1.009219
        age2 |   .9870672   .0116572    -1.10   0.270     .9644818    1.010181
        age3 |    1.03424   .0324396     1.07   0.283     .9725745    1.099816
             |
         imd |
          4  |   1.035854   .0308305     1.18   0.237     .9771561    1.098078
5 most de..  |   1.001867   .0401868     0.05   0.963     .9261192    1.083811
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model1_icu_eth5.ster not found)
file ./output/model1_icu_eth5.ster saved
(note: file ./output/model1_icu_eth5.dta not found)
file ./output/model1_icu_eth5.dta saved

         failure _d:  icu
   analysis time _t:  (stime_icu-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,971                  Number of obs    =      66,971
No. of failures =        7,083
Time at risk    =      6936693
                                                LR chi2(44)      =       70.95
Log likelihood  =   -60191.152                  Prob > chi2      =      0.0062

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   .9824582   .0418161    -0.42   0.678     .9038257    1.067932
      Black  |   .9582993   .0413082    -0.99   0.323     .8806624     1.04278
      Mixed  |   .9475041   .0406171    -1.26   0.208     .8711486    1.030552
      Other  |   .9216255   .0397404    -1.89   0.058     .8469363    1.002901
    Unknown  |   .8977271   .0347133    -2.79   0.005     .8322045    .9684085
             |
        male |
       Male  |   1.031544   .0246552     1.30   0.194     .9843349    1.081017
        age1 |   1.003348   .0033631     1.00   0.319     .9967776    1.009961
        age2 |   .9856405   .0118654    -1.20   0.230      .962657    1.009173
        age3 |   1.037454   .0330388     1.15   0.248     .9746789    1.104273
             |
         imd |
          4  |   1.034556   .0308043     1.14   0.254     .9759091    1.096728
5 most de..  |   1.000998   .0401648     0.02   0.980     .9252924    1.082898
             |
   bmicat_sa |
Normal (..)  |   1.153199   .1088432     1.51   0.131     .9584397    1.387535
Overweig..)  |   1.186226   .1085419     1.87   0.062     .9914727    1.419233
Obese I ..)  |   1.234741    .111035     2.34   0.019     1.035216    1.472722
Obese II..)  |   1.106167   .0998523     1.12   0.264     .9267954    1.320255
Obese II..)  |   1.223422   .1084985     2.27   0.023     1.028225    1.455676
    Unknown  |   1.213963   .1084664     2.17   0.030     1.018946    1.446304
             |
    hba1ccat |
  >=6.5-7.4  |   .9673844   .0309231    -1.04   0.300     .9086358    1.029931
  >=7.5-7.9  |   .9354158   .0481292    -1.30   0.194     .8456847    1.034668
    >=8-8.9  |   .9864963   .0449137    -0.30   0.765     .9022805    1.078573
        >=9  |   .9723776   .0590978    -0.46   0.645     .8631808    1.095388
    Unknown  |   .9444446   .1823961    -0.30   0.767     .6468267    1.379002
             |
gp_consult~t |   .9970954   .0051434    -0.56   0.573     .9870652    1.007227
             |
smoke_nomiss |
     Former  |   .6981993    .069728    -3.60   0.000     .5740786     .849156
    Current  |   1.005178   .0366218     0.14   0.887     .9359031     1.07958
             |
1.hyperten~n |   .9618786   .0288304    -1.30   0.195     .9069998    1.020078
             |
      bp_cat |
High, sta..  |    .357188   .3917536    -0.94   0.348      .041622    3.065282
High, sta..  |   .4827465   .4834194    -0.73   0.467     .0678159    3.436427
    Unknown  |   .4690007   .4699686    -0.76   0.450     .0657984    3.342965
             |
    1.asthma |   .9564341   .0588512    -0.72   0.469     .8477718    1.079024
1.~y_disease |   .9991694   .0297702    -0.03   0.978      .942492    1.059255
1.~c_disease |    .986354   .0294103    -0.46   0.645     .9303629    1.045715
             |
     dm_type |
       T1DM  |   .8226453   .0639163    -2.51   0.012     .7064439    .9579605
       T2DM  |   .9790228   .0293308    -0.71   0.479     .9231907    1.038232
 UNKNOWN_DM  |   .8670801   .0775678    -1.59   0.111     .7276322    1.033253
             |
    1.cancer |   1.001126    .029843     0.04   0.970     .9443104    1.061359
1.~r_disease |   .9656877   .0291066    -1.16   0.247     .9102921    1.024454
    1.stroke |   .9965445   .0296543    -0.12   0.907     .9400856    1.056394
  1.dementia |   .9478942   .0287389    -1.76   0.078     .8932078    1.005929
1.other_ne~o |   1.063127   .0310381     2.10   0.036     1.004001    1.125735
             |
      egfr60 |
   eGFR <60  |   1.143755   .1318205     1.17   0.244     .9124935    1.433626
      1.esrf |    .993893   .0296436    -0.21   0.837     .9374582    1.053725
1.immunosu~d |   .9813926   .0244081    -0.76   0.450     .9347009    1.030417
1.ra_sle_p~s |   1.003588   .0298781     0.12   0.904     .9467037     1.06389
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,971                  Number of obs    =      66,971
No. of failures =        7,083
Time at risk    =      6936693
                                                LR chi2(44)      =       70.95
Log likelihood  =   -60191.152                  Prob > chi2      =      0.0062

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   .9824582   .0418161    -0.42   0.678     .9038257    1.067932
      Black  |   .9582993   .0413082    -0.99   0.323     .8806624     1.04278
      Mixed  |   .9475041   .0406171    -1.26   0.208     .8711486    1.030552
      Other  |   .9216255   .0397404    -1.89   0.058     .8469363    1.002901
    Unknown  |   .8977271   .0347133    -2.79   0.005     .8322045    .9684085
             |
        male |
       Male  |   1.031544   .0246552     1.30   0.194     .9843349    1.081017
        age1 |   1.003348   .0033631     1.00   0.319     .9967776    1.009961
        age2 |   .9856405   .0118654    -1.20   0.230      .962657    1.009173
        age3 |   1.037454   .0330388     1.15   0.248     .9746789    1.104273
             |
         imd |
          4  |   1.034556   .0308043     1.14   0.254     .9759091    1.096728
5 most de..  |   1.000998   .0401648     0.02   0.980     .9252924    1.082898
             |
   bmicat_sa |
Normal (..)  |   1.153199   .1088432     1.51   0.131     .9584397    1.387535
Overweig..)  |   1.186226   .1085419     1.87   0.062     .9914727    1.419233
Obese I ..)  |   1.234741    .111035     2.34   0.019     1.035216    1.472722
Obese II..)  |   1.106167   .0998523     1.12   0.264     .9267954    1.320255
Obese II..)  |   1.223422   .1084985     2.27   0.023     1.028225    1.455676
    Unknown  |   1.213963   .1084664     2.17   0.030     1.018946    1.446304
             |
    hba1ccat |
  >=6.5-7.4  |   .9673844   .0309231    -1.04   0.300     .9086358    1.029931
  >=7.5-7.9  |   .9354158   .0481292    -1.30   0.194     .8456847    1.034668
    >=8-8.9  |   .9864963   .0449137    -0.30   0.765     .9022805    1.078573
        >=9  |   .9723776   .0590978    -0.46   0.645     .8631808    1.095388
    Unknown  |   .9444446   .1823961    -0.30   0.767     .6468267    1.379002
             |
gp_consult~t |   .9970954   .0051434    -0.56   0.573     .9870652    1.007227
             |
smoke_nomiss |
     Former  |   .6981993    .069728    -3.60   0.000     .5740786     .849156
    Current  |   1.005178   .0366218     0.14   0.887     .9359031     1.07958
             |
1.hyperten~n |   .9618786   .0288304    -1.30   0.195     .9069998    1.020078
             |
      bp_cat |
High, sta..  |    .357188   .3917536    -0.94   0.348      .041622    3.065282
High, sta..  |   .4827465   .4834194    -0.73   0.467     .0678159    3.436427
    Unknown  |   .4690007   .4699686    -0.76   0.450     .0657984    3.342965
             |
    1.asthma |   .9564341   .0588512    -0.72   0.469     .8477718    1.079024
1.~y_disease |   .9991694   .0297702    -0.03   0.978      .942492    1.059255
1.~c_disease |    .986354   .0294103    -0.46   0.645     .9303629    1.045715
             |
     dm_type |
       T1DM  |   .8226453   .0639163    -2.51   0.012     .7064439    .9579605
       T2DM  |   .9790228   .0293308    -0.71   0.479     .9231907    1.038232
 UNKNOWN_DM  |   .8670801   .0775678    -1.59   0.111     .7276322    1.033253
             |
    1.cancer |   1.001126    .029843     0.04   0.970     .9443104    1.061359
1.~r_disease |   .9656877   .0291066    -1.16   0.247     .9102921    1.024454
    1.stroke |   .9965445   .0296543    -0.12   0.907     .9400856    1.056394
  1.dementia |   .9478942   .0287389    -1.76   0.078     .8932078    1.005929
1.other_ne~o |   1.063127   .0310381     2.10   0.036     1.004001    1.125735
             |
      egfr60 |
   eGFR <60  |   1.143755   .1318205     1.17   0.244     .9124935    1.433626
      1.esrf |    .993893   .0296436    -0.21   0.837     .9374582    1.053725
1.immunosu~d |   .9813926   .0244081    -0.76   0.450     .9347009    1.030417
1.ra_sle_p~s |   1.003588   .0298781     0.12   0.904     .9467037     1.06389
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model2_icu_eth5.ster not found)
file ./output/model2_icu_eth5.ster saved
(note: file ./output/model2_icu_eth5.dta not found)
file ./output/model2_icu_eth5.dta saved

         failure _d:  icu
   analysis time _t:  (stime_icu-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,971                  Number of obs    =      66,971
No. of failures =        7,083
Time at risk    =      6936693
                                                LR chi2(46)      =       72.68
Log likelihood  =    -60190.29                  Prob > chi2      =      0.0073

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |    .983005   .0418419    -0.40   0.687     .9043241    1.068532
      Black  |   .9586408   .0413237    -0.98   0.327     .8809749    1.043154
      Mixed  |   .9479072   .0406365    -1.25   0.212     .8715154    1.030995
      Other  |    .921812   .0397486    -1.89   0.059     .8471074    1.003105
    Unknown  |   .8982068   .0347342    -2.78   0.006      .832645     .968931
             |
        male |
       Male  |   1.031508   .0246547     1.30   0.194     .9843003     1.08098
        age1 |   1.003351   .0033631     1.00   0.318     .9967807    1.009964
        age2 |   .9856413    .011865    -1.20   0.230     .9626584    1.009173
        age3 |   1.037461   .0330374     1.15   0.248     .9746879    1.104276
             |
         imd |
          4  |   1.034489   .0308028     1.14   0.255      .975844    1.096657
5 most de..  |   1.001093   .0401688     0.03   0.978     .9253798    1.083001
             |
   bmicat_sa |
Normal (..)  |   1.152677   .1087942     1.51   0.132     .9580052    1.386907
Overweig..)  |   1.185252   .1084549     1.86   0.063     .9906558    1.418074
Obese I ..)  |   1.233925   .1109626     2.34   0.019      1.03453    1.471751
Obese II..)  |   1.105393    .099784     1.11   0.267     .9261443    1.319334
Obese II..)  |    1.22239   .1084086     2.26   0.024     1.027354    1.454451
    Unknown  |   1.213158   .1083968     2.16   0.031     1.018267     1.44535
             |
    hba1ccat |
  >=6.5-7.4  |   .9673182   .0309213    -1.04   0.299      .908573    1.029862
  >=7.5-7.9  |   .9352991   .0481248    -1.30   0.194     .8455765    1.034542
    >=8-8.9  |   .9867514   .0449254    -0.29   0.770     .9025136    1.078852
        >=9  |   .9722657   .0590914    -0.46   0.644     .8630808    1.095263
    Unknown  |   .9441248   .1823355    -0.30   0.766     .6466061    1.378539
             |
gp_consult~t |   .9970455   .0051433    -0.57   0.566     .9870157    1.007177
             |
smoke_nomiss |
     Former  |   .6978099   .0696896    -3.60   0.000     .5737577    .8486835
    Current  |   1.005129   .0366201     0.14   0.888     .9358582    1.079528
             |
1.hyperten~n |   .9619751   .0288334    -1.29   0.196     .9070906     1.02018
             |
      bp_cat |
High, sta..  |   .3567179   .3912403    -0.94   0.347     .0415667    3.061286
High, sta..  |   .4826733    .483347    -0.73   0.467     .0678053     3.43592
    Unknown  |   .4689442   .4699132    -0.76   0.450     .0657901    3.342578
             |
    1.asthma |   .9571195   .0588955    -0.71   0.476     .8483758    1.079802
1.~y_disease |   .9993417   .0297756    -0.02   0.982     .9426539    1.059438
1.~c_disease |   .9867135    .029422    -0.45   0.654     .9307001    1.046098
             |
     dm_type |
       T1DM  |   .8235437   .0639893    -2.50   0.012       .70721     .959014
       T2DM  |   .9790476   .0293317    -0.71   0.480     .9232138    1.038258
 UNKNOWN_DM  |   .8673595   .0775932    -1.59   0.112      .727866    1.033587
             |
    1.cancer |   1.001058    .029841     0.04   0.972     .9442467    1.061288
1.~r_disease |   .9657944   .0291103    -1.15   0.248     .9103918    1.024569
    1.stroke |   .9965792   .0296555    -0.12   0.908     .9401179    1.056431
  1.dementia |   .9478277   .0287369    -1.77   0.077     .8931453    1.005858
1.other_ne~o |   1.063004   .0310347     2.09   0.036     1.003884    1.125605
             |
      egfr60 |
   eGFR <60  |   1.143376   .1317787     1.16   0.245     .9121886    1.433156
      1.esrf |      .9937   .0296382    -0.21   0.832     .9372754    1.053521
1.immunosu~d |   .9816586   .0244155    -0.74   0.457     .9349527    1.030698
1.ra_sle_p~s |   1.003901   .0298883     0.13   0.896     .9469971    1.064224
             |
hh_total_cat |
       6-10  |   .9669607   .0757493    -0.43   0.668     .8293307    1.127431
        11+  |   .6060818   .2519336    -1.20   0.228     .2683535    1.368848
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model3_icu_eth5.ster not found)
file ./output/model3_icu_eth5.ster saved
(note: file ./output/model3_icu_eth5.dta not found)
file ./output/model3_icu_eth5.dta saved
(output written to ./output/estout_table2_eth5.txt)
onscoviddeath
(11,780 observations deleted)

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,971                  Number of obs    =      66,971
No. of failures =        4,027
Time at risk    =      7021368
                                                LR chi2(5)       =        1.50
Log likelihood  =   -34955.681                  Prob > chi2      =      0.9131

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   1.023744   .0593426     0.40   0.686     .9137987    1.146918
      Black  |    1.03639    .060375     0.61   0.539     .9245632    1.161743
      Mixed  |   1.054418   .0607146     0.92   0.357     .9418884    1.180391
      Other  |   1.051333   .0605362     0.87   0.385     .9391342    1.176936
    Unknown  |   1.010612   .0527041     0.20   0.840     .9124176    1.119374
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/crude_onscoviddeath_eth5.ster not found)
file ./output/crude_onscoviddeath_eth5.ster saved
(note: file ./output/crude_onscoviddeath_eth5.dta not found)
file ./output/crude_onscoviddeath_eth5.dta saved

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,971                  Number of obs    =      66,971
No. of failures =        4,027
Time at risk    =      7021368
                                                LR chi2(9)       =        5.11
Log likelihood  =   -34953.878                  Prob > chi2      =      0.8250

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   1.023901   .0593526     0.41   0.684     .9139368    1.147095
      Black  |   1.036444   .0603784     0.61   0.539       .92461    1.161804
      Mixed  |   1.054408   .0607149     0.92   0.358     .9418787    1.180382
      Other  |   1.051212   .0605304     0.87   0.386     .9390245    1.176803
    Unknown  |   1.010676   .0527077     0.20   0.839     .9124753    1.119446
             |
        male |
       Male  |   .9562693   .0301612    -1.42   0.156     .8989446     1.01725
        age1 |   1.001867   .0042956     0.43   0.664     .9934829    1.010322
        age2 |   .9895136   .0154881    -0.67   0.501     .9596185     1.02034
        age3 |   1.027801   .0427854     0.66   0.510      .947273    1.115175
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model0_onscoviddeath_eth5.ster not found)
file ./output/model0_onscoviddeath_eth5.ster saved
(note: file ./output/model0_onscoviddeath_eth5.dta not found)
file ./output/model0_onscoviddeath_eth5.dta saved

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,971                  Number of obs    =      66,971
No. of failures =        4,027
Time at risk    =      7021368
                                                LR chi2(11)      =        9.99
Log likelihood  =   -34951.433                  Prob > chi2      =      0.5309

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   1.023515   .0593305     0.40   0.688     .9135923    1.146664
      Black  |   1.036119   .0603601     0.61   0.542     .9243199    1.161441
      Mixed  |   1.054872    .060742     0.93   0.354     .9422918    1.180902
      Other  |   1.051471    .060547     0.87   0.383     .9392528    1.177097
    Unknown  |   1.010444   .0526959     0.20   0.842     .9122647    1.119189
             |
        male |
       Male  |   .9564903   .0301684    -1.41   0.158     .8991519    1.017485
        age1 |    1.00196   .0042959     0.46   0.648     .9935753    1.010415
        age2 |   .9891619   .0154821    -0.70   0.486     .9592782    1.019977
        age3 |   1.028754   .0428237     0.68   0.496     .9481535    1.116206
             |
         imd |
          4  |   .9554705   .0383614    -1.13   0.257     .8831656    1.033695
5 most de..  |   .8939349   .0494483    -2.03   0.043     .8020868    .9963007
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,971                  Number of obs    =      66,971
No. of failures =        4,027
Time at risk    =      7021368
                                                LR chi2(11)      =        9.99
Log likelihood  =   -34951.433                  Prob > chi2      =      0.5309

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   1.023515   .0593305     0.40   0.688     .9135923    1.146664
      Black  |   1.036119   .0603601     0.61   0.542     .9243199    1.161441
      Mixed  |   1.054872    .060742     0.93   0.354     .9422918    1.180902
      Other  |   1.051471    .060547     0.87   0.383     .9392528    1.177097
    Unknown  |   1.010444   .0526959     0.20   0.842     .9122647    1.119189
             |
        male |
       Male  |   .9564903   .0301684    -1.41   0.158     .8991519    1.017485
        age1 |    1.00196   .0042959     0.46   0.648     .9935753    1.010415
        age2 |   .9891619   .0154821    -0.70   0.486     .9592782    1.019977
        age3 |   1.028754   .0428237     0.68   0.496     .9481535    1.116206
             |
         imd |
          4  |   .9554705   .0383614    -1.13   0.257     .8831656    1.033695
5 most de..  |   .8939349   .0494483    -2.03   0.043     .8020868    .9963007
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model1_onscoviddeath_eth5.ster not found)
file ./output/model1_onscoviddeath_eth5.ster saved
(note: file ./output/model1_onscoviddeath_eth5.dta not found)
file ./output/model1_onscoviddeath_eth5.dta saved

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,971                  Number of obs    =      66,971
No. of failures =        4,027
Time at risk    =      7021368
                                                LR chi2(43)      =       54.59
Log likelihood  =   -34929.133                  Prob > chi2      =      0.1106

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   1.016436   .0590721     0.28   0.779     .9070076    1.139067
      Black  |   1.036323   .0603832     0.61   0.540     .9244817    1.161694
      Mixed  |   1.052596   .0606216     0.89   0.373     .9402401    1.178377
      Other  |   1.052649   .0606274     0.89   0.373      .940283    1.178443
    Unknown  |    1.01114   .0527451     0.21   0.832     .9128711    1.119988
             |
        male |
       Male  |   .9598313   .0304361    -1.29   0.196     .9019936    1.021378
        age1 |   1.002566   .0044413     0.58   0.563     .9938985    1.011308
        age2 |   .9873841   .0157542    -0.80   0.426     .9569841     1.01875
        age3 |   1.032847   .0436516     0.76   0.444     .9507388    1.122045
             |
         imd |
          4  |   .9550929   .0383564    -1.14   0.253     .8827983    1.033308
5 most de..  |   .8931393   .0494175    -2.04   0.041     .8013497    .9954428
             |
   bmicat_sa |
Normal (..)  |   1.128263   .1425812     0.95   0.340     .8807288    1.445369
Overweig..)  |   1.182745   .1447504     1.37   0.170     .9305008    1.503369
Obese I ..)  |   1.143069    .138044     1.11   0.268     .9021447    1.448334
Obese II..)  |   1.205876   .1449763     1.56   0.119     .9527235    1.526294
Obese II..)  |   1.236182   .1466081     1.79   0.074     .9797878     1.55967
    Unknown  |   1.207577   .1442956     1.58   0.114     .9554394    1.526253
             |
    hba1ccat |
  >=6.5-7.4  |   .9374863     .04027    -1.50   0.133     .8617897    1.019832
  >=7.5-7.9  |   .9440353   .0640777    -0.85   0.396     .8264408    1.078362
    >=8-8.9  |   1.028513   .0607148     0.48   0.634     .9161399    1.154669
        >=9  |   1.039513   .0814381     0.49   0.621     .8915483    1.212036
    Unknown  |   .9948899   .2495785    -0.02   0.984     .6084744    1.626701
             |
gp_consult~t |    .987516    .006792    -1.83   0.068     .9742933    1.000918
             |
smoke_nomiss |
     Former  |   .9721421   .1120688    -0.25   0.806      .775538    1.218587
    Current  |   1.068631   .0504364     1.41   0.160     .9742117    1.172201
             |
1.hyperten~n |   .9780958   .0387747    -0.56   0.576     .9049762    1.057123
             |
      bp_cat |
High, sta..  |   1.07e+08          .        .       .            .           .
High, sta..  |   6.86e+07   2.81e+07    44.12   0.000     3.08e+07    1.53e+08
    Unknown  |   6.94e+07   2.86e+07    43.86   0.000     3.10e+07    1.56e+08
             |
    1.asthma |   .9375515   .0777954    -0.78   0.437     .7968284    1.103127
1.~y_disease |   1.094693   .0420561     2.35   0.019     1.015291    1.180304
1.~c_disease |   1.077344   .0414592     1.94   0.053     .9990745    1.161746
             |
     dm_type |
       T1DM  |   1.153325   .1022424     1.61   0.108     .9693769     1.37218
       T2DM  |   1.016583   .0401515     0.42   0.677     .9408565    1.098405
 UNKNOWN_DM  |   1.075548   .1170081     0.67   0.503     .8690173    1.331164
             |
    1.cancer |   1.060666   .0411423     1.52   0.129     .9830173    1.144447
1.~r_disease |   1.058614   .0411325     1.47   0.143     .9809887    1.142381
    1.stroke |   1.083853   .0416936     2.09   0.036     1.005139     1.16873
  1.dementia |   1.058018   .0411231     1.45   0.147     .9804116    1.141767
1.other_ne~o |   .9898184   .0391462    -0.26   0.796     .9159915    1.069596
             |
      egfr60 |
   eGFR <60  |   1.129889   .1688523     0.82   0.414     .8430069      1.5144
      1.esrf |   .9629659   .0384298    -0.95   0.344     .8905152    1.041311
1.immunosu~d |   .9941282   .0327281    -0.18   0.858     .9320081    1.060389
1.ra_sle_p~s |   1.059888   .0411619     1.50   0.134     .9822063    1.143714
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,971                  Number of obs    =      66,971
No. of failures =        4,027
Time at risk    =      7021368
                                                LR chi2(43)      =       54.59
Log likelihood  =   -34929.133                  Prob > chi2      =      0.1106

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   1.016436   .0590721     0.28   0.779     .9070076    1.139067
      Black  |   1.036323   .0603832     0.61   0.540     .9244817    1.161694
      Mixed  |   1.052596   .0606216     0.89   0.373     .9402401    1.178377
      Other  |   1.052649   .0606274     0.89   0.373      .940283    1.178443
    Unknown  |    1.01114   .0527451     0.21   0.832     .9128711    1.119988
             |
        male |
       Male  |   .9598313   .0304361    -1.29   0.196     .9019936    1.021378
        age1 |   1.002566   .0044413     0.58   0.563     .9938985    1.011308
        age2 |   .9873841   .0157542    -0.80   0.426     .9569841     1.01875
        age3 |   1.032847   .0436516     0.76   0.444     .9507388    1.122045
             |
         imd |
          4  |   .9550929   .0383564    -1.14   0.253     .8827983    1.033308
5 most de..  |   .8931393   .0494175    -2.04   0.041     .8013497    .9954428
             |
   bmicat_sa |
Normal (..)  |   1.128263   .1425812     0.95   0.340     .8807288    1.445369
Overweig..)  |   1.182745   .1447504     1.37   0.170     .9305008    1.503369
Obese I ..)  |   1.143069    .138044     1.11   0.268     .9021447    1.448334
Obese II..)  |   1.205876   .1449763     1.56   0.119     .9527235    1.526294
Obese II..)  |   1.236182   .1466081     1.79   0.074     .9797878     1.55967
    Unknown  |   1.207577   .1442956     1.58   0.114     .9554394    1.526253
             |
    hba1ccat |
  >=6.5-7.4  |   .9374863     .04027    -1.50   0.133     .8617897    1.019832
  >=7.5-7.9  |   .9440353   .0640777    -0.85   0.396     .8264408    1.078362
    >=8-8.9  |   1.028513   .0607148     0.48   0.634     .9161399    1.154669
        >=9  |   1.039513   .0814381     0.49   0.621     .8915483    1.212036
    Unknown  |   .9948899   .2495785    -0.02   0.984     .6084744    1.626701
             |
gp_consult~t |    .987516    .006792    -1.83   0.068     .9742933    1.000918
             |
smoke_nomiss |
     Former  |   .9721421   .1120688    -0.25   0.806      .775538    1.218587
    Current  |   1.068631   .0504364     1.41   0.160     .9742117    1.172201
             |
1.hyperten~n |   .9780958   .0387747    -0.56   0.576     .9049762    1.057123
             |
      bp_cat |
High, sta..  |   1.07e+08          .        .       .            .           .
High, sta..  |   6.86e+07   2.81e+07    44.12   0.000     3.08e+07    1.53e+08
    Unknown  |   6.94e+07   2.86e+07    43.86   0.000     3.10e+07    1.56e+08
             |
    1.asthma |   .9375515   .0777954    -0.78   0.437     .7968284    1.103127
1.~y_disease |   1.094693   .0420561     2.35   0.019     1.015291    1.180304
1.~c_disease |   1.077344   .0414592     1.94   0.053     .9990745    1.161746
             |
     dm_type |
       T1DM  |   1.153325   .1022424     1.61   0.108     .9693769     1.37218
       T2DM  |   1.016583   .0401515     0.42   0.677     .9408565    1.098405
 UNKNOWN_DM  |   1.075548   .1170081     0.67   0.503     .8690173    1.331164
             |
    1.cancer |   1.060666   .0411423     1.52   0.129     .9830173    1.144447
1.~r_disease |   1.058614   .0411325     1.47   0.143     .9809887    1.142381
    1.stroke |   1.083853   .0416936     2.09   0.036     1.005139     1.16873
  1.dementia |   1.058018   .0411231     1.45   0.147     .9804116    1.141767
1.other_ne~o |   .9898184   .0391462    -0.26   0.796     .9159915    1.069596
             |
      egfr60 |
   eGFR <60  |   1.129889   .1688523     0.82   0.414     .8430069      1.5144
      1.esrf |   .9629659   .0384298    -0.95   0.344     .8905152    1.041311
1.immunosu~d |   .9941282   .0327281    -0.18   0.858     .9320081    1.060389
1.ra_sle_p~s |   1.059888   .0411619     1.50   0.134     .9822063    1.143714
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model2_onscoviddeath_eth5.ster not found)
file ./output/model2_onscoviddeath_eth5.ster saved
(note: file ./output/model2_onscoviddeath_eth5.dta not found)
file ./output/model2_onscoviddeath_eth5.dta saved

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,971                  Number of obs    =      66,971
No. of failures =        4,027
Time at risk    =      7021368
                                                LR chi2(45)      =       54.65
Log likelihood  =   -34929.104                  Prob > chi2      =      0.1534

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   1.016429   .0590752     0.28   0.779     .9069948    1.139066
      Black  |    1.03628   .0603813     0.61   0.541     .9244428    1.161648
      Mixed  |   1.052613   .0606239     0.89   0.373     .9402535      1.1784
      Other  |   1.052622    .060626     0.89   0.373     .9402586    1.178413
    Unknown  |   1.011105   .0527449     0.21   0.832      .912836    1.119953
             |
        male |
       Male  |   .9598573   .0304371    -1.29   0.196     .9020176    1.021406
        age1 |   1.002563   .0044413     0.58   0.563     .9938964    1.011306
        age2 |   .9873888   .0157544    -0.80   0.426     .9569884    1.018755
        age3 |   1.032834   .0436516     0.76   0.445     .9507261    1.122033
             |
         imd |
          4  |   .9550728    .038356    -1.14   0.252      .882779    1.033287
5 most de..  |   .8931147   .0494163    -2.04   0.041     .8013274    .9954158
             |
   bmicat_sa |
Normal (..)  |   1.128452   .1426073     0.96   0.339     .8808725    1.445616
Overweig..)  |   1.183019   .1447896     1.37   0.170     .9307077    1.503731
Obese I ..)  |   1.143255   .1380693     1.11   0.268     .9022874    1.448577
Obese II..)  |   1.206143   .1450132     1.56   0.119     .9529272    1.526644
Obese II..)  |    1.23643   .1466423     1.79   0.074     .9799766    1.559995
    Unknown  |   1.207786   .1443235     1.58   0.114        .9556    1.526524
             |
    hba1ccat |
  >=6.5-7.4  |   .9375347   .0402727    -1.50   0.133     .8618332    1.019886
  >=7.5-7.9  |   .9441143   .0640845    -0.85   0.397     .8265075    1.078456
    >=8-8.9  |   1.028439   .0607115     0.48   0.635     .9160728    1.154589
        >=9  |   1.039597   .0814454     0.50   0.620     .8916182    1.212134
    Unknown  |   .9951164   .2496373    -0.02   0.984     .6086105    1.627078
             |
gp_consult~t |   .9875219   .0067921    -1.83   0.068     .9742989    1.000924
             |
smoke_nomiss |
     Former  |   .9722464   .1120825    -0.24   0.807     .7756184    1.218722
    Current  |   1.068646   .0504371     1.41   0.160     .9742252    1.172217
             |
1.hyperten~n |   .9780887   .0387749    -0.56   0.576     .9049688    1.057117
             |
      bp_cat |
High, sta..  |   1.07e+08          .        .       .            .           .
High, sta..  |   6.86e+07   2.80e+07    44.12   0.000     3.08e+07    1.53e+08
    Unknown  |   6.94e+07   2.86e+07    43.86   0.000     3.10e+07    1.55e+08
             |
    1.asthma |   .9374791   .0777924    -0.78   0.437     .7967618    1.103049
1.~y_disease |   1.094669   .0420554     2.35   0.019     1.015269    1.180279
1.~c_disease |   1.077312     .04146     1.94   0.053     .9990405    1.161715
             |
     dm_type |
       T1DM  |   1.153059   .1022265     1.61   0.108     .9691408    1.371881
       T2DM  |    1.01655   .0401505     0.42   0.678     .9408252    1.098369
 UNKNOWN_DM  |   1.075413   .1169953     0.67   0.504     .8689048    1.331001
             |
    1.cancer |     1.0607   .0411439     1.52   0.129     .9830484    1.144485
1.~r_disease |   1.058634   .0411337     1.47   0.143     .9810064    1.142403
    1.stroke |   1.083856   .0416938     2.09   0.036     1.005142    1.168733
  1.dementia |    1.05802   .0411235     1.45   0.147     .9804128     1.14177
1.other_ne~o |   .9898513   .0391479    -0.26   0.796     .9160212    1.069632
             |
      egfr60 |
   eGFR <60  |   1.129869   .1688485     0.82   0.414     .8429929    1.514371
      1.esrf |   .9630018   .0384318    -0.94   0.345     .8905474    1.041351
1.immunosu~d |    .994106   .0327289    -0.18   0.858     .9319844    1.060368
1.ra_sle_p~s |    1.05987   .0411624     1.50   0.134     .9821869    1.143696
             |
hh_total_cat |
       6-10  |   .9869965   .1035803    -0.12   0.901     .8035009    1.212397
        11+  |   1.076182   .4535649     0.17   0.862     .4711294    2.458277
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model3_onscoviddeath_eth5.ster not found)
file ./output/model3_onscoviddeath_eth5.ster saved
(note: file ./output/model3_onscoviddeath_eth5.dta not found)
file ./output/model3_onscoviddeath_eth5.dta saved
(output written to ./output/estout_table2_eth5.txt)
ons_noncoviddeath
(11,780 observations deleted)

         failure _d:  ons_noncoviddeath
   analysis time _t:  (stime_ons_noncoviddeath-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,971                  Number of obs    =      66,971
No. of failures =       12,073
Time at risk    =      7021368
                                                LR chi2(5)       =        8.73
Log likelihood  =   -104779.08                  Prob > chi2      =      0.1204

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   .9788689   .0322216    -0.65   0.516     .9177099    1.044104
      Black  |   .9778063   .0324546    -0.68   0.499     .9162213    1.043531
      Mixed  |   1.004481   .0328639     0.14   0.891     .9420908    1.071003
      Other  |   .9278998   .0309549    -2.24   0.025     .8691702    .9905977
    Unknown  |   .9522133   .0281989    -1.65   0.098     .8985179    1.009117
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/crude_ons_noncoviddeath_eth5.ster not found)
file ./output/crude_ons_noncoviddeath_eth5.ster saved
(note: file ./output/crude_ons_noncoviddeath_eth5.dta not found)
file ./output/crude_ons_noncoviddeath_eth5.dta saved

         failure _d:  ons_noncoviddeath
   analysis time _t:  (stime_ons_noncoviddeath-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,971                  Number of obs    =      66,971
No. of failures =       12,073
Time at risk    =      7021368
                                                LR chi2(9)       =        9.84
Log likelihood  =   -104778.52                  Prob > chi2      =      0.3637

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   .9790114   .0322268    -0.64   0.519     .9178425    1.044257
      Black  |   .9777438   .0324527    -0.68   0.498     .9161625    1.043464
      Mixed  |   1.004602   .0328684     0.14   0.888     .9422033    1.071133
      Other  |   .9279239   .0309563    -2.24   0.025     .8691917    .9906247
    Unknown  |   .9522088   .0281988    -1.65   0.098     .8985135    1.009113
             |
        male |
       Male  |   1.012943   .0184403     0.71   0.480     .9774383    1.049738
        age1 |   1.000858    .002487     0.35   0.730     .9959952    1.005744
        age2 |   .9955094   .0090132    -0.50   0.619     .9779996    1.013333
        age3 |   1.011933   .0243367     0.49   0.622     .9653407    1.060774
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model0_ons_noncoviddeath_eth5.ster not found)
file ./output/model0_ons_noncoviddeath_eth5.ster saved
(note: file ./output/model0_ons_noncoviddeath_eth5.dta not found)
file ./output/model0_ons_noncoviddeath_eth5.dta saved

         failure _d:  ons_noncoviddeath
   analysis time _t:  (stime_ons_noncoviddeath-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,971                  Number of obs    =      66,971
No. of failures =       12,073
Time at risk    =      7021368
                                                LR chi2(11)      =       10.53
Log likelihood  =   -104778.17                  Prob > chi2      =      0.4833

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   .9789414   .0322246    -0.65   0.518     .9177766    1.044182
      Black  |   .9776985   .0324514    -0.68   0.497     .9161196    1.043417
      Mixed  |   1.004705    .032872     0.14   0.886     .9422995    1.071244
      Other  |   .9279903   .0309595    -2.24   0.025     .8692521    .9906975
    Unknown  |   .9521669   .0281977    -1.66   0.098     .8984737    1.009069
             |
        male |
       Male  |   1.012998   .0184414     0.71   0.478     .9774903    1.049795
        age1 |   1.000878   .0024871     0.35   0.724     .9960157    1.005765
        age2 |   .9954307   .0090128    -0.51   0.613     .9779217    1.013253
        age3 |   1.012141   .0243425     0.50   0.616     .9655374    1.060994
             |
         imd |
          4  |   .9909571   .0228292    -0.39   0.693     .9472079    1.036727
5 most de..  |   .9759379   .0302312    -0.79   0.432     .9184487    1.037026
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,971                  Number of obs    =      66,971
No. of failures =       12,073
Time at risk    =      7021368
                                                LR chi2(11)      =       10.53
Log likelihood  =   -104778.17                  Prob > chi2      =      0.4833

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   .9789414   .0322246    -0.65   0.518     .9177766    1.044182
      Black  |   .9776985   .0324514    -0.68   0.497     .9161196    1.043417
      Mixed  |   1.004705    .032872     0.14   0.886     .9422995    1.071244
      Other  |   .9279903   .0309595    -2.24   0.025     .8692521    .9906975
    Unknown  |   .9521669   .0281977    -1.66   0.098     .8984737    1.009069
             |
        male |
       Male  |   1.012998   .0184414     0.71   0.478     .9774903    1.049795
        age1 |   1.000878   .0024871     0.35   0.724     .9960157    1.005765
        age2 |   .9954307   .0090128    -0.51   0.613     .9779217    1.013253
        age3 |   1.012141   .0243425     0.50   0.616     .9655374    1.060994
             |
         imd |
          4  |   .9909571   .0228292    -0.39   0.693     .9472079    1.036727
5 most de..  |   .9759379   .0302312    -0.79   0.432     .9184487    1.037026
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model1_ons_noncoviddeath_eth5.ster not found)
file ./output/model1_ons_noncoviddeath_eth5.ster saved
(note: file ./output/model1_ons_noncoviddeath_eth5.dta not found)
file ./output/model1_ons_noncoviddeath_eth5.dta saved

         failure _d:  ons_noncoviddeath
   analysis time _t:  (stime_ons_noncoviddeath-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,971                  Number of obs    =      66,971
No. of failures =       12,073
Time at risk    =      7021368
                                                LR chi2(43)      =       57.21
Log likelihood  =   -104754.83                  Prob > chi2      =      0.0721

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   .9813603   .0323913    -0.57   0.569     .9198846    1.046945
      Black  |    .976503   .0324173    -0.72   0.474     .9149891    1.042152
      Mixed  |   1.004645   .0328761     0.14   0.887     .9422321    1.071192
      Other  |   .9281854   .0309725    -2.23   0.026     .8694229    .9909194
    Unknown  |   .9519265   .0281979    -1.66   0.096     .8982333    1.008829
             |
        male |
       Male  |   1.016962   .0186233     0.92   0.358     .9811079    1.054125
        age1 |   1.000826   .0025711     0.32   0.748     .9957995    1.005878
        age2 |   .9954678   .0091909    -0.49   0.623     .9776159    1.013646
        age3 |   1.011486   .0247031     0.47   0.640     .9642098    1.061081
             |
         imd |
          4  |   .9914313   .0228466    -0.37   0.709     .9476488    1.037236
5 most de..  |   .9760006   .0302419    -0.78   0.433     .9184915     1.03711
             |
   bmicat_sa |
Normal (..)  |   1.005263   .0657729     0.08   0.936     .8842742    1.142806
Overweig..)  |   .9269433   .0591168    -1.19   0.234     .8180255    1.050363
Obese I ..)  |   .9120176   .0571485    -1.47   0.142     .8066136    1.031195
Obese II..)  |   .9228508   .0576613    -1.28   0.199     .8164827    1.043076
Obese II..)  |   .9278752   .0570263    -1.22   0.223      .822575    1.046655
    Unknown  |   .9319188   .0577488    -1.14   0.255     .8253366    1.052265
             |
    hba1ccat |
  >=6.5-7.4  |   1.015382   .0247676     0.63   0.531     .9679806    1.065105
  >=7.5-7.9  |   1.135686   .0415391     3.48   0.001     1.057121    1.220091
    >=8-8.9  |   1.055041   .0360979     1.57   0.117     .9866106    1.128218
        >=9  |   1.056458   .0481299     1.21   0.228      .966214    1.155131
    Unknown  |   .9659185   .1444742    -0.23   0.817     .7204847     1.29496
             |
gp_consult~t |   .9974443   .0039415    -0.65   0.517      .989749    1.005199
             |
smoke_nomiss |
     Former  |   1.003802   .0655705     0.06   0.954     .8831731    1.140907
    Current  |   1.029155   .0284643     1.04   0.299     .9748508    1.086483
             |
1.hyperten~n |   .9485767   .0219236    -2.28   0.022     .9065659    .9925343
             |
      bp_cat |
High, sta..  |   1.86e+08          .        .       .            .           .
High, sta..  |   1.81e+08   5.22e+07    65.78   0.000     1.02e+08    3.18e+08
    Unknown  |   1.83e+08   5.32e+07    65.55   0.000     1.04e+08    3.24e+08
             |
    1.asthma |   .9897354   .0461181    -0.22   0.825     .9033504    1.084381
1.~y_disease |   .9932489   .0226628    -0.30   0.767     .9498093    1.038675
1.~c_disease |   1.000321   .0227174     0.01   0.989     .9567718    1.045852
             |
     dm_type |
       T1DM  |   1.068904   .0567938     1.25   0.210     .9631899     1.18622
       T2DM  |   1.032582   .0234008     1.41   0.157     .9877209    1.079481
 UNKNOWN_DM  |   .9631184   .0639241    -0.57   0.571     .8456366    1.096922
             |
    1.cancer |   1.013905   .0230094     0.61   0.543     .9697961    1.060021
1.~r_disease |   1.011456   .0230183     0.50   0.617      .967332    1.057592
    1.stroke |   .9886527   .0225664    -0.50   0.617     .9453982    1.033886
  1.dementia |   1.033596   .0233669     1.46   0.144     .9887977    1.080424
1.other_ne~o |   .9821311   .0224813    -0.79   0.431     .9390424    1.027197
             |
      egfr60 |
   eGFR <60  |   1.202431    .101407     2.19   0.029     1.019234    1.418555
      1.esrf |   1.038751   .0233979     1.69   0.091     .9938898    1.085638
1.immunosu~d |    .995396   .0189213    -0.24   0.808     .9589932    1.033181
1.ra_sle_p~s |   .9975243   .0227644    -0.11   0.914       .95389    1.043155
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,971                  Number of obs    =      66,971
No. of failures =       12,073
Time at risk    =      7021368
                                                LR chi2(43)      =       57.21
Log likelihood  =   -104754.83                  Prob > chi2      =      0.0721

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   .9813603   .0323913    -0.57   0.569     .9198846    1.046945
      Black  |    .976503   .0324173    -0.72   0.474     .9149891    1.042152
      Mixed  |   1.004645   .0328761     0.14   0.887     .9422321    1.071192
      Other  |   .9281854   .0309725    -2.23   0.026     .8694229    .9909194
    Unknown  |   .9519265   .0281979    -1.66   0.096     .8982333    1.008829
             |
        male |
       Male  |   1.016962   .0186233     0.92   0.358     .9811079    1.054125
        age1 |   1.000826   .0025711     0.32   0.748     .9957995    1.005878
        age2 |   .9954678   .0091909    -0.49   0.623     .9776159    1.013646
        age3 |   1.011486   .0247031     0.47   0.640     .9642098    1.061081
             |
         imd |
          4  |   .9914313   .0228466    -0.37   0.709     .9476488    1.037236
5 most de..  |   .9760006   .0302419    -0.78   0.433     .9184915     1.03711
             |
   bmicat_sa |
Normal (..)  |   1.005263   .0657729     0.08   0.936     .8842742    1.142806
Overweig..)  |   .9269433   .0591168    -1.19   0.234     .8180255    1.050363
Obese I ..)  |   .9120176   .0571485    -1.47   0.142     .8066136    1.031195
Obese II..)  |   .9228508   .0576613    -1.28   0.199     .8164827    1.043076
Obese II..)  |   .9278752   .0570263    -1.22   0.223      .822575    1.046655
    Unknown  |   .9319188   .0577488    -1.14   0.255     .8253366    1.052265
             |
    hba1ccat |
  >=6.5-7.4  |   1.015382   .0247676     0.63   0.531     .9679806    1.065105
  >=7.5-7.9  |   1.135686   .0415391     3.48   0.001     1.057121    1.220091
    >=8-8.9  |   1.055041   .0360979     1.57   0.117     .9866106    1.128218
        >=9  |   1.056458   .0481299     1.21   0.228      .966214    1.155131
    Unknown  |   .9659185   .1444742    -0.23   0.817     .7204847     1.29496
             |
gp_consult~t |   .9974443   .0039415    -0.65   0.517      .989749    1.005199
             |
smoke_nomiss |
     Former  |   1.003802   .0655705     0.06   0.954     .8831731    1.140907
    Current  |   1.029155   .0284643     1.04   0.299     .9748508    1.086483
             |
1.hyperten~n |   .9485767   .0219236    -2.28   0.022     .9065659    .9925343
             |
      bp_cat |
High, sta..  |   1.86e+08          .        .       .            .           .
High, sta..  |   1.81e+08   5.22e+07    65.78   0.000     1.02e+08    3.18e+08
    Unknown  |   1.83e+08   5.32e+07    65.55   0.000     1.04e+08    3.24e+08
             |
    1.asthma |   .9897354   .0461181    -0.22   0.825     .9033504    1.084381
1.~y_disease |   .9932489   .0226628    -0.30   0.767     .9498093    1.038675
1.~c_disease |   1.000321   .0227174     0.01   0.989     .9567718    1.045852
             |
     dm_type |
       T1DM  |   1.068904   .0567938     1.25   0.210     .9631899     1.18622
       T2DM  |   1.032582   .0234008     1.41   0.157     .9877209    1.079481
 UNKNOWN_DM  |   .9631184   .0639241    -0.57   0.571     .8456366    1.096922
             |
    1.cancer |   1.013905   .0230094     0.61   0.543     .9697961    1.060021
1.~r_disease |   1.011456   .0230183     0.50   0.617      .967332    1.057592
    1.stroke |   .9886527   .0225664    -0.50   0.617     .9453982    1.033886
  1.dementia |   1.033596   .0233669     1.46   0.144     .9887977    1.080424
1.other_ne~o |   .9821311   .0224813    -0.79   0.431     .9390424    1.027197
             |
      egfr60 |
   eGFR <60  |   1.202431    .101407     2.19   0.029     1.019234    1.418555
      1.esrf |   1.038751   .0233979     1.69   0.091     .9938898    1.085638
1.immunosu~d |    .995396   .0189213    -0.24   0.808     .9589932    1.033181
1.ra_sle_p~s |   .9975243   .0227644    -0.11   0.914       .95389    1.043155
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model2_ons_noncoviddeath_eth5.ster not found)
file ./output/model2_ons_noncoviddeath_eth5.ster saved
(note: file ./output/model2_ons_noncoviddeath_eth5.dta not found)
file ./output/model2_ons_noncoviddeath_eth5.dta saved

         failure _d:  ons_noncoviddeath
   analysis time _t:  (stime_ons_noncoviddeath-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,971                  Number of obs    =      66,971
No. of failures =       12,073
Time at risk    =      7021368
                                                LR chi2(45)      =       57.39
Log likelihood  =   -104754.74                  Prob > chi2      =      0.1018

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   .9812404    .032389    -0.57   0.566      .919769     1.04682
      Black  |   .9764446   .0324157    -0.72   0.473     .9149338    1.042091
      Mixed  |    1.00459    .032875     0.14   0.889     .9421788    1.071135
      Other  |   .9281652   .0309719    -2.23   0.025     .8694039     .990898
    Unknown  |   .9518356   .0281961    -1.67   0.096     .8981459    1.008735
             |
        male |
       Male  |   1.016955   .0186234     0.92   0.359     .9811016     1.05412
        age1 |   1.000826   .0025711     0.32   0.748     .9957997    1.005878
        age2 |   .9954609    .009191    -0.49   0.622     .9776088    1.013639
        age3 |   1.011506   .0247041     0.47   0.639     .9642271    1.061102
             |
         imd |
          4  |   .9914438   .0228471    -0.37   0.709     .9476606     1.03725
5 most de..  |   .9759691    .030241    -0.79   0.432     .9184617    1.037077
             |
   bmicat_sa |
Normal (..)  |   1.005348   .0657796     0.08   0.935     .8843473    1.142906
Overweig..)  |   .9271118   .0591299    -1.19   0.235     .8181702    1.050559
Obese I ..)  |   .9121433   .0571577    -1.47   0.142     .8067225     1.03134
Obese II..)  |   .9229832   .0576715    -1.28   0.200     .8165965     1.04323
Obese II..)  |   .9280363   .0570383    -1.22   0.224     .8227143    1.046841
    Unknown  |   .9320262   .0577566    -1.14   0.256     .8254298    1.052388
             |
    hba1ccat |
  >=6.5-7.4  |     1.0154   .0247685     0.63   0.531     .9679969    1.065125
  >=7.5-7.9  |   1.135673   .0415398     3.48   0.001     1.057106    1.220078
    >=8-8.9  |   1.054986   .0360964     1.56   0.118     .9865585     1.12816
        >=9  |    1.05648   .0481314     1.21   0.228     .9662339    1.155156
    Unknown  |   .9659691    .144483    -0.23   0.817     .7205205    1.295031
             |
gp_consult~t |   .9974562   .0039417    -0.64   0.519     .9897605    1.005212
             |
smoke_nomiss |
     Former  |   1.003952   .0655813     0.06   0.952     .8833031     1.14108
    Current  |   1.029157   .0284643     1.04   0.299     .9748527    1.086485
             |
1.hyperten~n |   .9485417    .021923    -2.29   0.022      .906532    .9924982
             |
      bp_cat |
High, sta..  |   1.86e+08          .        .       .            .           .
High, sta..  |   1.80e+08   5.21e+07    65.78   0.000     1.02e+08    3.18e+08
    Unknown  |   1.83e+08   5.32e+07    65.55   0.000     1.04e+08    3.24e+08
             |
    1.asthma |   .9895834   .0461124    -0.22   0.822      .903209    1.084218
1.~y_disease |   .9932178   .0226622    -0.30   0.766     .9497793    1.038643
1.~c_disease |   1.000222   .0227165     0.01   0.992     .9566745    1.045751
             |
     dm_type |
       T1DM  |   1.068636   .0567844     1.25   0.212     .9629403    1.185934
       T2DM  |   1.032579   .0234009     1.41   0.157     .9877177    1.079478
 UNKNOWN_DM  |   .9629868   .0639162    -0.57   0.570     .8455195    1.096774
             |
    1.cancer |   1.013929     .02301     0.61   0.542      .969818    1.060045
1.~r_disease |   1.011441   .0230181     0.50   0.617     .9673175    1.057577
    1.stroke |   .9886456   .0225662    -0.50   0.617     .9453914    1.033879
  1.dementia |   1.033615   .0233674     1.46   0.144     .9888153    1.080444
1.other_ne~o |   .9821661   .0224822    -0.79   0.432     .9390756    1.027234
             |
      egfr60 |
   eGFR <60  |   1.202376    .101402     2.19   0.029     1.019189     1.41849
      1.esrf |   1.038805   .0233995     1.69   0.091     .9939402    1.085694
1.immunosu~d |   .9953216   .0189208    -0.25   0.805     .9589199    1.033105
1.ra_sle_p~s |   .9974647   .0227636    -0.11   0.911      .953832    1.043093
             |
hh_total_cat |
       6-10  |   1.011342   .0620417     0.18   0.854     .8967684    1.140554
        11+  |   1.107952   .2698035     0.42   0.674     .6874488    1.785672
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model3_ons_noncoviddeath_eth5.ster not found)
file ./output/model3_ons_noncoviddeath_eth5.ster saved
(note: file ./output/model3_ons_noncoviddeath_eth5.dta not found)
file ./output/model3_ons_noncoviddeath_eth5.dta saved
(output written to ./output/estout_table2_eth5.txt)
onsdeath
(11,780 observations deleted)

         failure _d:  onsdeath
   analysis time _t:  (stime_onsdeath-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,971                  Number of obs    =      66,971
No. of failures =       16,100
Time at risk    =      7021368
                                                LR chi2(5)       =        6.57
Log likelihood  =   -139736.58                  Prob > chi2      =      0.2547

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   .9896265   .0283256    -0.36   0.716     .9356378     1.04673
      Black  |   .9918509   .0286016    -0.28   0.777     .9373476    1.049523
      Mixed  |   1.016453   .0289126     0.57   0.566     .9613362     1.07473
      Other  |   .9574951   .0276284    -1.51   0.132     .9048472    1.013206
    Unknown  |   .9662134   .0248798    -1.33   0.182       .91866    1.016228
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/crude_onsdeath_eth5.ster not found)
file ./output/crude_onsdeath_eth5.ster saved
(note: file ./output/crude_onsdeath_eth5.dta not found)
file ./output/crude_onsdeath_eth5.dta saved

         failure _d:  onsdeath
   analysis time _t:  (stime_onsdeath-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,971                  Number of obs    =      66,971
No. of failures =       16,100
Time at risk    =      7021368
                                                LR chi2(9)       =        8.28
Log likelihood  =   -139735.73                  Prob > chi2      =      0.5059

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   .9897785   .0283304    -0.36   0.720     .9357807    1.046892
      Black  |   .9918229   .0286009    -0.28   0.776     .9373209    1.049494
      Mixed  |   1.016555   .0289159     0.58   0.564     .9614313    1.074838
      Other  |   .9574887   .0276288    -1.51   0.132     .9048401    1.013201
    Unknown  |   .9662287   .0248803    -1.33   0.182     .9186743    1.016245
             |
        male |
       Male  |   .9984628   .0157414    -0.10   0.922     .9680821    1.029797
        age1 |    1.00111   .0021523     0.52   0.606     .9969008    1.005338
        age2 |   .9940045   .0077901    -0.77   0.443     .9788529    1.009391
        age3 |   1.015886   .0211548     0.76   0.449     .9752577    1.058206
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model0_onsdeath_eth5.ster not found)
file ./output/model0_onsdeath_eth5.ster saved
(note: file ./output/model0_onsdeath_eth5.dta not found)
file ./output/model0_onsdeath_eth5.dta saved

         failure _d:  onsdeath
   analysis time _t:  (stime_onsdeath-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,971                  Number of obs    =      66,971
No. of failures =       16,100
Time at risk    =      7021368
                                                LR chi2(11)      =       11.60
Log likelihood  =   -139734.07                  Prob > chi2      =      0.3945

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   .9896399   .0283266    -0.36   0.716     .9356494    1.046746
      Black  |   .9917223   .0285983    -0.29   0.773     .9372254    1.049388
      Mixed  |    1.01675   .0289217     0.58   0.559      .961616    1.075046
      Other  |   .9576032   .0276329    -1.50   0.133     .9049468    1.013324
    Unknown  |   .9661441   .0248782    -1.34   0.181     .9185938    1.016156
             |
        male |
       Male  |    .998563   .0157431    -0.09   0.927     .9681791    1.029901
        age1 |   1.001149   .0021524     0.53   0.593     .9969396    1.005377
        age2 |   .9938566   .0077891    -0.79   0.432     .9787069    1.009241
        age3 |   1.016279   .0211634     0.78   0.438      .975635    1.058617
             |
         imd |
          4  |   .9819808   .0196213    -0.91   0.363     .9442672    1.021201
5 most de..  |   .9551878   .0258142    -1.70   0.090     .9059095    1.007147
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,971                  Number of obs    =      66,971
No. of failures =       16,100
Time at risk    =      7021368
                                                LR chi2(11)      =       11.60
Log likelihood  =   -139734.07                  Prob > chi2      =      0.3945

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   .9896399   .0283266    -0.36   0.716     .9356494    1.046746
      Black  |   .9917223   .0285983    -0.29   0.773     .9372254    1.049388
      Mixed  |    1.01675   .0289217     0.58   0.559      .961616    1.075046
      Other  |   .9576032   .0276329    -1.50   0.133     .9049468    1.013324
    Unknown  |   .9661441   .0248782    -1.34   0.181     .9185938    1.016156
             |
        male |
       Male  |    .998563   .0157431    -0.09   0.927     .9681791    1.029901
        age1 |   1.001149   .0021524     0.53   0.593     .9969396    1.005377
        age2 |   .9938566   .0077891    -0.79   0.432     .9787069    1.009241
        age3 |   1.016279   .0211634     0.78   0.438      .975635    1.058617
             |
         imd |
          4  |   .9819808   .0196213    -0.91   0.363     .9442672    1.021201
5 most de..  |   .9551878   .0258142    -1.70   0.090     .9059095    1.007147
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model1_onsdeath_eth5.ster not found)
file ./output/model1_onsdeath_eth5.ster saved
(note: file ./output/model1_onsdeath_eth5.dta not found)
file ./output/model1_onsdeath_eth5.dta saved

         failure _d:  onsdeath
   analysis time _t:  (stime_onsdeath-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,971                  Number of obs    =      66,971
No. of failures =       16,100
Time at risk    =      7021368
                                                LR chi2(43)      =       61.75
Log likelihood  =   -139708.99                  Prob > chi2      =      0.0318

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   .9897936   .0284064    -0.36   0.721      .935655    1.047065
      Black  |   .9908715   .0285787    -0.32   0.751      .936412    1.048498
      Mixed  |   1.016121    .028909     0.56   0.574     .9610115    1.074392
      Other  |   .9580655    .027652    -1.48   0.138     .9053729    1.013825
    Unknown  |   .9661426   .0248845    -1.34   0.181     .9185805    1.016167
             |
        male |
       Male  |   1.002395   .0158948     0.15   0.880     .9717207    1.034037
        age1 |   1.001262   .0022251     0.57   0.570     .9969102    1.005633
        age2 |   .9934409   .0079388    -0.82   0.410     .9780024    1.009123
        age3 |   1.016785   .0215004     0.79   0.431     .9755063     1.05981
             |
         imd |
          4  |   .9822227   .0196316    -0.90   0.369     .9444894    1.021463
5 most de..  |   .9550254   .0258171    -1.70   0.089      .905742     1.00699
             |
   bmicat_sa |
Normal (..)  |   1.030823   .0598822     0.52   0.601     .9198911    1.155133
Overweig..)  |   .9800627    .055393    -0.36   0.722     .8772918    1.094873
Obese I ..)  |   .9600035   .0533697    -0.73   0.463     .8608981    1.070518
Obese II..)  |    .981677   .0543902    -0.33   0.739     .8806583    1.094283
Obese II..)  |   .9919073   .0540942    -0.15   0.882     .8913543    1.103804
    Unknown  |   .9891771   .0543852    -0.20   0.843     .8881265    1.101725
             |
    hba1ccat |
  >=6.5-7.4  |   .9954659   .0211128    -0.21   0.830     .9549338    1.037718
  >=7.5-7.9  |   1.086684   .0349811     2.58   0.010     1.020241    1.157455
    >=8-8.9  |   1.048275   .0310307     1.59   0.111     .9891861    1.110893
        >=9  |   1.052106   .0414349     1.29   0.197       .97395    1.136533
    Unknown  |   .9733756   .1250491    -0.21   0.834     .7567057    1.252085
             |
gp_consult~t |   .9949635    .003409    -1.47   0.141     .9883043    1.001668
             |
smoke_nomiss |
     Former  |   .9959561   .0566023    -0.07   0.943     .8909731    1.113309
    Current  |   1.038975   .0247921     1.60   0.109     .9915018     1.08872
             |
1.hyperten~n |   .9559486   .0190868    -2.26   0.024     .9192618    .9940996
             |
      bp_cat |
High, sta..  |   7.79e+07          .        .       .            .           .
High, sta..  |   6.70e+07   1.58e+07    76.36   0.000     4.22e+07    1.06e+08
    Unknown  |   6.80e+07   1.61e+07    76.04   0.000     4.27e+07    1.08e+08
             |
    1.asthma |   .9767539   .0396836    -0.58   0.563     .9019916    1.057713
1.~y_disease |   1.018229   .0199725     0.92   0.357     .9798266    1.058137
1.~c_disease |   1.019345    .019935     0.98   0.327     .9810125    1.059175
             |
     dm_type |
       T1DM  |   1.090047   .0496764     1.89   0.058     .9969044    1.191892
       T2DM  |   1.028545   .0202175     1.43   0.152     .9896727    1.068944
 UNKNOWN_DM  |   .9914215   .0561715    -0.15   0.879     .8872201    1.107861
             |
    1.cancer |    1.02553   .0200872     1.29   0.198     .9869061    1.065666
1.~r_disease |   1.023207   .0200922     1.17   0.243     .9845753    1.063355
    1.stroke |    1.01214   .0198655     0.61   0.539     .9739436    1.051834
  1.dementia |   1.039659   .0203169     1.99   0.047     1.000592    1.080252
1.other_ne~o |    .984024   .0194947    -0.81   0.416     .9465473    1.022984
             |
      egfr60 |
   eGFR <60  |    1.18398   .0869578     2.30   0.021     1.025244    1.367291
      1.esrf |   1.019573   .0199982     0.99   0.323     .9811212    1.059532
1.immunosu~d |   .9950804   .0163808    -0.30   0.764     .9634871     1.02771
1.ra_sle_p~s |    1.01296   .0199293     0.65   0.513     .9746424    1.052783
------------------------------------------------------------------------------
                                                             Stratified by stp

-------------------------------------------------------------------------------
active results
-------------------------------------------------------------------------------

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,971                  Number of obs    =      66,971
No. of failures =       16,100
Time at risk    =      7021368
                                                LR chi2(43)      =       61.75
Log likelihood  =   -139708.99                  Prob > chi2      =      0.0318

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   .9897936   .0284064    -0.36   0.721      .935655    1.047065
      Black  |   .9908715   .0285787    -0.32   0.751      .936412    1.048498
      Mixed  |   1.016121    .028909     0.56   0.574     .9610115    1.074392
      Other  |   .9580655    .027652    -1.48   0.138     .9053729    1.013825
    Unknown  |   .9661426   .0248845    -1.34   0.181     .9185805    1.016167
             |
        male |
       Male  |   1.002395   .0158948     0.15   0.880     .9717207    1.034037
        age1 |   1.001262   .0022251     0.57   0.570     .9969102    1.005633
        age2 |   .9934409   .0079388    -0.82   0.410     .9780024    1.009123
        age3 |   1.016785   .0215004     0.79   0.431     .9755063     1.05981
             |
         imd |
          4  |   .9822227   .0196316    -0.90   0.369     .9444894    1.021463
5 most de..  |   .9550254   .0258171    -1.70   0.089      .905742     1.00699
             |
   bmicat_sa |
Normal (..)  |   1.030823   .0598822     0.52   0.601     .9198911    1.155133
Overweig..)  |   .9800627    .055393    -0.36   0.722     .8772918    1.094873
Obese I ..)  |   .9600035   .0533697    -0.73   0.463     .8608981    1.070518
Obese II..)  |    .981677   .0543902    -0.33   0.739     .8806583    1.094283
Obese II..)  |   .9919073   .0540942    -0.15   0.882     .8913543    1.103804
    Unknown  |   .9891771   .0543852    -0.20   0.843     .8881265    1.101725
             |
    hba1ccat |
  >=6.5-7.4  |   .9954659   .0211128    -0.21   0.830     .9549338    1.037718
  >=7.5-7.9  |   1.086684   .0349811     2.58   0.010     1.020241    1.157455
    >=8-8.9  |   1.048275   .0310307     1.59   0.111     .9891861    1.110893
        >=9  |   1.052106   .0414349     1.29   0.197       .97395    1.136533
    Unknown  |   .9733756   .1250491    -0.21   0.834     .7567057    1.252085
             |
gp_consult~t |   .9949635    .003409    -1.47   0.141     .9883043    1.001668
             |
smoke_nomiss |
     Former  |   .9959561   .0566023    -0.07   0.943     .8909731    1.113309
    Current  |   1.038975   .0247921     1.60   0.109     .9915018     1.08872
             |
1.hyperten~n |   .9559486   .0190868    -2.26   0.024     .9192618    .9940996
             |
      bp_cat |
High, sta..  |   7.79e+07          .        .       .            .           .
High, sta..  |   6.70e+07   1.58e+07    76.36   0.000     4.22e+07    1.06e+08
    Unknown  |   6.80e+07   1.61e+07    76.04   0.000     4.27e+07    1.08e+08
             |
    1.asthma |   .9767539   .0396836    -0.58   0.563     .9019916    1.057713
1.~y_disease |   1.018229   .0199725     0.92   0.357     .9798266    1.058137
1.~c_disease |   1.019345    .019935     0.98   0.327     .9810125    1.059175
             |
     dm_type |
       T1DM  |   1.090047   .0496764     1.89   0.058     .9969044    1.191892
       T2DM  |   1.028545   .0202175     1.43   0.152     .9896727    1.068944
 UNKNOWN_DM  |   .9914215   .0561715    -0.15   0.879     .8872201    1.107861
             |
    1.cancer |    1.02553   .0200872     1.29   0.198     .9869061    1.065666
1.~r_disease |   1.023207   .0200922     1.17   0.243     .9845753    1.063355
    1.stroke |    1.01214   .0198655     0.61   0.539     .9739436    1.051834
  1.dementia |   1.039659   .0203169     1.99   0.047     1.000592    1.080252
1.other_ne~o |    .984024   .0194947    -0.81   0.416     .9465473    1.022984
             |
      egfr60 |
   eGFR <60  |    1.18398   .0869578     2.30   0.021     1.025244    1.367291
      1.esrf |   1.019573   .0199982     0.99   0.323     .9811212    1.059532
1.immunosu~d |   .9950804   .0163808    -0.30   0.764     .9634871     1.02771
1.ra_sle_p~s |    1.01296   .0199293     0.65   0.513     .9746424    1.052783
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model2_onsdeath_eth5.ster not found)
file ./output/model2_onsdeath_eth5.ster saved
(note: file ./output/model2_onsdeath_eth5.dta not found)
file ./output/model2_onsdeath_eth5.dta saved

         failure _d:  onsdeath
   analysis time _t:  (stime_onsdeath-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =       66,971                  Number of obs    =      66,971
No. of failures =       16,100
Time at risk    =      7021368
                                                LR chi2(45)      =       61.95
Log likelihood  =    -139708.9                  Prob > chi2      =      0.0475

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |      .9897   .0284053    -0.36   0.718     .9355636    1.046969
      Black  |   .9908164   .0285774    -0.32   0.749     .9363594     1.04844
      Mixed  |   1.016084   .0289086     0.56   0.575     .9609748    1.074353
      Other  |   .9580437   .0276514    -1.49   0.138     .9053522    1.013802
    Unknown  |   .9660652   .0248833    -1.34   0.180     .9185054    1.016088
             |
        male |
       Male  |   1.002398    .015895     0.15   0.880      .971724    1.034041
        age1 |   1.001261   .0022251     0.57   0.571     .9969098    1.005632
        age2 |   .9934373   .0079389    -0.82   0.410     .9779986     1.00912
        age3 |   1.016795    .021501     0.79   0.431     .9755153    1.059822
             |
         imd |
          4  |   .9822273   .0196318    -0.90   0.370     .9444935    1.021469
5 most de..  |   .9549945   .0258163    -1.70   0.088     .9057125    1.006958
             |
   bmicat_sa |
Normal (..)  |   1.030933   .0598896     0.52   0.600     .9199877    1.155258
Overweig..)  |   .9802562   .0554061    -0.35   0.724     .8774612    1.095094
Obese I ..)  |   .9601445   .0533788    -0.73   0.464     .8610224    1.070678
Obese II..)  |   .9818393    .054401    -0.33   0.741     .8808007    1.094468
Obese II..)  |   .9920885    .054106    -0.15   0.884     .8915138    1.104009
    Unknown  |   .9893077   .0543934    -0.20   0.845     .8882419    1.101873
             |
    hba1ccat |
  >=6.5-7.4  |   .9954934   .0211138    -0.21   0.831     .9549595    1.037748
  >=7.5-7.9  |   1.086698   .0349825     2.58   0.010     1.020252    1.157472
    >=8-8.9  |   1.048216   .0310293     1.59   0.112       .98913    1.110831
        >=9  |   1.052145   .0414368     1.29   0.197     .9739854    1.136576
    Unknown  |   .9734738   .1250628    -0.21   0.834     .7567804    1.252214
             |
gp_consult~t |   .9949737   .0034091    -1.47   0.141     .9883143    1.001678
             |
smoke_nomiss |
     Former  |   .9960944   .0566111    -0.07   0.945     .8910952    1.113466
    Current  |    1.03898   .0247922     1.60   0.109     .9915069    1.088726
             |
1.hyperten~n |   .9559206   .0190864    -2.26   0.024     .9192344    .9940709
             |
      bp_cat |
High, sta..  |   7.79e+07          .        .       .            .           .
High, sta..  |   6.70e+07   1.58e+07    76.36   0.000     4.22e+07    1.06e+08
    Unknown  |   6.80e+07   1.61e+07    76.04   0.000     4.27e+07    1.08e+08
             |
    1.asthma |   .9766189   .0396794    -0.58   0.560     .9018646    1.057569
1.~y_disease |     1.0182   .0199721     0.92   0.358     .9797987    1.058107
1.~c_disease |   1.019262   .0199345     0.98   0.329     .9809309    1.059092
             |
     dm_type |
       T1DM  |   1.089781   .0496684     1.89   0.059     .9966538    1.191609
       T2DM  |   1.028533   .0202174     1.43   0.152      .989661    1.068931
 UNKNOWN_DM  |   .9912908   .0561649    -0.15   0.877     .8871017    1.107717
             |
    1.cancer |   1.025556   .0200878     1.29   0.198      .986931    1.065693
1.~r_disease |   1.023198   .0200921     1.17   0.243     .9845663    1.063345
    1.stroke |   1.012135   .0198654     0.61   0.539     .9739388    1.051829
  1.dementia |   1.039674   .0203173     1.99   0.046     1.000606    1.080268
1.other_ne~o |   .9840571   .0194955    -0.81   0.417     .9465789    1.023019
             |
      egfr60 |
   eGFR <60  |   1.183936   .0869543     2.30   0.022     1.025207     1.36724
      1.esrf |   1.019622   .0199995     0.99   0.322     .9811676    1.059584
1.immunosu~d |   .9950194   .0163805    -0.30   0.762     .9634265    1.027648
1.ra_sle_p~s |    1.01291   .0199288     0.65   0.514     .9745936    1.052733
             |
hh_total_cat |
       6-10  |   1.005106   .0532315     0.10   0.923     .9060066    1.115045
        11+  |    1.09979   .2318897     0.45   0.652     .7275031    1.662589
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model3_onsdeath_eth5.ster not found)
file ./output/model3_onsdeath_eth5.ster saved
(note: file ./output/model3_onsdeath_eth5.dta not found)
file ./output/model3_onsdeath_eth5.dta saved
(output written to ./output/estout_table2_eth5.txt)

. 
. file close tablecontent

. 
. ************************************************create forestplot dataset
. dsconcat `hr'

. duplicates drop

Duplicates in terms of all variables

(0 observations are duplicates)

. split idstr, p(_)
variables created as string: 
idstr1  idstr2  idstr3  idstr4

. ren idstr1 model

. ren idstr2 outcome

. drop idstr idstr3

. tab model

      model |      Freq.     Percent        Cum.
------------+-----------------------------------
      crude |         42        3.66        3.66
     model0 |         77        6.71       10.37
     model1 |         98        8.54       18.90
     model2 |        455       39.63       58.54
     model3 |        476       41.46      100.00
------------+-----------------------------------
      Total |      1,148      100.00

. 
. *save dataset for later
. outsheet using ./output/FP_multivariable_eth5.txt, replace
(note: file ./output/FP_multivariable_eth5.txt not found)

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/logs/04b_eth_an_multivariable_eth5.log
  log type:  text
 closed on:   5 May 2021, 17:48:47
-------------------------------------------------------------------------------
